{"query_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "documents": ["Ben's storylines include: a feud between the show's Mitchell and Beale families for his custody; developing a love of dance and the arts, which is a source of tension between him and his father, Phil Mitchell (Steve McFadden); being physically and mentally abused by Phil's girlfriend Stella Crawford (Sophie Thompson); struggling to come to terms with his homosexuality and then attempting to hide it before coming out; being imprisoned for manslaughter after unintentionally killing Heather Trott (Cheryl Fergison); having a daughter, Lexi Pearce, with Lola Pearce (Danielle Harold), finding out his mother Kathy Beale (Gillian Taylforth) is still alive after faking her own death, relationships with Paul Coker (Jonny Labey) and the closeted Callum Highway (Tony Clay), coming to terms with Paul's death in a homophobic attack, being shot by Hunter Owen (Charlie Winter), blackmailing Martin Fowler (James Bye), losing his hearing after sustaining an injury during a boat crash, going into crime with Danny Hardcastle (Paul Usher), featuring in a male rape storyline, in which Ben is raped by Lewis Butler (Aidan O'Callaghan), and suffering from bulimia. As played by Jones, Ben received generally poor reviews from critics. Grace Dent of \"The Guardian\" wrote several negative opinion pieces on the character, and contacted the BBC with a list of suggestions for humorous storylines in which he could be killed off.", "Fictional character from EastEnders\nBen Mitchell is a fictional character from the BBC soap opera \"EastEnders\", who has been played by six different actors since his on-screen birth on 21 March 1996. Matthew Silver appeared as an infant Ben between 1996 and 1998, and Morgan Whittle played him as a toddler between 1999 and 2001. After a five-year absence from the series, Charlie Jones assumed the role of Ben in 2006. In 2010, the character was recast with Joshua Pascoe in the role, who made his first appearance on 13 December 2010. Pascoe quit the role in 2012 and Ben departed on 24 August 2012. Ben's return was announced in May 2014 with Harry Reid in the role; Ben returned on 22 September 2014. Reid was written out of the series in 2017 and Ben departed on 12 January 2018. Ben was reintroduced in 2019 with the role recast to Max Bowden. Ben returned on 1 April 2019. In December 2023, it was announced Bowden would exit the role. Ben departed the series on 28 March 2024, after being extradited to America for credit card fraud.", "However, the storyline where Ben was abused by Stella won \"Best Storyline\" at the 2007 \"Inside Soap\" Awards, and was nominated for the \"Best Soap Storyline\" accolade at the \"TV Quick\" and \"TV Choice\" Awards. In 2012, Pascoe was nominated \"Villain of the Year\", but lost out to Andrew Lancel (\"Coronation Street\"). Lisa O'Connell, also writing for \"The Guardian\", was complimentary of Ben's later, protracted coming out storyline, which she called \"a perfect foundation for years of dramatic conflict\". Storylines. 1996–2012. Ben is born to Phil Mitchell (Steve McFadden) and his then wife Kathy Beale (Gillian Taylforth) in March 1996. Ben becomes ill and is rushed to hospital, where he is diagnosed with meningitis and he is left partially deaf in one ear. As Kathy gives Ben all her affection, Phil turns to alcohol and has an affair with Lorna Cartwright (Janet Dibley), resulting in the breakdown of their marriage. In 1998, Kathy moves to South Africa and takes Ben with her. He accompanies her on two return visits in 1999 before returning with her to South Africa in early 2000. In 2001, Kathy marries a man named Gavin Sullivan (then an unseen character; later played by Paul Nicholas). The same year, Ben briefly returns to stay with Phil who then takes him back to South Africa.", "In 2006, the residents hear that Kathy and Gavin have been killed in a car accident, so Ben (now played by Charlie Jones) returns to England to live with his half-brother, Ian Beale (Adam Woodyatt). He eventually moves in with Phil, after Phil wins a long custody battle. Ben dislikes Phil's new girlfriend Stella Crawford (Sophie Thompson), who in turn feels that Ben is intruding on their relationship. She abuses Ben physically and psychologically, from burning him with a hot spoon, also attempting to spoil his friendship with Abi Branning (Lorna Fitzgerald) when she discovers this, to threatening to kill Phil if Ben tells anyone about her actions. Phil and Stella become engaged. On their wedding day in July 2007, Ben admits that Stella has been abusing him; she commits suicide by jumping from a roof. Phil, a recovering alcoholic, begins drinking again in the aftermath, but resumes a life of sobriety for Ben's sake. Unbeknown to Phil, Ben develops an interest in dancing. He secretly takes classes, passing a dance exam, and is ultimately able to gain Phil's approval. In March 2010, Phil's daughter Louise Mitchell (Brittany Papple) comes to stay with the Mitchell family. She steals Ben's diary and fakes an entry which suggests he is gay. In retaliation, Ben burns Louise's hand the same way Stella burnt his. He later locks Louise in a summerhouse for a day in May 2010, then pretends to find her to earn approval from his father.", "Louise blames Jordan Johnson (Michael-Joel David Stuart), an acquaintance of Ben's, but when Phil sees burn marks on Louise's arm, she reveals that Ben is to blame. Phil worries Ben is copying Stella, and punches him when he catches Ben about to burn Louise again. Questioned as to why he hurt Louise, Ben claims that Jordan is bullying him. Phil advises Ben to fight back; soon after, Ben attacks Jordan with a spanner, leaving him with a fractured skull. Phil warns him against admitting to the attack, but Ben confesses and moves in with Ian. After hearing from Crown Court Ben could spend time in juvenile detention, Phil plans to send him to live with his brother Grant Mitchell (Ross Kemp) abroad, but Ben refuses thanks to his grandmother, Peggy Mitchell (Barbara Windsor), making him change his mind, after Phil's girlfriend Shirley Carter (Linda Henry) overhears Phil discussing the plans to Ben and receives a five-month sentence as a result. In July 2010, Phil indeed blames Peggy for Ben's sentencing. Ben tells Peggy and Phil he is coping despite being bullied by Cal Childs (Danny Barnham), and when the Mitchell family discovers this Ben asks them not to visit him. Ben, (now played by Joshua Pascoe) is released, and arrives home to discover Jay Brown (Jamie Borthwick), the foster child of Phil's relative Billy (Perry Fenwick), has usurped his place in Phil's affections. Ben is jealous of Jay initially but does develop a 'brotherly' relationship with him.", "But when Betsy tells Craig she is going to call her broker and sell some stocks to get money for the cruise, Craig panics. He has made some bad investments and lost all her money in the stock market. The Montgomeries are broke, only Betsy doesn't know it yet. In the process of attempting to help Steve, Betsy finds that she is still in love with him and decides to leave her husband. Upon returning from a romantic evening with Steve at the boathouse, Betsy went into labor. It was a breech birth, and Steve had to get her to the hospital quickly. Diana discovered him there and tried to get him to leave, but Steve couldn't tear himself away from Betsy, who gave birth to a healthy daughter. In remembrance of her father Dan, she named the child Danielle. Craig told his wife how much he loved her, and now that they had a child, he hoped things would be all right between them. Although Betsy told Craig it was over, things changed when he was fired from his job. Later, Betsy was so moved when she heard Craig talking to his sleeping daughter about his losses, and told Steve she couldn't leave Craig right now. When Steve exploded, Betsy stormed out, saying that they were through. On Kim's advice, a sad Betsy wrote a note to Steve telling him how much she loved him. However, unbeknownst to her, Craig found the note, tore it up and forged a new one saying Betsy loved Craig and regretted having to betray him.", "Robinson stops by a bar and finds his friend Théo, a tenor. Theo tells him a story about the time he was a music teacher to the Marquise d'Arcangues, who had a baby by him, that included Iris, who is tending the bar. The Marquise told Theo that she had a dream that if he and Iris made love, they would save the world. In the present, Biarritz is suddenly evacuated; Robinson decides to go to Zaragoza, Spain, to track Laetitia down. He stops by an abandoned boarding school and an earthquake occurs. Robinson continues his trip and arrives in Pamplona, where everyone is celebrating the Sanfermines. He finds Ombeline and the two walk their way through town trying to find a place to stay, to no avail. Ombeline tells Robinson that her husband has left her to search for another woman in Spain. He starts telling her his story, which he has been writing in the cooking book she sold him. Suddenly, there are terrorist attacks in Pamplona and the two leave for a hotel in the mountains; Ombeline manages to secure a suite that is usually reserved for the Royal Family. While Robinson and Ombeline make love, helicopters are seen through the windows. Later that night, while having dinner, Ombeline sees her husband with the other woman, Iris. Since Robinson will do nothing, she calls him a coward and he leaves. While leaving the hotel, he receives a video from his daughter who is doing well off in a ship.", "Upon returning to Oakdale, Betsy is ready to leave Craig but loses her nerve when he plans a romantic evening for her. Torn between her love for Steve and her commitment to Craig, Betsy makes love to Craig. When Betsy later becomes pregnant, she's convinced the child is Craig's and decides to commit herself to the marriage. Steve is left heartbroken over this decision, with Craig continuously hinting that Steve and Diana McColl seem to be an item now. Soon after, Steve is wanted for the theft of Whit McColl's gold coins. Later, Betsy finds a wounded Steve in the back seat. Despite knowing that he is wanted by the police, she takes him to the boathouse and tends to his wounds. Betsy enlists Steve's friend, Tucker Foster, to help them find out who framed Steve. Then Betsy's grandfather, David, catches Betsy sneaking into the supply room at Memorial Hospital to get medicine for Steve. David discovers that Steve is suffering from blood poisoning and gangrene and will die unless he gets treatment. With Betsy's help, David operates on Steve right there in the boathouse. Meanwhile, one of Whit's rare coins has been bought by Bobbi Maxwell and her boyfriend, Lonnie. They trace Tucker from the pawnshop and call him for a meeting. Betsy and Steve join the \"coin hunt\" and arrive for the meeting to try to buy back the coin. Craig is relieved, because now he could spend more time with Diana.", "Craig threatened to leave town with Danielle if Betsy called the police, and if she went to Steve, she'd never see her daughter again. Luckily, Craig's mother, Lyla, traced Danielle to the home of Mrs. Hoffman, a maid whom Betsy had fired previously, and Danielle was returned to her mother. At the same time, Diana McColl informed Steve that she knew Craig was faking his paralysis. Steve found Betsy at Kim's, and when she told him she'd left Craig for good, they had a joyful reunion. One day while driving, Betsy was in a terrible accident in Vermont. When she woke up, she needed plastic surgery because of the burns on her face and she had no memory of who she was. Betsy found herself becoming close to her doctor and agreed to marry him. After a while, though she started getting flashbacks of Oakdale and had to go there. While in Oakdale, Craig recognised Betsy and he reunited her with her family. At the same time, Steve had been arrested for the murder of Whit McColl. However, the McColl housekeeper Dorothy Connors confessed to the crime on the witness stand. Though Betsy loved Steve, they found themselves arguing more and more about money. Steve wanted the best for Betsy and spent lavishly but refused to tell Betsy where the money was coming from. Money pressures mounted when administration assistant Iva Snyder had an accident and Steve was unable to pay her medical bills. Soon they found themselves in debt, and Steve had to declare bankruptcy. Lucinda Walsh ended up buying Steve's construction company.", "English actor born 1986\nNicholas \"Nick\" Robinson is an English actor who has appeared regularly on British television, most famously as William Beech in \"Goodnight Mister Tom\", starring John Thaw. He also played the lead in the television series \"Harry and the Wrinklies\" based upon the book of the same name by Alan Temperley, produced by Scottish Television. Career. He began his career in theatre and, at the age of 7, appeared in the West End transfer of An Inspector Calls, produced by the National Theatre, at the Aldwych Theatre. His next appearance was in Theatre De Complicite's production of \"The Caucasian Chalk Circle\" in the Olivier Theatre and on its national tour. He later played the title role in the Royal Shakespeare Company's production of \"Little Eyolf\", directed by Adrian Noble. Robinson was most famous for his role in \"Goodnight Mister Tom\". This won the awards of the Bafta for the Most Popular TV programme in 1998 voted for by readers of the Radio Times, Best Drama performance in 1999 and the Best ITV/Channel 5 Programme of 1998. He has made a few other television programmes including an episode of \"Midsomer Murders\" and he was also in the film version of \"Tom's Midnight Garden\". Other appearances include \"Ruth Rendell Mysteries, Urban Gothic\" and \"Down to Earth\". Robinson also works extensively as a producer; most recently he presented the UK premiere production of Rodgers and Hammerstein's State Fair directed by Thom Southerland, at the Trafalgar Studios in London's West End."], "distances": [0.7109375, 0.56640625, 0.56640625, 0.51953125, 0.49609375, 0.3984375, 0.396484375, 0.392578125, 0.3671875, 0.365234375], "supports": [1, 0, 0, 0, 0, 0, 0, 0, 0, 1], "metadatas": [{"doc_name": "Ben Mitchell (EastEnders)", "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "support": 1, "pool_index": 161}, {"mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "pool_index": 160, "support": 0, "doc_name": "Ben Mitchell (EastEnders)"}, {"doc_name": "Ben Mitchell (EastEnders)", "pool_index": 162, "support": 0, "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f"}, {"pool_index": 163, "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "doc_name": "Ben Mitchell (EastEnders)", "support": 0}, {"pool_index": 164, "doc_name": "Ben Mitchell (EastEnders)", "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "support": 0}, {"mapped_id": "0177bf17-6a23-45b0-a27d-1cd9acc1290c", "support": 0, "doc_name": "Steve Andropoulos and Betsy Stewart", "pool_index": 237}, {"mapped_id": "00e6518d-0dc2-4893-8877-d1961c2ba127", "doc_name": "Happy End (2009 film)", "support": 0, "pool_index": 39}, {"doc_name": "Steve Andropoulos and Betsy Stewart", "mapped_id": "0177bf17-6a23-45b0-a27d-1cd9acc1290c", "pool_index": 236, "support": 0}, {"pool_index": 239, "support": 0, "doc_name": "Steve Andropoulos and Betsy Stewart", "mapped_id": "0177bf17-6a23-45b0-a27d-1cd9acc1290c"}, {"support": 1, "pool_index": 200, "mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc", "doc_name": "Nick Robinson (English actor)"}], "recall": 1.0, "precision": 0.2, "ndcg": 0.7903864795495061, "mrr": 1.0}
{"query_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "documents": ["&lt;templatestyles src=\"Div col/styles.css\"/&gt;\nOther cast members include Adam Godley as Mr. Teavee and Franziska Troegner as Mrs. Gloop. The other four Golden Ticket winners, Violet Beauregarde, Veruca Salt, Mike Teavee, and Augustus Gloop, are portrayed by AnnaSophia Robb, Julia Winter, Jordan Fry, and Philip Wiegratz, respectively. Blair Dunlop plays young Willy Wonka. Charlie's remaining grandparents, Grandma Georgina, Grandma Josephine, and Grandpa George, are portrayed by Liz Smith, Eileen Essell, and David Morris. Nitin Ganatra and Shelley Conn appear as Prince and Princess Pondicherry. Geoffrey Holder narrates the film. Production. Development. Author Roald Dahl disapproved of the 1971 film adaptation. Warner Bros. Pictures and Brillstein-Grey Entertainment entered into discussions with the Dahl estate in 1991, hoping to purchase the rights to produce another film version of \"Charlie and the Chocolate Factory\". The purchase was finalized in 1998, with Dahl's widow, Felicity (\"Liccy\"), and daughter, Lucy, receiving total artistic control and final privilege on the choices of actors, directors and writers. The Dahl estate's subsequent protection of the source material was the main reason that \"Charlie and the Chocolate Factory\" had languished in development hell since the 1990s.", "2005 film by Tim Burton\nCharlie and the Chocolate Factory is a 2005 musical fantasy film directed by Tim Burton and written by John August, based on the 1964 British novel of the same name by Roald Dahl. The film stars Johnny Depp as Willy Wonka and Freddie Highmore as Charlie Bucket, alongside David Kelly, Helena Bonham Carter, Noah Taylor, Missi Pyle, James Fox, Deep Roy, and Christopher Lee. The storyline follows Charlie as he wins a contest along with four other children and is led by Wonka on a tour of his chocolate factory. Development for a second adaptation of \"Charlie and the Chocolate Factory\" began in 1991, which resulted in Warner Bros. providing the Dahl estate with total artistic control. Prior to Burton's involvement, directors such as Gary Ross, Rob Minkoff, Martin Scorsese, and Tom Shadyac had been involved, while actors Bill Murray, Nicolas Cage, Jim Carrey, Michael Keaton, Brad Pitt, Will Smith, Adam Sandler, and many others, were either in discussion with or considered by the studio to play Wonka. Burton immediately brought regular collaborators Depp and Danny Elfman aboard. \"Charlie and the Chocolate Factory\" represents the first musical film directed by Burton and the first time since \"The Nightmare Before Christmas\" that Elfman contributed to a film score using written songs and his vocals. Filming took place from June to December 2004 at Pinewood Studios in the United Kingdom. Rather than using computer-generated environments, Burton primarily used built sets and practical effects, which he claimed was inspired by the book's emphasis on texture.", "The company's owner, Willy Wonka, has long closed his factory to the public due to problems concerning industrial espionage, which also caused all his employees, including Charlie's Grandpa Joe, to lose their jobs. Charlie's father, meanwhile, has more recently been laid off from his own job at a toothpaste factory, although he does not admit this to Charlie. One day, Wonka announces a contest in which Golden Tickets have been placed in five random Wonka Bars worldwide, and the winners will receive a full tour of the factory as well as a lifetime supply of chocolate, while one will receive an additional prize at the end of the tour. Wonka's sales subsequently skyrocket, and the first four tickets are found by the gluttonous Augustus Gloop, the spoiled Veruca Salt, the arrogant Violet Beauregarde, and the ill-tempered Mike Teavee. Charlie tries twice to find a ticket, but both bars come up empty. After overhearing that the final ticket was found in Russia, Charlie finds a banknote and purchases a third Wonka Bar. The Russian ticket is revealed to be a forgery just as Charlie discovers the real ticket inside the wrapper. He receives monetary offers for the ticket, but the cashier warns him not to trade it regardless, and Charlie runs back home. At home, Charlie initially wants to trade the ticket for money for his family's betterment, but after a pep talk from Grandpa George, he decides to keep it, and brings Grandpa Joe to accompany him on the tour.", "Wonka's Chocolate Room was constructed on the 007 Stage at Pinewood, complete with a faux chocolate waterfall and river. Squirrels were trained from birth for Veruca Salt's elimination. Actor Deep Roy performed each Oompa-Loompa individually rather than one performance duplicated digitally. Burton shot the film simultaneously alongside the stop-motion animated film \"Corpse Bride\", which he also directed. Willy Wonka-themed chocolate bars were sold, and a Golden Ticket contest was launched as part of the film's marketing campaign. Early plans to promote the film with a Broadway theatre musical were not realized. \"Charlie and the Chocolate Factory\" premiered on July 10, 2005, and was released in the United States on July 15 to positive critical reviews, who commended it for its visual appeal and dark tone. It was also a box office success, grossing US$475 million and becoming the eighth-highest-grossing film worldwide in 2005. The film received a nomination for Best Costume Design at the 78th Academy Awards, while Depp was nominated for the Golden Globe Award for Best Actor – Musical or Comedy. It remains Tim Burton's second-highest-grossing film to date. &lt;templatestyles src=\"Template:TOC limit/styles.css\" /&gt;\nPlot. Charlie Bucket is a kind and loving boy who lives in poverty with his family near the Wonka Factory.", "Charlie and the other ticket holders are greeted outside the factory by Wonka, who then leads them into the facility. Individual character flaws cause the other four children to give in to temptation, resulting in their elimination from the tour while Wonka's new employees, the Oompa-Loompas, sing a song of morality after each. Meanwhile, Wonka reminisces on his troubled past and how his dentist father, Wilbur, strictly forbade him from consuming any candy. After sneaking a piece of candy, Wonka instantly became hooked and ran away from home to follow his dreams. When he returned, however, both his father and their house were gone. After the tour, the four eliminated children leave the factory with an exaggerated characteristic or deformity related to their elimination, while Charlie learns that Wonka, now approaching retirement, intended to find a worthy heir. Since Charlie was the least ill-behaved of the five, Wonka invites Charlie to come live and work in the factory with him, provided that he leave his family behind. Charlie declines, as his family is the most important thing in his life. As Charlie and his family's life improve, Wonka becomes despondent, causing his company and sales to decline. He eventually turns to Charlie for advice, and he decides to help Wonka reconcile with his estranged father, Wilbur. During the reunion, Charlie notices newspaper clippings of Wonka's success which Wilbur collected, while Wonka realizes the value of family as he and Wilbur finally reconcile. Afterwards, Wonka allows Charlie and his family to move into the factory together. Cast.", "American actor\nNicholas John Robinson (born March 22, 1995) is an American actor. As a child, he appeared in a 2008 stage production of \"A Christmas Carol\" and \"Mame\", after which he had a main role in the television sitcom \"Melissa &amp; Joey\" (2010–2015). Robinson went on to play a supporting role in the adventure film \"Jurassic World\" (2015) and took on lead roles in several teen dramas, including \"The Kings of Summer\" (2013), \"The 5th Wave\" (2016), \"Everything, Everything\" (2017), and \"Love, Simon\" (2018). He has since starred in the drama miniseries \"A Teacher\" (2020) and \"Maid\" (2021). Early life. Robinson was born on March 22, 1995, in Seattle, Washington. He has four younger siblings. Robinson initially attended Seattle Preparatory School, but left in the middle of his freshman year and moved to Los Angeles after booking a regular role on \"Melissa &amp; Joey\". He graduated from Campbell Hall School in 2013. He was accepted to New York University’s College of Arts and Sciences and attended in the summer to work on another season of \"Melissa &amp; Joey\". Career. Robinson made his professional acting debut at the age of eleven with a role in a stage adaptation of Charles Dickens' novel \"A Christmas Carol\". Talent scout Matt Casella recommended him to a few agencies and Robinson was eventually signed with the Los Angeles-based Savage Agency.", "His production company is WingNut Films, and his most regular collaborators are co-writers and producers Walsh and Philippa Boyens. Jackson was made a Companion of the New Zealand Order of Merit in 2002. He was later knighted (as a Knight Companion of the order) by Sir Anand Satyanand, the Governor-General of New Zealand, at a ceremony in Wellington in April 2010. In December 2014, Jackson was awarded a star on the Hollywood Walk of Fame. Early life. Jackson was born on 31 October 1961 in Wellington\nand was raised in its far northern suburb of Pukerua Bay. His parents – Joan (\"née\" Ruck),(p20) a factory worker and housewife, and William \"Bill\" Jackson, a wages clerk – were immigrants from England. As a child, Jackson was a keen film fan, growing up on Ray Harryhausen films, as well as finding inspiration in the television series \"Thunderbirds\" and \"Monty Python's Flying Circus\". After a family friend gave the Jacksons a Super 8 cine-camera with Peter in mind, he began making short films with his friends. Jackson has long cited \"King Kong\" as his favourite film, and around the age of nine he attempted to remake it using his own stop-motion models. Also, as a child Jackson made a World War II epic called \"The Dwarf Patrol\" seen on the \"Bad Taste\" bonus disc, which featured his first special effect of poking pinholes in the film for gun shots, and a James Bond spoof named \"Coldfinger\".", "Because of the 2007–2008 Writers Guild of America strike, Robinson's family moved back to Washington where he continued to perform on stage in and around Seattle. In 2010, Robinson was cast in the role of Ryder Scanlon, the nephew of Melissa Joan Hart's character, on the ABC Family sitcom \"Melissa &amp; Joey,\" playing the character until its cancellation in 2015. In 2011, while on hiatus from \"Melissa &amp; Joey\", Robinson began filming of the Disney Channel original movie \"Frenemies\"; Robinson played the role of Jake Logan. \"Frenemies\" premiered in January 2012, on the Disney Channel. In 2012, Robinson was cast in the lead role of Joe Toy in director Jordan Vogt-Roberts' \"The Kings of Summer\". He also guest-starred in the episode \"Blue Bell Boy,\" during the third season of HBO's \"Boardwalk Empire\". He also began appearing in a series of television commercials for Cox Communications entitled \"Buffer Time is Bonding Time.\" In 2015, Robinson portrayed Zach Mitchell in \"Jurassic World\", in which he was widely seen. He played Ben Parish in the film adaptation of the novel \"The 5th Wave\", which was released in January 2016. These roles made him unavailable for multiple episodes of the final season of \"Melissa &amp; Joey\", but he returned for the final three episodes.", "Irish musician\nAndrea Jane Corr (born 17 May 1974) is an Irish musician and actress. Corr debuted in 1990 as the lead singer of the Celtic folk rock and pop rock group The Corrs along with her three elder siblings Caroline, Sharon and Jim. Aside from singing lead vocals, Corr plays the tin whistle, the mandolin, the ukulele and the piano. With the others, Corr has released seven studio albums, two compilation albums, one remix album and two live albums. Corr has also pursued a solo career, releasing her debut album, \"Ten Feet High\", in 2007. The album moved away from the sound of the Corrs and features a dance-pop sound. Her next album, released on 30 May 2011, was entirely made up of covers of songs that were important to her when younger. Corr is involved in charitable activities. She has played charity concerts to raise money for the Pavarotti &amp; Friends Liberian Children's Village, Freeman Hospital in Newcastle upon Tyne, England, the victims of the Omagh bombing in Northern Ireland and The Prince's Trust in 2004. She is an ambassador for the Nelson Mandela's \"46664\" campaign, raising awareness towards AIDS in Africa. During the Edinburgh Live 8 on 2 July 2005 The Corrs performed \"When the Stars Go Blue\" alongside Bono to promote the Make Poverty History campaign. Along with her siblings, she was appointed an honorary M.B.E. in 2005 by Queen Elizabeth II for her contribution to music and charity. Early years.", "Joe and Kirsten slowly go from the \"two-martini lunch\" to full-blown alcoholism. Joe is demoted due to poor performance, and is sent out of town to work on a minor account. Kirsten is alone with their daughter all day and finds drinking the best way to pass the time. While drunk one afternoon, she causes a fire in their apartment that almost kills her and Debbie. Eventually, Joe is fired, and he spends the next several years going from job to job. One day, Joe sees his reflection in a bar window and realizes in horror that he hardly knows his own face. He tells Kirsten that they must stop drinking, and while not keen on the idea, she agrees. Seeking escape from their addiction, Joe and Kirsten work together in Arnesen's business and stay sober for two months. But the urge is too strong, and during a late-night drinking binge, Joe destroys his father-in-law's greenhouse while looking for a stashed liquor bottle. Joe is committed to a sanitarium, where he suffers from delirium tremens while confined in a straitjacket. After his release, Joe finally gets sober with the help of Alcoholics Anonymous, a dedicated sponsor named Jim Hungerford, and regular AA meetings. Jim explains to Joe how alcoholics often demonstrate obsessive behavior, pointing out that Kirsten's previous passion for chocolate may have been the first sign of an addictive personality. He advises Joe that most drinkers hate to drink alone or in the company of sober people."], "distances": [0.74609375, 0.734375, 0.62890625, 0.5390625, 0.515625, 0.44140625, 0.419921875, 0.40625, 0.404296875, 0.3984375], "supports": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0], "metadatas": [{"support": 1, "doc_name": "Charlie and the Chocolate Factory (film)", "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "pool_index": 124}, {"support": 0, "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "pool_index": 120}, {"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 0, "pool_index": 122}, {"pool_index": 121, "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 0}, {"pool_index": 123, "support": 0, "doc_name": "Charlie and the Chocolate Factory (film)", "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59"}, {"mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc", "support": 0, "pool_index": 202, "doc_name": "Nick Robinson (American actor)"}, {"support": 0, "mapped_id": "007dc247-272e-475c-96c2-5479c1df1d95", "pool_index": 221, "doc_name": "Peter Jackson"}, {"pool_index": 203, "support": 0, "mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc", "doc_name": "Nick Robinson (American actor)"}, {"mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "doc_name": "Andrea Corr", "support": 0, "pool_index": 174}, {"mapped_id": "01fa3800-7594-4f6d-8871-b3fb685de2f3", "doc_name": "Days of Wine and Roses (film)", "support": 0, "pool_index": 242}], "recall": 1.0, "precision": 0.1, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "00367852-4217-48b1-9313-2c21ea592610", "documents": ["Spanish treasure fleet\nThe 1715 Treasure Fleet was actually a combination of two Spanish treasure fleets returning from the New World to Spain, the \"Nueva España Fleet\", under Capt.-General Don Juan Esteban de Ubilla, and the \"Tierra Firme Fleet\", under Don Antonio de Echeverz y Zubiza. At two in the morning on Wednesday, July 31, 1715, seven days after departing from Havana, Cuba, all eleven ships of the fleet were lost in a hurricane along the east coast of Florida. A 12th ship, the French frigate \"Le Grifon\", had sailed with the fleet. Its captain was unfamiliar with the Florida coastline and elected to stay further out to sea. The \"Grifon\" safely returned to Europe. Because the fleet was carrying silver, it is also known as the 1715 Plate Fleet (\"plata\" being the Spanish word for silver). Some artifacts and even coins still wash up on Florida beaches from time to time. According to Cuban records, around 1,500 sailors perished while a small number survived in lifeboats. Many ships, including pirates, took part in the initial salvage. Initially a privateer, Henry Jennings was first accused of piracy for attacking such salvage ships and claiming their salvages. Exhibits and preserves. Treasure hunter Kip Wagner's team built an exhibit held at National Geographic \"Explorers Hall\" in Washington, D.C. that was featured in the January 1965 issue of \"National Geographic\". This was the beginning of a fine collection of 1715 plate fleet treasure that brought hundreds of visitors from around the world.", "Wagner published his book \"Pieces of Eight\" (Recovering The Riches Of A Lost Spanish Fleet) in 1966. This is a detailed account of the finding and exploration of many of these shipwrecks along the Florida \"Treasure Coast.\" An exhibit was set up with a grand opening on May 1, 1967, at the First National Bank of Satellite Beach, Florida. In 1987, another ship in the fleet, the \"Urca de Lima\", became the first shipwreck in the Florida Underwater Archaeological Preserves. Mel Fisher's company, Mel Fisher's Treasures, sold the rights to the 1715 Fleet shipwreck to Queens Jewels, LLC. In 2015, 1715 Fleet - Queens Jewels, LLC and their founder Brent Brisben discovered $4.5 million in gold coins off the coast of Vero Beach, Florida; the coins come from the 1715 Fleet shipwreck site known as the Corrigans wreck. List of identified ships. New evidence (see Jorge Proctor, 2021) shows that the Douglass Beach Wreck, long believed to be the \"Nuestra Señora de las Nieves\", is in fact the \"Santa Rita y Las Animas\", bought by Ubilla in Cuba and renamed \"Nuestra Señora de Regla\", like his flagship. In popular culture. In the 2008 movie \"Fool's Gold\", the protagonists are searching for the location of one of the sunken ships of the treasure fleet (along with its treasure). The treasure fleet was used as the backdrop for a scene in the video game \"\".", "St. David's Lighthouse keeper and treasure-hunter Romer Treece (Robert Shaw), believes the medallion had come from the wreckage of the surviving twelfth ship [of the 1715 Treasure Fleet], thought to be a French tobacco ship that was being protected by the 1715 fleet and named \"Grifon\" (spelt \"El Grifón\" in Peter Benchley's novel \"The Deep\"). The ship was thought to be returning to Havana, Cuba for repairs but instead sank off the coast of Bermuda.\" The plot of the Starz show \"Black Sails\" revolves heavily around the 1715 Treasure Fleet in its first season. The largest of the ships, the \"Urca de Lima\", is wrecked during the hurricane off the coast of Florida, carrying five million Spanish dollars' worth in gold, silver and other precious materials, pursued by Captain Flint and his crew. The treasure, colloquially referred to as \"the Urca gold\", is an important plot device throughout the series. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "The main character, Edward Kenway, is aboard one of the ships in the fleet as a prisoner, and manages to escape with the help of his future quartermaster, Adéwalé, recruiting other captive pirates as a crew. The pirates eventually manage to escape the fleet and the hurricane by stealing the twelfth ship, the brig \"El Dorado\", which Edward keeps and renames the \"Jackdaw\", becoming the player's ship for the rest of the game. Edward later makes reference to the event when Blackbeard inquires as to how he got the Jackdaw, and the latter then suggests visiting the site to salvage some of the lost treasure. In the 1977 movie \"The Deep\" \"David Sanders (Nick Nolte) and his British girlfriend Gail Berke (Jacqueline Bisset) recover a number of artifacts (from a diving expedition off the coast of Bermuda, homeland of Captain Henry Jennings), including an ampule of amber-colored liquid and a medallion bearing the image of a woman and the letters 'S.C.O.P.N' (an abbreviation of the Latin 'Santa Clara Ora Pro Nobis' that translates to English as 'Saint Clara Pray For Us') and a date, 1714.", "Literary trope\nBuried treasure is a literary trope commonly associated with depictions of pirates, alongside Vikings, criminals, and Old West outlaws. According to popular conception, these people often buried their stolen fortunes in remote places, intending to return to them later (often with the use of a pirate’s treasure map). Pirates burying treasure was a rare occurrence, with the only known instance being William Kidd, who buried some of his wealth on Gardiners Island. The myth of buried pirate treasure was popularized by such 19th-century fiction as \"Wolfert Webber\", \"The Gold-Bug\", and \"Treasure Island\". The idea of treasure maps leading to buried treasure is considered a fictional device. There are cases of buried treasure from different historical periods, such as the Dacian king Decebalus and Visigoth king Alaric I, who both changed the course of rivers to hide their treasures. Legends of buried pirate treasure have existed for centuries, but authenticated discoveries are rare. For example, extensive excavations on Oak Island, Nova Scotia have not yielded any treasure. The only authenticated treasure chest in the United States is kept at the Pirate Soul Museum in St. Augustine, Florida. Buried treasure is a cultural concept and not the same as a hoard, which is typically found by archaeologists and metal detectors. The Fenn treasure, reportedly buried by millionaire Forrest Fenn in 2010, was found in 2020 in Wyoming. Pirates. Pirates burying treasure was rare.", "Treasure Fleet, sometimes billed as The Treasure Fleet, is a Chicago-based band featuring members of The Lawrence Arms, The Arrivals, and Smoking Popes. Originally formed in 2009 by Isaac Thotz and Neil Hennessy, the two added Dave Merriman and Mike Oberlin and played a few shows as a four piece before adding Eli Caterer as a lead guitarist. Their sound has been influenced by bands of the ‘60s and ‘70s. Treasure Fleet played The Fest in 2014 along with Paint It Black, The City on Film, and Iron Chic. The same year they played a four night stint with Alkaline Trio at Metro Chicago. They participated in Recess Records' 25th anniversary tour. Their debut album, \"Cocamotion\", was released in 2012. Their sophomore effort, \"Future Ways\", was released later the same year. In 2015, they released \"The Sun Machine\" on Recess Records. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "In 1911, American author Ralph D. Paine conducted a survey of all known or purported stories of buried treasure and published them in \"The Book of Buried Treasure\". He found a common trait in all the stories: there was always a lone survivor of a piratical crew who somehow preserved a chart showing where the treasure was buried, but unable to return himself, he transfers the map or information to a friend or shipmate, usually on his deathbed. This person would then go search in vain for the treasure, but not before transferring the legend down to another hapless seeker. Cases. The Roman historian Dio Cassius says that, in the early 2nd century, the Dacian king Decebalus had changed the course of the river Sargetia and buried tons of gold and silver in the riverbed. Later, he ordered the river to be restored, and the slaves involved in the works to be executed. However, one of his nobles revealed the treasure's location to the Romans. The Byzantine historian Jordanes tells a similar story of the burial of the Visigoth king Alaric I and his treasure under the river Busento in 410. The burial places of the Khazar kings (\"qoruq\") and other inner Asian people were also under a rerouted river. There are a number of reports of supposed buried pirate treasure that surfaced much earlier than these works, indicating that the idea was around for more than a century before those stories were published.", "The only pirate known to have actually buried treasure was William Kidd, who is believed to have buried at least some of his wealth on Gardiners Island near Long Island before sailing into New York City. Kidd had originally been commissioned as a privateer for England, but his behavior had strayed into outright piracy, and he hoped that his treasure could serve as a bargaining chip in negotiations to avoid punishment. His bid was unsuccessful, however, and Kidd was hanged as a pirate. In English fiction, there are three well-known stories that helped to popularize the myth of buried pirate treasure: \"Wolfert Webber\" (1824) by Washington Irving, \"The Gold-Bug\" (1843) by Edgar Allan Poe and \"Treasure Island\" (1883) by Robert Louis Stevenson. These stories differ widely in plot and literary treatment but are all based on the William Kidd legend. David Cordingly states that \"The effect of \"Treasure Island\" on our perception of pirates cannot be overestimated,\" and says the idea of treasure maps leading to buried treasure \"is an entirely fictional device\". Stevenson's \"Treasure Island\" was directly influenced by Irving's \"Wolfert Webber,\" Stevenson saying in his preface, \"It is my debt to Washington Irving that exercises my conscience, and justly so, for I believe plagiarism was rarely carried farther... the whole inner spirit and a good deal of the material detail of my first chapters... were the property of Washington Irving.\"", "His previous two albums, \"Journey to the Centre of the Earth\" (1974) and \"King Arthur\", were concept albums that featured a symphony orchestra and choir that were costly to produce. When it came to recording \"No Earthly Connection\", management at A&amp;M Records insisted to Wakeman that an album with an orchestra and choir was no longer an option. For his 1975 tour, Wakeman had added two brass players to now six-piece band, Martyn Shields on trumpet and Reg Brooks on trombone. Guitarist Jeffrey Crampton was also replaced by John Dunsterville. During a stop in Miami, Florida on the 1975 tour, a time when material for the album was being prepared, Wakeman claimed he saw a UFO in the night sky at his beach house and alerted bassist Roger Newell as a witness. He resisted to inform others at first as he thought they would merely disbelieve him, despite the incident attracting local news coverage on the following day. Wakeman used the incident to write musical themes that entered his mind as he thought of it, much of which was put down during flights on the 1975 tour. Wakeman also wrote some passages in the airplane toilet. Wakeman ended up writing a considerable amount of music during the making of the album as he was determined to record everything that came to mind, but had to throw out approximately sixty percent of the material. He later revealed that he wrote it without playing any of it back to listen. Wakeman said he could not explain half of the album, and gave the album its title because of his inability to fully explain it.", "Viceroyalty of the Spanish Empire (1717–1822)\nThe Viceroyalty of the New Kingdom of Granada ( ), also called Viceroyalty of New Granada or Viceroyalty of Santafé, was the name given on 27 May 1717 to the jurisdiction of the Spanish Empire in northern South America, corresponding to modern Colombia, Ecuador, Panama and Venezuela. Created in 1717 by King Felipe V, as part of a new territorial control policy, it was suspended in 1723 for financial problems and was restored in 1739 until the independence movement suspended it again in 1810. The territory corresponding to Panama was incorporated later in 1739, and the provinces of Venezuela were separated from the Viceroyalty and assigned to the Captaincy General of Venezuela in 1777. In addition to those core areas, the territory of the Viceroyalty of New Granada included Guyana, Trinidad and Tobago, southwestern Suriname, parts of northwestern Brazil, and northern Peru. A strip along the Atlantic Ocean in Mosquito Coast was added by the Royal Decree of 20 November 1803, but the British battled for administrative control. Colonial history. Two centuries after the establishment of the New Kingdom of Granada in the 16th century, whose governor was dependent upon the Viceroy of Peru at Lima, and an \"audiencia\" at Santa Fé de Bogotá (today capital of the republic of Colombia), the slowness of communications between the two capitals led to the creation of an independent Viceroyalty of New Granada in 1717 (and its reestablishment in 1739 after a short interruption)."], "distances": [0.8828125, 0.8359375, 0.7109375, 0.51953125, 0.455078125, 0.3984375, 0.3984375, 0.369140625, 0.365234375, 0.349609375], "supports": [1, 1, 1, 0, 0, 0, 0, 0, 0, 0], "metadatas": [{"support": 1, "doc_name": "1715 Treasure Fleet", "mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "pool_index": 185}, {"pool_index": 186, "mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "1715 Treasure Fleet", "support": 1}, {"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "support": 1, "pool_index": 188, "doc_name": "1715 Treasure Fleet"}, {"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "support": 0, "pool_index": 187, "doc_name": "1715 Treasure Fleet"}, {"support": 0, "pool_index": 57, "mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "doc_name": "Buried treasure"}, {"doc_name": "Treasure Fleet", "mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "pool_index": 189, "support": 0}, {"doc_name": "Buried treasure", "support": 0, "pool_index": 59, "mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c"}, {"doc_name": "Buried treasure", "support": 0, "mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "pool_index": 58}, {"pool_index": 77, "support": 0, "doc_name": "No Earthly Connection", "mapped_id": "00c2befc-9313-4f1d-a469-6d4780fdc424"}, {"doc_name": "Viceroyalty of New Granada", "support": 0, "pool_index": 85, "mapped_id": "00bdf195-a662-411d-9b1f-e03d702e1296"}], "recall": 1.0, "precision": 0.3, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "documents": ["In 2010, Corr appeared in the final few episodes of ' as Michael Kanaan and was a regular character on the popular Australian television show \"Packed to the Rafters\", playing Dave Rafter's nephew Coby Jennings. In 2013, he appeared in the teen thriller film \"6 Plots\", and starred alongside John Jarratt in \"Wolf Creek 2\", the 2013 sequel to the horror film \"Wolf Creek\". In 2015, Corr starred in Neil Armfield's romantic-drama film \"Holding the Man\", adapted from Timothy Conigrave's 1995 memoir of the same name. He portrayed Conigrave opposite Craig Stott who portrayed Conigrave's partner, John Caleo. In 2016, he starred in the television series \"Wanted\". Corr appeared as Joseph in Helen Edmundson's 2018 film \"Mary Magdalene\". In 2022, he had a recurring role in HBO's \"House of the Dragon\" as Ser Harwin Strong. In 2024, Corr was named for feature film \"Kangaroo.\" Legal issues. In May 2014, Corr was charged with heroin possession after being found with a freezer bag holding 0.26g (less than 1/100 of an ounce) of the drug in the Sydney suburb of Bondi. After admitting to the possession, the actor was given a 12-month good behaviour bond with no conviction recorded. The arrest took place a few days after Corr's grandfather went into a coma following a heart attack.", "Australian actor\nRyan Corr is an Australian actor. He is known for his roles in the Australian drama series \"Packed to the Rafters\", \"Love Child\" and \"Underbelly\", along with film roles in \"Wolf Creek 2\" (2013), \"The Water Diviner\" (2014), \"Holding the Man\" (2015), as well as the \"Game of Thrones\" prequel \"House of the Dragon\". Early life. Corr was born in Melbourne. His father is Peter Corr, the head coach of the Australian women's goalball team. In 2009, he graduated from the National Institute of Dramatic Art (NIDA). Career. He began making appearances in film and television from the age of five, but started his acting career in earnest at age thirteen with the film \"Opraholic\". His first television performance was on \"The Sleepover Club\" with a supporting role as Matthew McDougal. Following this, he landed a lead role as Sheng Zamett on \"Silversun\" (2004). Soon after, Corr had guest appearances on shows such as ', \"Blue Heelers\", and \"Neighbours\". As a voice actor, he voiced a sheep in \"Charlotte's Web\". In 2006, the second series of \"Blue Water High\" aired on Australian TV in which Corr starred as young surfer Eric, one of the six chosen teens to attend Solar Blue.", "American actor\nNicholas John Robinson (born March 22, 1995) is an American actor. As a child, he appeared in a 2008 stage production of \"A Christmas Carol\" and \"Mame\", after which he had a main role in the television sitcom \"Melissa &amp; Joey\" (2010–2015). Robinson went on to play a supporting role in the adventure film \"Jurassic World\" (2015) and took on lead roles in several teen dramas, including \"The Kings of Summer\" (2013), \"The 5th Wave\" (2016), \"Everything, Everything\" (2017), and \"Love, Simon\" (2018). He has since starred in the drama miniseries \"A Teacher\" (2020) and \"Maid\" (2021). Early life. Robinson was born on March 22, 1995, in Seattle, Washington. He has four younger siblings. Robinson initially attended Seattle Preparatory School, but left in the middle of his freshman year and moved to Los Angeles after booking a regular role on \"Melissa &amp; Joey\". He graduated from Campbell Hall School in 2013. He was accepted to New York University’s College of Arts and Sciences and attended in the summer to work on another season of \"Melissa &amp; Joey\". Career. Robinson made his professional acting debut at the age of eleven with a role in a stage adaptation of Charles Dickens' novel \"A Christmas Carol\". Talent scout Matt Casella recommended him to a few agencies and Robinson was eventually signed with the Los Angeles-based Savage Agency.", "\"I Was Kaiser Bill's Batman\" was a hit single in 1967 composed by British songwriters Roger Cook and Roger Greenaway. It was a novelty record, performed mostly by whistling. The name Whistling Jack Smith, credited on the most commercially successful recording, was a play on the name of the baritone singer of the 1920s, 1930s and 1940s, Whispering Jack Smith. Production. The tune was written by Greenaway and Cook and was originally titled \"Too Much Birdseed\". It was recorded as a single for Deram Records by record producer Noel Walker, using studio musicians together with the Mike Sammes Singers. The whistling on the record was, according to most sources, by John O'Neill, a trumpeter and singer with the Mike Sammes Singers who was known for his whistling skill, though other sources credit Noel Walker. The song is noted for its false ending: after the last chorus, a male voice shouts \"Oi\" (on the album version) and \"Hey\" (on the single version), and the tune starts up again with the repeated chorus, then fades out. Performances. Credited to Whistling Jack Smith, the record rose up the UK singles chart. When it was featured on \"Top of the Pops\", actor Coby Wells was used to mime the whistling, and later toured as the public face of Whistling Jack Smith. Wells' real name was Billy Moeller, a brother of Tommy Moeller, lead vocalist, guitarist, and pianist with Unit 4 + 2. The recording reached #5 on the UK singles chart in March 1967, staying in the chart for 12 weeks.", "He played the titular lead in the independent film \"Being Charlie\", a semi-autobiographical feature about director Rob Reiner's relationship with his son, which premiered at the 2015 Toronto International Film Festival; the film was released theatrically in 2016. In 2017, he starred in William H. Macy's comedy-drama film \"Krystal\", and as Olly in \"Everything, Everything\", a film adaptation of the novel of the same name. In 2018, Robinson starred as the titular Simon Spier in the gay coming out teen drama film \"Love, Simon\". The film was considered ground-breaking because it was the first major studio film to focus on a gay, teenage romance. Robinson's performance as Simon garnered critical acclaim. After reading the script, Robinson revealed that he broke his own rule to no longer play high schoolers because he saw the cultural importance of the film. That year, Robinson was named in \"Forbes\"' \"30 Under 30\" list in the Hollywood &amp; Entertainment category. In 2019, he co-starred in the third film version of Richard Wright's \"Native Son\". In 2020, Robinson co-starred in the FX miniseries \"A Teacher\", and he narrated his DM responses to the protagonist of \"Love, Victor\", a \"Love, Simon\" spinoff TV series on \"Hulu\", and appeared in two episodes of the show. In 2021, he starred in the Netflix miniseries \"Maid\", opposite Margaret Qualley and Andie MacDowell. References.", "&lt;templatestyles src=\"Div col/styles.css\"/&gt;\nOther cast members include Adam Godley as Mr. Teavee and Franziska Troegner as Mrs. Gloop. The other four Golden Ticket winners, Violet Beauregarde, Veruca Salt, Mike Teavee, and Augustus Gloop, are portrayed by AnnaSophia Robb, Julia Winter, Jordan Fry, and Philip Wiegratz, respectively. Blair Dunlop plays young Willy Wonka. Charlie's remaining grandparents, Grandma Georgina, Grandma Josephine, and Grandpa George, are portrayed by Liz Smith, Eileen Essell, and David Morris. Nitin Ganatra and Shelley Conn appear as Prince and Princess Pondicherry. Geoffrey Holder narrates the film. Production. Development. Author Roald Dahl disapproved of the 1971 film adaptation. Warner Bros. Pictures and Brillstein-Grey Entertainment entered into discussions with the Dahl estate in 1991, hoping to purchase the rights to produce another film version of \"Charlie and the Chocolate Factory\". The purchase was finalized in 1998, with Dahl's widow, Felicity (\"Liccy\"), and daughter, Lucy, receiving total artistic control and final privilege on the choices of actors, directors and writers. The Dahl estate's subsequent protection of the source material was the main reason that \"Charlie and the Chocolate Factory\" had languished in development hell since the 1990s.", "Because of the 2007–2008 Writers Guild of America strike, Robinson's family moved back to Washington where he continued to perform on stage in and around Seattle. In 2010, Robinson was cast in the role of Ryder Scanlon, the nephew of Melissa Joan Hart's character, on the ABC Family sitcom \"Melissa &amp; Joey,\" playing the character until its cancellation in 2015. In 2011, while on hiatus from \"Melissa &amp; Joey\", Robinson began filming of the Disney Channel original movie \"Frenemies\"; Robinson played the role of Jake Logan. \"Frenemies\" premiered in January 2012, on the Disney Channel. In 2012, Robinson was cast in the lead role of Joe Toy in director Jordan Vogt-Roberts' \"The Kings of Summer\". He also guest-starred in the episode \"Blue Bell Boy,\" during the third season of HBO's \"Boardwalk Empire\". He also began appearing in a series of television commercials for Cox Communications entitled \"Buffer Time is Bonding Time.\" In 2015, Robinson portrayed Zach Mitchell in \"Jurassic World\", in which he was widely seen. He played Ben Parish in the film adaptation of the novel \"The 5th Wave\", which was released in January 2016. These roles made him unavailable for multiple episodes of the final season of \"Melissa &amp; Joey\", but he returned for the final three episodes.", "Irish musician\nAndrea Jane Corr (born 17 May 1974) is an Irish musician and actress. Corr debuted in 1990 as the lead singer of the Celtic folk rock and pop rock group The Corrs along with her three elder siblings Caroline, Sharon and Jim. Aside from singing lead vocals, Corr plays the tin whistle, the mandolin, the ukulele and the piano. With the others, Corr has released seven studio albums, two compilation albums, one remix album and two live albums. Corr has also pursued a solo career, releasing her debut album, \"Ten Feet High\", in 2007. The album moved away from the sound of the Corrs and features a dance-pop sound. Her next album, released on 30 May 2011, was entirely made up of covers of songs that were important to her when younger. Corr is involved in charitable activities. She has played charity concerts to raise money for the Pavarotti &amp; Friends Liberian Children's Village, Freeman Hospital in Newcastle upon Tyne, England, the victims of the Omagh bombing in Northern Ireland and The Prince's Trust in 2004. She is an ambassador for the Nelson Mandela's \"46664\" campaign, raising awareness towards AIDS in Africa. During the Edinburgh Live 8 on 2 July 2005 The Corrs performed \"When the Stars Go Blue\" alongside Bono to promote the Make Poverty History campaign. Along with her siblings, she was appointed an honorary M.B.E. in 2005 by Queen Elizabeth II for her contribution to music and charity. Early years.", "John Conroy's investigation is systematically uncovering Eichelberger's crimes, and in anticipation of having their books subpoenaed, Eichelberger has the building housing them burned. He has callous disregard for the people renting there, and all but 1 or 2 are killed. An expose of Matt Conroy's murder reveals that Eichelberger had LaRue killed also. His widow Carmelina LaRue can prove this. She contacts McKibbon in order to exact revenge but is chased away by Eichelberger's henchmen. Since McKibbon is the only one that can identify Carmelina LaRue, her husband's murderer, Roy Ackerman, demands that McKibbon be killed, but Eichelberger refuses. Ackerman then hires a hit man himself whereby McKibbon is lured to a boxing match where he can be shot. Meanwhile, Carmelina manages to reach John Conroy. Her testimony is sufficient, along with already acquired information, to topple Eichelberger. The hired gun, Red, shoots McKibbon. As he lies dying, Eichelberger and his crew are arrested. McKibbon dies before John Conroy can arrive. John Conroy's epitaph for McKibbon is something McKibbon himself has previously said: \"Sometimes someone has to pay an exorbitant price to uphold the majesty of the law.\" Production. Several locations of historical interest in Downtown Los Angeles can be seen in this film.", "He had been close with his grandfather, who had flown with him to acting jobs when he was a child. According to Corr's lawyer, Corr was grateful for the arrest, because it stopped him from using heroin for the first time. Corr later stated, \"I found myself in a position where I was incredibly upset, someone offered me something and 200 metres after, I was picked up with it. It was an error of judgment.\" References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;"], "distances": [0.76171875, 0.625, 0.453125, 0.44921875, 0.404296875, 0.3984375, 0.3984375, 0.3984375, 0.39453125, 0.390625], "supports": [1, 1, 0, 0, 0, 1, 0, 0, 0, 0], "metadatas": [{"mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "pool_index": 171, "doc_name": "Ryan Corr", "support": 1}, {"pool_index": 170, "doc_name": "Ryan Corr", "support": 1, "mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968"}, {"support": 0, "pool_index": 202, "doc_name": "Nick Robinson (American actor)", "mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc"}, {"mapped_id": "018a5779-9152-4555-909c-4d7a12421ba0", "doc_name": "I Was Kaiser Bill's Batman", "support": 0, "pool_index": 210}, {"doc_name": "Nick Robinson (American actor)", "support": 0, "pool_index": 204, "mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc"}, {"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 1, "pool_index": 124}, {"pool_index": 203, "support": 0, "mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc", "doc_name": "Nick Robinson (American actor)"}, {"doc_name": "Andrea Corr", "pool_index": 174, "support": 0, "mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968"}, {"pool_index": 34, "doc_name": "The Turning Point (1952 film)", "support": 0, "mapped_id": "00a596f6-8823-48d1-9dc5-4364118bbbe0"}, {"mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "doc_name": "Ryan Corr", "support": 0, "pool_index": 172}], "recall": 1.0, "precision": 0.3, "ndcg": 0.9325210919548239, "mrr": 1.0}
{"query_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "documents": ["Best Day Ever is the fifth mixtape by American rapper Mac Miller. It was released by Rostrum Records on March 11, 2011, as the follow-up to Miller's acclaimed mixtape \"K.I.D.S.\" (2010). The mixtape consists of sixteen songs produced by nine producers (predominantly ID Labs), and includes features from rappers Wiz Khalifa and Phonte. Four songs from \"Best Day Ever\" have music videos: \"Donald Trump\", \"Get Up\", \"Wear My Hat\" and \"Best Day Ever\". Release and promotion. Over 20,000 viewers joined Miller for a live video stream prior to the mixtape's release. As of March 2019, the mixtape has received over 1.2 million downloads and 1.5 million streams on its official host, DatPiff. The song \"Donald Trump\" was released as a single on May 17, 2011. It became his first singles entry on the US \"Billboard\" Hot 100, peaking at number 75, and was certified platinum by the Recording Industry Association of America (RIAA). Its music video has received over 180 million views on YouTube, and is Miller's most-viewed video. When the video surpassed 16 million views, Donald Trump acknowledged the song on the social networking site Twitter, stating \"Who wouldn't be flattered?\". In June 2016, \"Best Day Ever\" was remastered and commercially released by Rostrum Records for its fifth anniversary. Critical reception. The mixtape received favorable reviews, including an \"XL\" (second highest) from \"XXL\" magazine. Commercial performance.", "Following Miller's death on September 7, 2018, \"Best Day Ever\" debuted at number 26 on the US \"Billboard\" 200 with 17,000 album-equivalent units. Track listing. Credits adapted from DatPiff and Spotify. Notes\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "\"Best Day Ever\" is the first segment of the 20th episode of the fourth season of the American animated television series \"SpongeBob SquarePants\", and the 80th episode overall. The episode was written by Nate Cash, Tuck Tucker, and Steven Banks, and the animation was directed by Larry Leichliter; Cash and Tucker also functioned as storyboard directors. It originally aired on Nickelodeon in the United States on November 10, 2006. In the episode, SpongeBob is determined to have a perfect day, which, to his disappointment, does not go as he planned. Each of his friends has a different problem of their own, so he sets out to help them while spoiling his own agendas. The episode features a song titled \"The Best Day Ever\" written by Tom Kenny and Andy Paley. A soundtrack album, \"SpongeBob SquarePants: The Best Day Ever\", was released on September 12, 2006. \"Best Day Ever\" pulled an average of 6.7 million viewers upon release. The song was actually used two years earlier in the credits of \"The SpongeBob SquarePants Movie\". Plot. SpongeBob's \"Best Day Ever\" fails to turn out as he planned when he is forced to postpone his activities to help his friends with various problems. He wanted to work at the Krusty Krab, but it is condemned because of a nematode infestation. SpongeBob tries to get the nematodes to go away but they refused to and they eat his pants.", "Puff said his name when she found him hiding in her purse in one attempt). He gets in right as the concert ends. Upset and angry that his \"Best Day Ever\" is a disaster, SpongeBob snaps and has a freak-out, runs up to the stage, and rips open the curtain yelling \"NO! It is NOT over!\" He grabs the microphone to give an elaborate speech about how his \"Best Day Ever\" has been ruined. However, Mr. Krabs, Patrick, Sandy and Squidward tell him about how he helped them with their problems and that they themselves were what his \"Best Day Ever\" was actually about. To make it up to him, they hold a production in which SpongeBob performs his song, \"Best Day Ever\", to complete his day with Patrick, Sandy, Squidward, and Mr. Krabs co-starring along in it. A few hours later, SpongeBob is still singing, but his friends are tired and sleepy, and the audience has all disappeared. When Squidward asks Mr. Krabs how long they have to keep up the performance, Mr. Krabs replies, \"Just 'til his little heart gives out, Squidward. Just 'til his little heart gives out.\" Production. \"Best Day Ever\" was written by Nate Cash, Tuck Tucker and Steven Banks, with Larry Leichliter serving as animation director. Cash and Tucker also functioned as storyboard directors. The episode originally aired on Nickelodeon in the United States on November 10, 2006.", "Filming took place almost entirely on location at the historic Los Angeles Theatre, in downtown LA. Long believed to be haunted, the theater is its own character in the story, and the deleted scenes include references to one of its founders, Charlie Chaplin. Music. The original score of the film was composed by System of a Down's lead singer, Serj Tankian. It is his first film score. Release. The theatrical release of \"1915\" in the United States took place on April 17, 2015, with the film's premiere taking place on April 13 at the Egyptian Theatre in conjunction with the American Cinematheque. It released widely in Russia on April 23, 2015, and in Armenia on April 25, 2015. Its first international preview was at the Maxim Gorky Theatre in Berlin, Germany on April 5, 2015. It released in Australia in June, 2015. On May 26, 2016, the film was released in the UK. On June 4 it was released in France. In 2015 it was featured selection in the Golden Apricot International Film Festival, Romanian International Film Festival, and Lake Van International Film Festival in Turkey, where it won the Special Jury Prize. It was also awarded \"Best Film\" by the World Entertainment Armenian Awards. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Hotel and casino in Nevada, United States\nBuffalo Bill's is a hotel and casino in Primm, Nevada, United States, at the California state line. It is one of the Primm Valley Resorts, owned and operated by Affinity Gaming. It has 1,242 guest rooms and suites. The hotel is home to the currently closed Desperado roller coaster, a hypercoaster with a 225-foot drop, and a top speed of 80 mph, a log flume ride, as well as a pool in the shape of a buffalo. The hotel-casino has two hotel room towers: the Annie Oakley Tower (the A Tower) and the Buffalo Bill Tower (B Tower). It is named after Buffalo Bill. The casino has over 1,700 slot machines, as well as table games, and a race and sports book. Buffalo Bill's is also home of the Star of the Desert Arena, a 6,500-seat arena designed for concerts. Buffalo Bill's closed in March 2020, due to the COVID-19 pandemic in Nevada. It reopened in December 2022, following renovations. History. The casino opened on May 14, 1994 with 592 hotel rooms, and a new tower was added in 1995. The ribbon cutting for the change of ownership for Primm Valley Resorts from MGM Mirage to Herbst Gaming was held at Buffalo Bill's on April 10, 2007.", "Although the two songs have nothing else in common, the popularity of Prima's combination, further popularized by David Lee Roth on his 1985 EP \"Crazy From The Heat\", has led to the mistaken perception by some that the songs are two parts of a single original composition. In 2017, the Spanish band De Morao Swing Tablao released a version of this song by double pairing it with the popular Spanish song, \"María de la O\". References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Issued via AFO's national distribution deal with Juggy Murray's Sue Records, \"I Know\" hit radio and retail in late 1961 and was a national 'crossover' hit, topping the U.S. R&amp;B charts and crossing over to No.3 on \"Billboard\"'s pop chart. Marisela version. In 1988, American singer Marisela recorded a cover version of the song for the soundtrack of the film \"Salsa\". The original version recorded by Marisela was sung in English language and included on the film soundtrack, along with songs by Laura Branigan, Tito Puente, Robi Rosa, Wilkins and Grupo Niche. A Spanish language version of the track, produced by Enrique Elizondo, was later included in Marisela's album of the same title, under the title \"Ya No\". This version became her first No.1 single in the \"Billboard\" Hot Latin Tracks chart, temporarily dislodging Franco's \"María\" for one week from the top of the chart. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Craig threatened to leave town with Danielle if Betsy called the police, and if she went to Steve, she'd never see her daughter again. Luckily, Craig's mother, Lyla, traced Danielle to the home of Mrs. Hoffman, a maid whom Betsy had fired previously, and Danielle was returned to her mother. At the same time, Diana McColl informed Steve that she knew Craig was faking his paralysis. Steve found Betsy at Kim's, and when she told him she'd left Craig for good, they had a joyful reunion. One day while driving, Betsy was in a terrible accident in Vermont. When she woke up, she needed plastic surgery because of the burns on her face and she had no memory of who she was. Betsy found herself becoming close to her doctor and agreed to marry him. After a while, though she started getting flashbacks of Oakdale and had to go there. While in Oakdale, Craig recognised Betsy and he reunited her with her family. At the same time, Steve had been arrested for the murder of Whit McColl. However, the McColl housekeeper Dorothy Connors confessed to the crime on the witness stand. Though Betsy loved Steve, they found themselves arguing more and more about money. Steve wanted the best for Betsy and spent lavishly but refused to tell Betsy where the money was coming from. Money pressures mounted when administration assistant Iva Snyder had an accident and Steve was unable to pay her medical bills. Soon they found themselves in debt, and Steve had to declare bankruptcy. Lucinda Walsh ended up buying Steve's construction company.", "The group also returned to jazz and R&amp;B themes on their albums: their first, 1964's \"The Five Faces of Manfred Mann\", included standards such as \"Smokestack Lightning\" while the second and last with this line-up, \"Mann Made\", offered several self-composed instrumentals and a version of \"Stormy Monday Blues\" alongside novelties and pop ballads. With a cover of Maxine Brown's \"Oh No Not My Baby\" began a phase of new depth and sophistication in the arrangements of their singles. The group began its string of successes with Bob Dylan songs with a track on the best-selling EP \"The One in the Middle\", \"With God on Our Side\", next reaching No. 2 in the UK with \"If You Gotta Go, Go Now\". The EP's title track reached the British top ten singles, the last self-written song (by Jones) and the band's last R'n'B workout to do so. The run climaxed with a second UK No. 1 single, \"Pretty Flamingo\", produced by John Burgess. The group had managed an initial jazz/rhythm-and-blues fusion, and then had taken chart music in their stride—but could not hope to cope with Paul Jones' projected solo career as singer and actor, and with Mike Vickers' orchestral and instrumental ambitions. Jones intended to go solo once a replacement could be found, but stayed with the band for another year, during which Vickers left."], "distances": [0.94140625, 0.7421875, 0.60546875, 0.546875, 0.404296875, 0.390625, 0.38671875, 0.38671875, 0.375, 0.37109375], "supports": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0], "metadatas": [{"support": 1, "doc_name": "Best Day Ever (mixtape)", "mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "pool_index": 110}, {"mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "pool_index": 111, "doc_name": "Best Day Ever (mixtape)", "support": 0}, {"support": 0, "doc_name": "Best Day Ever", "mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "pool_index": 112}, {"support": 0, "pool_index": 114, "doc_name": "Best Day Ever", "mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1"}, {"mapped_id": "0085a069-c8c1-4a78-9074-0f17d2073f9c", "pool_index": 18, "doc_name": "1915 (film)", "support": 0}, {"mapped_id": "018a5779-9152-4555-909c-4d7a12421ba0", "pool_index": 214, "support": 0, "doc_name": "Buffalo Bill's"}, {"pool_index": 144, "doc_name": "I Ain't Got Nobody", "mapped_id": "0094491c-79a7-49b4-a2f2-fe4d9f9981c8", "support": 0}, {"pool_index": 216, "support": 0, "doc_name": "I Know (You Don't Love Me No More)", "mapped_id": "01b6b760-a5d8-4230-9e8b-1f14fc323673"}, {"mapped_id": "0177bf17-6a23-45b0-a27d-1cd9acc1290c", "doc_name": "Steve Andropoulos and Betsy Stewart", "support": 0, "pool_index": 239}, {"pool_index": 234, "support": 0, "mapped_id": "0083a85a-6c8e-41ab-9bad-0bffb78e75ab", "doc_name": "Manfred Mann"}], "recall": 1.0, "precision": 0.1, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "documents": ["The 2018 Scotties Tournament of Hearts, Canada's national women's curling championship, was held from January 27–February 4, 2018 at the South Okanagan Events Centre in Penticton, British Columbia. The winning team represented Canada at the 2018 Ford World Women's Curling Championship held from March 17–25 at the Memorial Gardens in North Bay, Ontario. The 2018 tournament was the first to use a new 16-team format, featuring representation by all fourteen member associations of Curling Canada, the second-place team from the 2017 tournament (as champion Rachel Homan declined to participate due to her qualification for the 2018 Winter Olympics), and a new wildcard team. As part of this new format, the Bronze medal game was removed from the schedule. Teams. Curling Canada introduced a new 16-team format for both the Tournament of Hearts and Brier for 2018, under which all 14 member associations of Curling Canada were represented in the main field, rather than being limited by a pre-qualifying tournament. The teams were divided into two pools for round robin play, after which the top four teams from each advanced to the Championship Pool. Defending champion Rachel Homan declined to participate as Team Canada in order to prepare for the 2018 Winter Olympics; Michelle Englot's team, who finished as runner-up in the 2017 tournament, participated in her place. The final spot in the tournament was filled by a wildcard play-in game held on the Friday before the tournament.", "The rinks of Hollie Duncan (Ontario), Émilia Gagné (Quebec), and Casey Scheidegger (Alberta) made their Scotties debut; although members of Team Ontario had previous experience at the national women's championship, mostly as alternates. Scotties veteran skip Sherry Anderson (Saskatchewan) led a team of Tournament of Hearts rookies. The teams are listed as follows:\nWildcard game. A wildcard play-in game was played on January 26; it was contested between the top two teams on the CTRS standings who did not win their respective provincial championships, and was played between The Glencoe Club's Chelsea Carey rink from Calgary and the East St. Paul Curling Club's Kerri Einarson rink from the Winnipeg exurb of East St. Paul. With Einarson's victory, Manitoba was represented by three different teams in the tournament. \"Friday, January 26, 18:30\"\nRound Robin standings. \"Final Round Robin Standings\"\nRound Robin results. All draw times are listed in Pacific Standard Time (). Draw 1. \"Saturday, January 27, 14:00\"\nDraw 2. \"Saturday, January 27, 19:00\"\nDraw 3. \"Sunday, January 28, 09:00\"\nDraw 4. \"Sunday, January 28, 14:00\"\nDraw 5. \"Sunday, January 28, 19:00\"\nDraw 6. \"Monday, January 29, 09:00\"\nDraw 7. \"Monday, January 29, 14:00\"\nDraw 8. \"Monday, January 29, 19:00\"\nDraw 9.", "Canadian women's curling championship\nThe Scotties Tournament of Hearts ('; commonly referred to as the Scotties) is the annual Canadian women's curling championship, sanctioned by Curling Canada, formerly called the Canadian Curling Association. The winner goes on to represent Canada at the women's world curling championships. Since 1985, the winner also gets to return to the following year's tournament as \"Team Canada\". It is formally known as the \"Canadian Women's Curling Championship\". Since 1982, the tournament has been sponsored by Kruger Products, which was formerly known as Scott Paper Limited when it was a Canadian subsidiary of Scott Paper Company. As such, the tournament was formerly known as the Scott Tournament of Hearts; when Kimberly-Clark merged with Scott, the Canadian arm was sold to the Quebec-based Kruger Inc. – while Kruger was granted a license to use several Scott brands in Canada until June 2007, it was given a long-term license to the Scotties brand because Kimberly-Clark already owned Kleenex. As such, the tournament was officially renamed the Scotties Tournament of Hearts in 2007. Until 2018, the format was a round robin of 12 teams. Starting with the 2015 Scotties Tournament of Hearts there have been more than twelve eligible teams; therefore a pre-qualification tournament was held to trim the field to twelve. In 2021, a new 18-team format was introduced, in which all 14 member associations of Curling Canada field a team in a main draw of two pools, alongside the defending champions, and the three highest-ranked teams on the Canadian Team Ranking System standings that did not win their provincial championships.", "\"Tuesday, January 30, 09:00\"\nDraw 10. \"Tuesday, January 30, 14:00\"\nDraw 11. \"Tuesday, January 30, 19:00\"\nDraw 12. \"Wednesday, January 31, 09:00\"\nDraw 13. \"Wednesday, January 31, 14:00\"\nDraw 14. \"Wednesday, January 31, 19:00\"\nTiebreakers. \"Thursday, February 1, 09:00\"\nPlacement Round. Each team that finished fifth through eight in their pool played the team that finished in the same position in the opposite pool for the purpose of determining final tournament ranking. For example, the winner of the game between fifth place teams was ranked ninth place overall, the loser of that game was ranked tenth place, and so on. Seeding Games. All game times are listed in Pacific Standard Time (). A5 vs. B5. \"Friday, February 02, 09:00\"\nA6 vs. B6. \"Friday, February 02, 09:00\"\nA7 vs. B7. \"Friday, February 02, 09:00\"\nA8 vs. B8. \"Friday, February 02, 09:00\"\nChampionship Pool Standings. All wins and losses earned in the round robin (including results against teams that failed to advance) were carried forward into the Championship Pool. Wins in tiebreaker games were not carried forward. \"Final Championship Pool Standings\"\nChampionship Pool Results. All draw times are listed in Pacific Standard Time (). Draw 15. \"Thursday, February 01, 14:00\"\nDraw 16.", "\"Thursday, February 01, 19:00\"\nDraw 17. \"Friday, February 02, 14:00\"\nDraw 18. \"Friday, February 02, 19:00\"\nPlayoffs. 1 vs. 2. \"Saturday, February 03, 19:00\"\n3 vs. 4. \"Saturday, February 03, 14:00\"\nSemifinal. \"Sunday, February 04, 09:00\"\nFinal. \"Sunday, February 04, 16:00\"\nStatistics. Top 5 player percentages. \"Final Round Robin Percentages; minimum 6 games\"\nAwards. The awards and all-star teams were as follows:\n\"First Team\"\n\"Second Team\"\nNotes. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "End of season American football event\nThe College Football Playoff National Championship is a post-season college football bowl game, used to determine a national champion of the NCAA Division I Football Bowl Subdivision (FBS), which began play in the 2014 college football season. The game is held on the second Monday of January and serves as the final game of the College Football Playoff, a bracket tournament between the top four teams in the country as determined by a selection committee, which was established as a successor to the Bowl Championship Series and then its similar BCS National Championship Game. The participating teams in the College Football Playoff National Championship are determined by two semifinal games (sometimes called the \"Plus-One system\"), hosted by an annual rotation of bowls commonly known as the New Year's Six. Thus, the teams to compete in the final are not directly selected by a selection committee, as had been the format used for the BCS National Championship Game. The game is played at a neutral site, determined through bids by prospective host cities (similar to the Super Bowl and NCAA Final Four). When announcing it was soliciting bids for the 2016 and 2017 title games, playoff organizers noted that the bids must propose host stadiums with a capacity of at least 65,000 spectators, and cities cannot host both a semi-final game and the title game in the same year. The winner of the game is awarded the College Football Playoff National Championship Trophy, which is sponsored by Dr Pepper.", "Competing bids were placed to host the championship game by Tampa, Jacksonville, Minneapolis, San Antonio, San Francisco, and South Florida. Raymond James Stadium in Tampa, Florida, was announced as the host site for the third College Football Playoff (CFP) National Championship game on December 17, 2013. It became the first CFP championship game to not be held at the site of one of the \"New Year's Six\" bowls. It also was the first CFP championship game to be played outdoors as Raymond James Stadium does not have a retractable roof. This championship game is part of the third annual CFP, constituted by four teams playing to decide the national champion of the NCAA Division I Football Bowl Subdivision. The four teams were originally selected by a 13 member-committee. Teams. The championship game was a rematch of the 2016 College Football Playoff National Championship, where Alabama defeated Clemson, 45–40, marking the first rematch between #1 and #2 in National Championship game history. Overall, the championship game marked the 17th meeting between the two schools; however, prior to the previous championship game, the programs had only met once in the regular season since 1975. Alabama. Alabama was led by head coach Nick Saban. The Crimson Tide were undefeated in the regular season and played the Washington Huskies in the 2016 Peach Bowl, winning 24–7. Alabama's defense was ranked first in the nation in points allowed (11.8) and yards per game (248). The defense was led by defensive back Minkah Fitzpatrick, who had six interceptions and 62 total tackles.", "It was created as a new championship trophy, rather than the \"crystal football\" that has been given by the American Football Coaches Association (AFCA) since 1986, as officials wanted a new trophy that was unconnected with the previous BCS championship system. The inaugural game was held at AT&amp;T Stadium in Arlington, Texas, on January 12, 2015, and was won by Ohio State. A top-ranked team did not win the College Football Playoff National Championship until LSU won the sixth edition of the game, in January 2020. Alabama has the most appearances in a College Football Playoff National Championship, with six, and also the most wins, with three. The College Football Playoff National Championship is not awarded by the National Collegiate Athletic Association (NCAA). The highest level of college football that the NCAA awards a championship in is the Division I Football Championship Subdivision (FCS). Venues. Cities across the United States can bid on the National Championship Game each year. The number of cities capable of bidding for the event is restricted by a requirement to have a stadium with at least 65,000 seats. The stadium restriction would limit the bidding to most cities with a National Football League franchise, since all but four of the stadiums in the league meet the capacity requirements. Unlike the Super Bowl, there is no \"de jure\" restriction on climate. A venue can not host a semi-final game and the National Championship Game in the same season. Host cities/regions. Ten different regions and ten different stadiums have hosted the National Championship Game. Game results. Rankings are from the CFP Poll released prior to matchup.", "College football game\nThe 2017 College Football Playoff National Championship was a college football bowl game that was played on January 9, 2017, at Raymond James Stadium in Tampa, Florida. The third College Football Playoff National Championship, the game determined a national champion for the NCAA Division I Football Bowl Subdivision (FBS) for the 2016 season. It was the culminating game of the 2016–17 bowl season. Sponsored by telecommunications company AT&amp;T, the game was officially known as the 2017 College Football Playoff National Championship presented by AT&amp;T.\nThe game was played between the winners of two pre-designated bowl games played on December 31, 2016: the Clemson Tigers, who defeated the Ohio State Buckeyes in the Fiesta Bowl, and the Alabama Crimson Tide, who defeated the Washington Huskies in the Peach Bowl. Having met in the previous year's championship game, the resulting title game between Clemson and Alabama became college football's first rematch between #1 and #2 in national championship game history. The Tigers won the game 35–31 on a go-ahead touchdown with one second left, having come back from a 14–0 deficit earlier in the game. Watson threw to WR Hunter Renfrow for the game winner. Clemson quarterback and Heisman Finalist Deshaun Watson set the record for most passing yards in a championship game with 420, breaking his own record of 405 yards set in the 2016 National Championship Game. Deshaun Watson and Ben Boulware were named the Offensive and Defensive Most Valuable Players, respectively. It was Clemson’s first national title since 1981. Background.", "‡ Attendance at the January 2021 game was limited due to the COVID-19 pandemic in the United States. &lt;br&gt;\nSource:\nAppearances by team. Championship games. Updated through the January 2024 edition (10 games, 20 total appearances). Semifinal games. Updated through the January 2024 edition (20 games, 40 total appearances). Appearances by conference. Updated through the January 2024 edition (10 games, 20 total appearances). Coaches. The following coaches led their teams to the National Championship final. Nick Saban has reached the final the most times, six, with a 3–3 record. MVPs. An offensive MVP and defensive MVP are named for each final. Game records. Source:\nNational anthem performers. The national anthem usually begins with a drumroll by two drummers, with one member representing each team. The national anthem for the 2021 game was pre-recorded due to COVID concerns. Broadcasters. Television. Beginning with the 2027 championship, ABC will simulcast the national championship with ESPN. Notes. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;"], "distances": [0.74609375, 0.74609375, 0.65625, 0.443359375, 0.427734375, 0.3984375, 0.396484375, 0.37890625, 0.37890625, 0.359375], "supports": [0, 1, 0, 0, 0, 0, 1, 0, 0, 0], "metadatas": [{"pool_index": 105, "doc_name": "2018 Scotties Tournament of Hearts", "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "support": 0}, {"support": 1, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "pool_index": 106, "doc_name": "2018 Scotties Tournament of Hearts"}, {"pool_index": 109, "support": 0, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "doc_name": "Scotties Tournament of Hearts"}, {"doc_name": "2018 Scotties Tournament of Hearts", "support": 0, "pool_index": 107, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882"}, {"support": 0, "doc_name": "2018 Scotties Tournament of Hearts", "pool_index": 108, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882"}, {"doc_name": "College Football Playoff National Championship", "support": 0, "mapped_id": "00cbc86f-0170-4774-8d3d-452de0a94c0b", "pool_index": 155}, {"support": 1, "doc_name": "2017 College Football Playoff National Championship", "mapped_id": "00cbc86f-0170-4774-8d3d-452de0a94c0b", "pool_index": 159}, {"pool_index": 156, "support": 0, "mapped_id": "00cbc86f-0170-4774-8d3d-452de0a94c0b", "doc_name": "College Football Playoff National Championship"}, {"doc_name": "2017 College Football Playoff National Championship", "support": 0, "mapped_id": "00cbc86f-0170-4774-8d3d-452de0a94c0b", "pool_index": 158}, {"doc_name": "College Football Playoff National Championship", "support": 0, "mapped_id": "00cbc86f-0170-4774-8d3d-452de0a94c0b", "pool_index": 157}], "recall": 1.0, "precision": 0.2, "ndcg": 0.5912352048230277, "mrr": 0.5}
{"query_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "documents": ["1967 film by Robert Day\nTarzan and the Great River is a 1967 adventure film starring Mike Henry in his second of three film appearances as Tarzan. The twenty-seventh and penultimate film of the \"Tarzan\" film series that began with 1932's \"Tarzan the Ape Man\", the film was produced by Sy Weintraub and Steve Shagan, written by Bob Barbash (from a story by Barbash and Lewis Reed), and directed by Robert Day. Released on September 1, 1967, it was followed by \"Tarzan and the Jungle Boy\" in 1968. Plot. Tarzan is called to Brazil by an old friend, The Professor (Paulo Gracindo) to help stop the Jaguar Cult, led by Barcuma (Rafer Johnson), from destroying native villages and enslaving the survivors in his search for diamonds. Tarzan is assisted by Captain Sam Bishop (Jan Murray), a riverboat pilot, and Bishop's young ward, Pepe (Manuel Padilla Jr.), as well as Baron (a lion) and Cheeta (a chimpanzee). On their way they encounter Dr. Ann Philips (Diana Millay), who has witnessed the destruction of a village, and wants to continue fighting a plague by giving much-needed inoculations to natives who live along the Amazon River. Production notes. The movie was filmed entirely on location in Rio de Janeiro, Brazil (Rio de Janeiro Zoo, Parque Lage and Tijuca Forest). Dinky, the chimp portraying Cheeta, bit Mike Henry on the jaw during filming, requiring twenty stitches.", "The chimpanzee was destroyed, and Henry later sued the producers for this accident and other unsafe working conditions on all three of his Tarzan films. The parties settled out of court. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "1963 collection of two Tarzan novellas by Edgar Rice Burroughs\nTarzan and the Tarzan Twins is a collection of two Tarzan novellas by American writer Edgar Rice Burroughs, for younger readers. It was originally published as two children's books, \"The Tarzan Twins\" by Voland in October 1927, and \"Tarzan and the Tarzan Twins, with Jad-bal-ja, the Golden Lion\", by Whitman in March 1936. These were brought together in November 1963 under the title of \"Tarzan and the Tarzan Twins\" in the first complete edition. Despite the gap in when they were written and first published, the events of the two stories occur in the same time-frame. The opening passage of \"Tarzan and the Tarzan Twins, with Jad-bal-ja, the Golden Lion\" specifies that its events occur immediately after those of \"The Tarzan Twins.\" In relation to other Tarzan stories, the two parts of the Tarzan Twins tale presumably fall between \"Tarzan and the Ant Men\" and \"Tarzan, Lord of the Jungle\" chronologically, as the initial part was published between these two novels. The second part confirms their placement in approximately this period, as it introduces a family that figures prominently in \"Tarzan and the Lost Empire\", the next book after \"Tarzan, Lord of the Jungle\"; specifically, it features Tarzan's first meeting with Doctor Karl von Harben, with whom he is already acquainted in \"Empire\". Because \"Twins\" is a children's book, however, it is customarily omitted from listings of the main Tarzan series.", "His production company is WingNut Films, and his most regular collaborators are co-writers and producers Walsh and Philippa Boyens. Jackson was made a Companion of the New Zealand Order of Merit in 2002. He was later knighted (as a Knight Companion of the order) by Sir Anand Satyanand, the Governor-General of New Zealand, at a ceremony in Wellington in April 2010. In December 2014, Jackson was awarded a star on the Hollywood Walk of Fame. Early life. Jackson was born on 31 October 1961 in Wellington\nand was raised in its far northern suburb of Pukerua Bay. His parents – Joan (\"née\" Ruck),(p20) a factory worker and housewife, and William \"Bill\" Jackson, a wages clerk – were immigrants from England. As a child, Jackson was a keen film fan, growing up on Ray Harryhausen films, as well as finding inspiration in the television series \"Thunderbirds\" and \"Monty Python's Flying Circus\". After a family friend gave the Jacksons a Super 8 cine-camera with Peter in mind, he began making short films with his friends. Jackson has long cited \"King Kong\" as his favourite film, and around the age of nine he attempted to remake it using his own stop-motion models. Also, as a child Jackson made a World War II epic called \"The Dwarf Patrol\" seen on the \"Bad Taste\" bonus disc, which featured his first special effect of poking pinholes in the film for gun shots, and a James Bond spoof named \"Coldfinger\".", "Biographer Dan Wooding believe the album is Wakeman's \"own personal journey into the unknown\". Recording. Wakeman recalled the difficulty in getting A&amp;M to understand and support \"No Earthly Connection\" partly due to the length of \"Music Reincarnate\" which occupied the entire first side and finish on part of the second. The label suggested to have parts cut in order for the track to fit on a single side, but Wakeman refused as its length was what he intended the piece to be. He also refused to extend the piece to fill both sides entirely as it resembled the problem he had with the Yes album \"Tales from Topographic Oceans\" (1973), a double album containing four, side long tracks that were deliberately extended to fit each side of a vinyl, an idea that Wakeman disagreed with. Instead, Wakeman filled the second side with two \"related story wise\" tracks, \"The Prisoner\" and \"The Lost Cycle\". The album was recorded from January to March 1976 with Wakeman credited as the producer. He was joined by engineer Paul Tregurtha and engineering assistant Didier Utard. Wakeman lived in the studio building with the engineers for the entire time, with his band members staying for a large amount of it. At one point in the recording, Wakeman woke up during the night after he thought of a particular sound he wished to put onto tape and woke an engineer to record it. \"There was something quite magical about that and I've never been able to do it ever again\".", "Thus \"Tarzan, Lord of the Jungle\" is generally considered the eleventh Tarzan book rather than \"Twins\". Plot. Two schoolboys, Dick and Doc, are cousins who resemble each other because their mothers are twins. As Dick is also related to Tarzan through his father, they become known as the Tarzan Twins. Invited to visit Tarzan's African estate, they become lost in the jungle and are imprisoned by cannibals, from whom they escape. They are then reunited with their host, who introduces them to his pet lion, Jad-bal-ja. Subsequently, they become involved in an adventure involving exiles from the lost city of Opar, who have kidnapped Gretchen von Harben, the daughter of a missionary. The brutish Oparians, adherents of the deposed and deceased high priest Cadj, are seeking a place to continue worship of the Flaming God in the traditional way, as Opar's Queen La has outlawed human sacrifice in the lost city. They plan to make their young captive Gretchen, whom they dub \"Kla\", meaning \"New La\", their new high priestess. She is eventually rescued by Tarzan and the twins, while Glum, leader of the exiles, and some of his adherents are killed. Tarzan orders the survivors to return to Opar and be loyal to La. Comic adaptations. The book has been adapted into comic form by Gold Key Comics in \"Tarzan\" no. 196, dated April 1971, with a script by Gaylord DuBois and art by Mike Royer.", "New Zealand filmmaker (born 1961)\nSir Peter Robert Jackson (born 31 October 1961) is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the \"Lord of the Rings\" trilogy (2001–2003) and the \"Hobbit\" trilogy (2012–2014), both of which are adapted from the novels of the same name by J. R. R. Tolkien. Other notable films include the critically lauded drama \"Heavenly Creatures\" (1994), the horror comedy \"The Frighteners\" (1996), the epic monster remake film \"King Kong\" (2005), the World War I documentary film \"They Shall Not Grow Old\" (2018) and the documentary \"\" (2021). He is the fourth-highest-grossing film director of all-time, his films having made over $6.5 billion worldwide. Jackson began his career with the \"splatstick\" horror comedy \"Bad Taste\" (1987) and the black comedy \"Meet the Feebles\" (1989) before filming the zombie comedy \"Braindead\" (1992). He shared a nomination for Academy Award for Best Original Screenplay with his partner Fran Walsh for \"Heavenly Creatures\", which brought him to mainstream prominence in the film industry. Jackson has been awarded three Academy Awards for \"\" (2003), including Best Picture, Best Director, and Best Adapted Screenplay. His other awards include three BAFTAs, a Golden Globe, two Primetime Emmy Awards and four Saturn Awards among others.", "The Tarzan River is a river in the United States territory of Guam. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "He mentioned Martin Scorsese's crime films \"Goodfellas\" and \"Casino\", remarking on \"something about those particular movies and the way Martin Scorsese just fearlessly rockets his camera around and has shot those films that I can watch those movies and feel inspired.\" Jackson said the 1970 film \"Waterloo\" inspired him in his youth. Other influences include George Romero, Sam Raimi and the special effects by Ray Harryhausen. Career. Splatter phase. Jackson's first feature was \"Bad Taste\", a haphazard fashion splatter comedy which took years to make. It included many of Jackson's friends acting and working on it for free. Shooting was normally done on weekends since Jackson was then working full-time. \"Bad Taste\" is about aliens that come to earth with the intention of turning humans into food. Jackson had two acting roles including a famous scene in which he fights himself on top of a cliff. The film was finally completed thanks to a late injection of finance from the New Zealand Film Commission, after Jim Booth, the body's executive director, became convinced of Jackson's talent (Booth later left the commission to become Jackson's producer). \"Bad Taste\" debuted at the Cannes Film Festival in May 1987. Around this time, Jackson began working on writing a number of film scripts, in varied collaborative groupings with playwright Stephen Sinclair, writer Fran Walsh and writer/actor Danny Mulheron. Walsh would later become his life partner.", "This is an era of love, romance, sex and action all packaged as one,\" he explained. Music. The best part of the film is its music composed by Humaira Arshad and Awais Malik. Here viewers are hoping that the musicians signal healthy changes in film music, too. Saeed Ali Khan, the director called for Ahmed Butt originally, but then there was an easy access to his wife for the singing, she was more than happy to make her debut in Lollywood as a composer. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;"], "distances": [0.8828125, 0.51171875, 0.443359375, 0.44140625, 0.439453125, 0.4296875, 0.427734375, 0.408203125, 0.392578125, 0.390625], "supports": [1, 0, 0, 0, 0, 0, 1, 0, 0, 0], "metadatas": [{"mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan and the Great River", "support": 1, "pool_index": 5}, {"support": 0, "pool_index": 6, "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan and the Great River"}, {"support": 0, "doc_name": "Tarzan and the Tarzan Twins", "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "pool_index": 8}, {"mapped_id": "007dc247-272e-475c-96c2-5479c1df1d95", "doc_name": "Peter Jackson", "support": 0, "pool_index": 221}, {"mapped_id": "00c2befc-9313-4f1d-a469-6d4780fdc424", "doc_name": "No Earthly Connection", "support": 0, "pool_index": 78}, {"mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "pool_index": 9, "support": 0, "doc_name": "Tarzan and the Tarzan Twins"}, {"doc_name": "Peter Jackson", "pool_index": 220, "support": 1, "mapped_id": "007dc247-272e-475c-96c2-5479c1df1d95"}, {"pool_index": 7, "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "support": 0, "doc_name": "Tarzan River"}, {"doc_name": "Peter Jackson", "mapped_id": "007dc247-272e-475c-96c2-5479c1df1d95", "support": 0, "pool_index": 223}, {"doc_name": "Gunahon Ka Sheher", "mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf", "support": 0, "pool_index": 13}], "recall": 1.0, "precision": 0.2, "ndcg": 0.8175295903539445, "mrr": 1.0}
{"query_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "documents": ["Software management\nSoftware asset management (SAM) is a business practice that involves managing and optimizing the purchase, deployment, maintenance, utilization, and disposal of software applications within an organization. According to ITIL, SAM is defined as “…all of the infrastructure and processes necessary for the effective management, control, and protection of the software assets…throughout all stages of their lifecycle.” \nFundamentally intended to be part of an organization's information technology business strategy, the goals of SAM are to reduce information technology (IT) costs and limit business and legal risk related to the ownership and use of software, while maximizing IT responsiveness and end-user productivity. SAM is particularly important for large corporations regarding redistribution of licenses and managing legal risks associated with software ownership and expiration. SAM technologies track license expiration, thus allowing the company to function ethically and within software compliance regulations. This can be important for both eliminating legal costs associated with license agreement violations and as part of a company's reputation management strategy. Both are important forms of risk management and are critical for large corporations' long-term business strategies. SAM is one facet of a broader business discipline known as IT asset management, which includes overseeing both software and hardware that comprise an organization's computers and network. Role within organizations. SAM can serve many different functions within organizations, depending on their software portfolios, IT infrastructures, resource availability, and business goals. For many organizations, the goal of implementing a SAM program is very tactical, explicitly focused on balancing the number of software licenses purchased with the number of actual licenses consumed or used.", "In addition to balancing the number of licenses purchased with the amount of consumption, an effective SAM program must also ensure that the usage of all installed software is in keeping with the terms and conditions of the specific vendor license agreement. In doing so, organizations can minimize liabilities associated with software piracy in the event of an audit by a software vendor or a third party such as the Business Software Alliance (BSA). SAM, according to this interpretation, involves conducting detailed software inventories on an ongoing basis to determine the exact number of software licenses consumed, comparing this information with the number of licenses purchased, and reviewing how the software is being used in respect to the terms and conditions and establishing controls to ensure that proper licensing practices are maintained on an ongoing basis. This can be accomplished through IT processes, purchasing policies and procedures, and technology solutions such as software inventory tools. Counting installations are the most common means of measuring license consumption but some software is licensed by the number of users, capital, processors, or CPU Cores. More broadly defined, the strategic goals of SAM often include (but are not limited to) the following: \nSAM Technology. Several technologies are available to support key SAM processes:\nInternational Organization for Standardization (ISO). The ISO/IEC 19770 family of standards are designed to help organizations manage IT assets including software assets (SAM). The published standards are outlined below:\nISO/IEC 19770-1:2017: IT Asset Management Systems Requirements is a process framework to enable an organization to incorporate ITAM (including SAM) processes and policies sufficient to satisfy corporate governance requirements and ensure effective support for IT service management overall.", "The implementation of SAM processes to be \"accomplished in multiple staged increments or tiers.\" Part 1 of the standard details SAM processes including control environment, planning and implementation, inventory, verification and compliance, operations management and life cycle. ISO/IEC 19770-2:2015: Software identification tag; establishes specifications for tagging software to optimize its identification and management. The current version was published in 2015 and is a revision to the 2009 original Software ID Tag standard. Using software identification tags or SWID tags makes discovery a simpler and more accurate process that can be verified by software vendors if they audit an organisations entire estate. SWID tags are implemented and supported by many vendors including IBM, Microsoft and Adobe. ISO/IEC 19770-3:2016: Entitlement Management Schema outlines a technical schema which can be used to encapsulate license details including contract information, entitlements, rights, limitations and details about invoice, PO numbers, etc. ISO/IEC 19770-4:2017: Resource Utilization Measurement provides an ITAM data standard for Resource Utilization Measurement (\"RUM\"). ISO/IEC 19770-5:2015: Overview and Vocabulary provides an overview of the 19770 standards as well as defines vocabulary used throughout the standards. Issues with scalability. An example of issues faced when scaling up discovery tools is with Microsoft's System Centre Configuration Manager (SCCM).", "Using SCCM Metering Rules to monitor software usage across a small estate or a small number of applications is relatively easy and reliable given the total number of unique executables (.exe files) and the number of instances of each executable. Turning on Metering Rules for every packaged application and every executable in a large estate quickly makes the volume of data generated unmanageable and expensive to maintain. Most SAM tools which consume SCCM data rely on these Metering Rules to understand usage. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "VITAL is a software suite of digital asset management products by VTLS based on the open source Fedora architecture. It was unveiled at the 2004 American Library Association's Midwinter Meeting. Version 2.0 was released November 29, 2005 after acceptance testing by Australian Research Repositories Online to the World. In 2014, VTLS was acquired by Innovative Interfaces\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "2006 film\nGunahon Ka Sheher is a 2006 Pakistani Urdu language erotic film, directed by Pashto film director Saeed Ali Khan. Synopsis. The story of \"Aik Gunahoon Ka Shehr\" revolves around a young man (Ahmed Butt) fascinated by city life and the thrills it has to offer. Once there, unemployment eventually leads him to join a gang of blackmailers involved in sex crimes, in turn leading to his ruin. Controversy. When the team of Aik Gunahoon Ka Shehr approached the Pakistan Film Censor Board for a clearance certificate, objection was raised over the phrase Gunahoon Ka Shehr. Later the name was modified to Aik Gunahoon Ka Shehr. What exactly they aimed to achieve by this is still a mystery. Secondly, the members of the respected censor board charged that the film contained erotic scenes and dialogue. Consequently, the film appeared before a full board who chopped off several scenes and dialogues which they considered ‘unnecessary’ and ‘irrelevant’, resulting in the producer reshooting them. Annoyed, producer Saeed Iqbal presented his stand before the censor board members, stating that the story of the film depicts the true picture of youth today who indulge in sex and crime. \"The objection was unfair because already a number of Pakistani, Indian and English movies with sexual content are being exhibited at cinemas and cable networks throughout the country,\" he said. He further confessed that it is not a family film. \"Who likes to watch a family film in our dingy cinema houses?", "Hum or HUM may refer to:\n&lt;templatestyles src=\"Template:TOC_right/styles.css\" /&gt;\nSee also. Topics referred to by the same term\n&lt;templatestyles src=\"Dmbox/styles.css\" /&gt;\n This page lists associated with the title .", "By late 1998 the design chief Michael Simcoe had sketched a basic VE silhouette—a rakish sedan with a longer wheelbase and shorter overhangs—to guide management and designers. The sketch formed the design basis for the eventual production-ready car. In early 1999 Peter Hughes—manager of exterior design for Holden—produced a two-dimensional image of a sketch drawn earlier by Simcoe. By late 2000 eight initial exterior sketches were selected, then narrowed down to four through a voting process within the design team. These designs featured the same core elements: prominent wheel arches, an aggressive stance, dynamic lines, and short overhangs. Full-size clay models of the four chosen sketches were created. By July 2002 the speculative phase ended, and a single exterior design direction was chosen. With only four years left before the car's launch, and without having undergone practical testing or real-world engineering, the team turned to a computer-aided industrial design program, Autodesk Alias. One solitary VE concept was refined, sculpted and taken to Holden's Lang Lang Proving Ground, placed on the skidpan and scrutinised by designers and directors from up close and far away to assess how much prominence it had on the road. In February 2003 the designers provided important information to the engineering team, and by May 2003 the design was finalised and approved by Peter Hughes. By July 2003 the teams created the final design mock-up, featuring a fully transparent model with a glasshouse structure.", "Gunahon Ka Devta may refer to:\nSee also. Topics referred to by the same term\n&lt;templatestyles src=\"Dmbox/styles.css\" /&gt;\n This page lists associated with the title .", "\"Show Me Love\" is the English version of the song \"Ya Tvoya Ne Pervaya\" (Cyrillic: \"Я твоя не первая\") by Russian music duo t.A.T.u. It was released as a promotional single for radio stations, taken from their first English-language studio album \"200 km/h in the Wrong Lane\" (2002). It was meant to be the third official single from \"200 km/h in the Wrong Lane\", after \"All the Things She Said\" and \"Not Gonna Get Us\", however Interscope Records cancelled it and released \"How Soon Is Now?\" instead. The radio promo was only released in Poland. Background and composition. According to t.A.T.u. member Lena Katina, Ivan Shapovalov was inspired to create t.A.T.u. after the release of the 1998 Swedish film \"Show Me Love\", which was centred on a romance between two schoolgirls. The album version of \"Show Me Love\" opens to Katina and Julia Volkova speaking in their native Russian, which translated means \"Hello / Hello / Can you see the wind? / So what? / Just look out of the window / So what? / There was sun yesterday / So what? / Why are you always saying the same thing? / I am an answering machine\". The song then begins, featuring a prominent synthesizer beat throughout the duration of the song, with lyrics regarding to events played down to seem like nuances."], "distances": [0.94921875, 0.859375, 0.68359375, 0.5703125, 0.453125, 0.302734375, 0.298828125, 0.298828125, 0.28515625, 0.28515625], "supports": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0], "metadatas": [{"support": 1, "doc_name": "Software asset management", "pool_index": 100, "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed"}, {"pool_index": 101, "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "doc_name": "Software asset management", "support": 0}, {"mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "support": 0, "pool_index": 102, "doc_name": "Software asset management"}, {"mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "support": 0, "doc_name": "Software asset management", "pool_index": 103}, {"support": 0, "pool_index": 104, "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "doc_name": "VITAL (asset management software)"}, {"pool_index": 12, "doc_name": "Gunahon Ka Sheher", "mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf", "support": 0}, {"mapped_id": "0078f48f-b72d-4b72-b386-cc4086c9e9ee", "support": 0, "pool_index": 249, "doc_name": "Hum"}, {"mapped_id": "0094a9d1-99e6-442c-bd8f-25d4f13c587f", "pool_index": 132, "doc_name": "Holden Commodore (VE)", "support": 0}, {"mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf", "support": 0, "pool_index": 14, "doc_name": "Gunahon Ka Devta"}, {"mapped_id": "00bfd1eb-be2d-452a-bfff-7366b34221e1", "doc_name": "Show Me Love (t.A.T.u. song)", "support": 0, "pool_index": 184}], "recall": 1.0, "precision": 0.1, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "documents": ["Self-dosing with poison to gain immunity\nMithridatism is the practice of protecting oneself against a poison by gradually self-administering non-lethal amounts. The word is derived from Mithridates VI, the king of Pontus, who so feared being poisoned that he regularly ingested small doses, aiming to develop immunity. Background. Mithridates VI's father, Mithridates V, was assassinated by poisoning by a conspiracy among his attendants. After this, Mithridates VI's mother held regency over Pontus (a Hellenistic kingdom, 281 BC–62 AD) until a male heir came of age. Mithridates was in competition with his brother for the throne and his mother began to favor his brother. Supposedly, during his youth, he began to suspect plots against him at his own mother's orders and was aware of her possible connection with his father's death. He then began to notice pains in his stomach during his meals and suspected his mother had ordered small amounts of poison to be added to his food to slowly kill him off. With other assassination attempts, he fled into the wild. While in the wild, it is said that he began ingesting non-lethal amounts of poisons and mixing many into a universal remedy to make him immune to all known poisons. After Mithridates' death, many Roman physicians claimed to possess and improve the formula. In keeping with most medical practices of his era, Mithridates' anti-poison routines included a religious component, supervised by the \"Agari\", a group of Scythian shamans who never left him.", "Chanakya entered the room at the moment she collapsed, and in order to save the child in the womb, he immediately cut open the dead queen's belly and took the baby out. He was just in time; a drop of poison had already reached the baby and touched his head, leaving a permanent blueish spot (a \"bindu\") on his forehead. Thus, the newborn was named \"Bindusara\". In practice. Mithridatism is not effective against all types of poison. Immunity is generally only possible with biologically complex types which the immune system can respond to. Depending on the toxin, the practice can lead to the lethal accumulation of a poison in the body. Results depend on how each poison is processed by the body, i.e. on how the toxic compound is metabolized or passed out of the body. However, in some cases, it is possible to build up a metabolic tolerance against specific non-biological poisons. This involves conditioning the liver to produce more of the particular enzymes that metabolize these poisons. For example, heavy drinkers develop a tolerance to the effects of alcohol. However, metabolic tolerance can also lead to accumulation of the less toxic metabolized compound which can slowly damage the liver. With alcohol this generally leads to conditions such as alcoholic fatty liver disease. Metabolic tolerance is not effective on all types of non-biological poisons. Exposure to certain toxic substances, such as hydrofluoric acid and heavy metals, is either lethal or has little to no effect. A minor exception is cyanide, which can be metabolized by the liver.", "The enzyme rhodanese converts the cyanide into the much less toxic thiocyanate. This process allows humans to ingest small amounts of cyanide in food like apple seeds and survive small amounts of cyanide gas from fires and cigarettes. However, one cannot effectively condition the liver against cyanide, unlike alcohol. Relatively larger amounts of cyanide are still highly lethal because, while the body can produce more rhodanese, the process also requires large amounts of sulfur-containing substrates. In literature. Mithridatism has been used as a plot device in fiction and on-screen; including the Indian fantasy series \"Chandrakanta\", Alexandre Dumas's \"The Count of Monte Cristo\", Holly Black's \"The Cruel Prince\", Nathaniel Hawthorne's \"Rappaccini's Daughter\", Yoshiaki Kawajiri's \"Ninja Scroll\", Dorothy Sayers's \"Strong Poison\", Agatha Christie's \"Curtain\", the manhwa Roxana, the manga/anime Spy x Family, William Goldman's \"The Princess Bride\" (as well as its film adaptation), and the American historical series \"The Borgias\". In Michael Curtis Ford's historical novel \"The Last King\", on the life and conquests of Mithridates VI, the technique is used by Mithridates.", "It has been suggested that Russian mystic Rasputin's survival of a poisoning attempt was due to mithridatism, but this has not been proven. Indian epics talk about this practice as well. It has been said that, during the rule of the king Chandragupta Maurya (320–298 BC), there was a practice of selecting beautiful girls and administering poison in small amounts until they grew up, thus making them insensitive to poison. These maidens were called \"vishakanyas\" (visha 'poison' + kanya 'maiden'). It was believed that making love with vishakanyas could result in the death of their partners, hence they were employed to kill enemies. The emperor Bindusara was the son of the first Mauryan emperor Chandragupta Maurya and his queen Durdhara. According to the \"Rajavalikatha\", a Jain work, the original name of this emperor was Simhasena. A legend mentioned in the Jain texts tells the story of how Chandragupta's Guru and advisor Chanakya used to feed the emperor with small doses of poison to build his immunity against possible poisoning attempts by his enemies. One day, Chandragupta, unaware that his food contained poison, shared his food with his pregnant wife, Queen Durdhara, who was seven days away from delivery. The queen, who was not immune to the poison, collapsed and died within a few minutes.", "A. E. Housman's \"Terence, this is stupid stuff\" (originally published in \"A Shropshire Lad\") invokes mithridatism as a metaphor for the benefit that serious poetry brings to the reader. The final section is a poetic rendition of the Mithridates legend. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Some sources say as many as 40,000 attended. These Games featured mainly athletic but also combat sports such as wrestling and the pankration, horse and chariot racing events. It has been widely written that during the Games, all conflicts among the participating city-states were postponed until the Games were finished. This cessation of hostilities was known as the Olympic peace or truce. This idea is a modern myth because the Greeks never suspended their wars. The truce did allow those religious pilgrims who were traveling to Olympia to pass through warring territories unmolested because they were protected by Zeus. See also Finley and Pleket. The origin of the Olympics is shrouded in mystery and legend; one of the most popular myths identifies Heracles and his father Zeus as the progenitors of the Games. According to legend, it was Heracles who first called the Games \"Olympic\" and established the custom of holding them every four years. The myth continues that after Heracles completed his twelve labours, he built the Olympic Stadium as an honour to Zeus. Following its completion, he walked in a straight line for 200 steps and called this distance a \"stadion\" (, Latin: , \"stage\"), which later became a unit of distance. The most widely accepted inception date for the Ancient Olympics is 776 BC; this is based on inscriptions, found at Olympia, listing the winners of a footrace held every four years starting in 776 BC.", "For the first thirteen Olympics, the \"stadion\" footrace was the only event contested, and victory in that sprint was so valued that the next Olympiad was named after the winner, e.g. \"the third year of the eighteenth Olympiad when Ladas of Argos won the stadion.\" The Ancient Games varied over time, but they came to feature running events, a pentathlon (consisting of a jumping event, discus and javelin throws, a foot race, and wrestling), boxing, wrestling, pankration, and equestrian events. Tradition has it that Coroebus, a cook from the city of Elis, was the first Olympic champion, which indicates that the competition was not limited to the aristocracy. The Olympics were of fundamental religious importance, and the sporting events, which were held alongside ritual sacrifices honouring both Zeus (whose famous statue by Phidias stood in his temple at Olympia) and Pelops (divine hero and mythical king of Olympia), did not start until the festival's second day. (Pelops was famous for his chariot race with King Oenomaus of Pisatis.) The winners of the events were admired and immortalised in poems and statues. Although a wreath made from the sacred olive tree in the precinct of Zeus was the only official prize at the Olympic Games, winners' fame brought them economic wealth, too, in the form of subsidies from their hometowns and wealthy sponsors.", "The Games have grown to the point that nearly every nation is now represented; colonies and overseas territories are often allowed to field their own teams. This growth has created numerous challenges and controversies, including boycotts, doping, bribery, and terrorism. Every two years, the Olympics and its media exposure provide athletes with the chance to attain national and international fame. The Games also provide an opportunity for the host city and country to showcase themselves to the world. The Olympic Games have become a significant global event, fostering international cooperation and cultural exchange. At the same time, hosting the Olympic Games can also bring significant economic benefits and challenges to the host city, affecting infrastructure, tourism and local communities. &lt;templatestyles src=\"Template:TOC limit/styles.css\" /&gt;\nAncient Olympics. The Ancient Olympic Games (, \"ta Olympia\") were religious and athletic festivals held every four years at the sanctuary of Zeus in Olympia, Greece. The date of the festival was determined according to a complicated formula whereby the midpoint of the festival would occur during the second full moon after the summer solstice—usually late August or early September. This \"came after the annual harvest but before the picking of the olives.\" Heralds were sent from Elis to announce the dates. Competition at first was among only \"legitimate sons of free-born Greek parents.\" However, after Macedonia, and then Rome, conquered Greece, the ten Olympic judges loosened the earlier standard and permitted anyone who spoke Greek to participate. Tens of thousands of Greeks would make the difficult journey to attend the festival.", "In 1911, American author Ralph D. Paine conducted a survey of all known or purported stories of buried treasure and published them in \"The Book of Buried Treasure\". He found a common trait in all the stories: there was always a lone survivor of a piratical crew who somehow preserved a chart showing where the treasure was buried, but unable to return himself, he transfers the map or information to a friend or shipmate, usually on his deathbed. This person would then go search in vain for the treasure, but not before transferring the legend down to another hapless seeker. Cases. The Roman historian Dio Cassius says that, in the early 2nd century, the Dacian king Decebalus had changed the course of the river Sargetia and buried tons of gold and silver in the riverbed. Later, he ordered the river to be restored, and the slaves involved in the works to be executed. However, one of his nobles revealed the treasure's location to the Romans. The Byzantine historian Jordanes tells a similar story of the burial of the Visigoth king Alaric I and his treasure under the river Busento in 410. The burial places of the Khazar kings (\"qoruq\") and other inner Asian people were also under a rerouted river. There are a number of reports of supposed buried pirate treasure that surfaced much earlier than these works, indicating that the idea was around for more than a century before those stories were published.", "Brief work of literature, usually written in narrative prose\nA short story is a piece of prose fiction. It can typically be read in a single sitting and focuses on a self-contained incident or series of linked incidents, with the intent of evoking a single effect or mood. The short story is one of the oldest types of literature and has existed in the form of legends, mythic tales, folk tales, fairy tales, tall tales, fables, and anecdotes in various ancient communities around the world. The modern short story developed in the early 19th century. Definition. The short story is a crafted form in its own right. Short stories make use of plot, resonance and other dynamic components as in a novel, but typically to a lesser degree. While the short story is largely distinct from the novel or novella/short novel, authors generally draw from a common pool of literary techniques. The short story is sometimes referred to as a genre. Determining what exactly defines a short story remains problematic. A classic definition of a short story is that one should be able to read it in one sitting, a point most notably made in Edgar Allan Poe's essay \"The Philosophy of Composition\" (1846). H. G. Wells described the purpose of the short story as \"The jolly art, of making something very bright and moving; it may be horrible or pathetic or funny or profoundly illuminating, having only this essential, that it should take from fifteen to fifty minutes to read aloud.\""], "distances": [0.91796875, 0.6875, 0.68359375, 0.6484375, 0.6015625, 0.36328125, 0.357421875, 0.357421875, 0.330078125, 0.314453125], "supports": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0], "metadatas": [{"support": 1, "doc_name": "Mithridatism", "mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "pool_index": 95}, {"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "doc_name": "Mithridatism", "support": 0, "pool_index": 97}, {"support": 0, "pool_index": 98, "mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "doc_name": "Mithridatism"}, {"support": 0, "doc_name": "Mithridatism", "mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "pool_index": 96}, {"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "support": 0, "doc_name": "Mithridatism", "pool_index": 99}, {"pool_index": 138, "doc_name": "Olympic Games", "mapped_id": "00e02ea6-9cca-4c59-9425-b2454cb95776", "support": 0}, {"doc_name": "Olympic Games", "pool_index": 139, "mapped_id": "00e02ea6-9cca-4c59-9425-b2454cb95776", "support": 0}, {"mapped_id": "00e02ea6-9cca-4c59-9425-b2454cb95776", "doc_name": "Olympic Games", "support": 0, "pool_index": 137}, {"support": 0, "doc_name": "Buried treasure", "mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "pool_index": 59}, {"mapped_id": "0189c0a8-88a8-4785-a639-b0904cde3f2f", "doc_name": "Short story", "support": 0, "pool_index": 67}], "recall": 1.0, "precision": 0.1, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "documents": ["1987 film by Singeetam Srinivasa Rao\nPushpaka Vimana (transl. The Flower Chariot) is a 1987 Indian black comedy silent film written and directed by Singeetam Srinivasa Rao, who co-produced it with Shringar Nagaraj. The film, which has no dialogue, stars Kamal Haasan leading an ensemble cast that includes Samir Khakhar, Tinu Anand, K. S. Ramesh, Amala, Farida Jalal, Pratap Potan, Lokanath, P. L. Narayana and Ramya. It revolves around an unemployed graduate who encounters a drunk rich man unconscious and takes over his lifestyle after keeping him prisoner. However, he does not realise the dangers he has brought upon himself because a hired killer believes him to be his target. Rao's desire to make a dialogue-less film came when he was working as an assistant director in a film where a character had to emote fear without dialogue in a scene. Once the idea for \"Pushpaka Vimana\" materialised, Rao wrote the screenplay within two weeks. The film was the only one produced by Nagaraj. Due to the lack of dialogue, Rao was able to cast actors from different parts of India. The cinematography was handled by B. C. Gowrishankar, editing by D. Vasu, art direction by Thota Tharani, and the background score was composed by L. Vaidyanathan. The film was shot in Bangalore, Karnataka.", "Seeing what the hotel owner achieved by fair means, the graduate begins to question his actions. He sees the roadside beggar has died, and municipality workers arrive to take away the body. However, discovering the beggar's stash, they abandon his body and squabble over the money. The graduate decides to stop his deceit. He frees the rich man and explains the situation to him in a letter. The rich man and his wife reunite, and he stops drinking. The graduate decides to come clean to the magician's daughter too. He learns the magician's family is about to leave Pushpak. He confesses the truth to the magician's daughter, and to his surprise she forgives him. She writes down something on a paper and drops a rose wrapped in the paper from her car window as they depart Pushpak. The graduate picks up the rose, but the wind blows the paper into a gutter. Later, the graduate is shown standing in line again to apply for job vacancies. Cast. &lt;templatestyles src=\"Div col/styles.css\"/&gt;* Kamal Haasan as the unemployed graduate\nProduction. Development. Singeetam Srinivasa Rao was assisting director K. V. Reddy in a film where there was a scene requiring a character to emote fear without dialogues. Rao wondered if he could make an entire film that way for a long time, but did not have an idea for the story.", "The film was released on 27 November 1987 with different titles for different linguistic regions: its original title \"Pushpaka Vimana\" in Karnataka (in the Kannada language), \"Pushpaka Vimanam\" in Andhra Pradesh (Telugu), \"Pushpak\" (transl. Flower) in Hindi-speaking regions, \"Pesum Padam\" (transl. Talking Picture) in Tamil Nadu (Tamil), and \"Pushpakvimanam\" in Kerala (Malayalam). It received critical acclaim and became a commercial success, with a 35-week theatrical run in Bangalore. The film won the National Film Award for Best Popular Film Providing Wholesome Entertainment as a Kannada entry and in three categories at the 35th Filmfare Awards South in the Kannada branch: Best Film, Best Director (Rao) and Best Actor (Haasan). Plot. An unemployed graduate living in a ramshackle lodge called Anand Bhavan dreams of riches. He tries to show off his meagre wealth in front of a roadside beggar but is then humbled to discover the beggar has accumulated more money than him. He meets a young woman trying on earrings in a fancy shop and then sees her again while waiting in line to apply for job vacancies. She mistakes the expensive car he is leaning against to be his, and he happily pretends she is right. One night, the graduate finds a drunk rich man unconscious by the roadside.", "The idea for the film that would become \"Pushpaka Vimana\" came to Rao when he was in a shower, after which he wrote the screenplay within two weeks. Kamal Haasan agreed to work on the film after being impressed by the script. According to him, the story was originally a tragedy, but after being inspired by Charlie Chaplin, he and Rao decided to change it to a tragicomedy. \"Pushpaka Vimana\" thus became the first full-length dialogue-less film in India after the \"silent era\" of cinema. The film struggled to find a producer, prompting Rao to take over production himself. When Kannada actor Shringar Nagaraj, a relative of Kannada matinee idol Rajkumar with whom Rao was working at that time, heard that Rao was producing a film on his own, he asked about the subject. Rao narrated \"Pushpaka Vimana\", Nagaraj showed excitement and joined as co-producer, with the film being produced under Mandakani Chitra, a company based in Bangalore, Karnataka. \"Pushpaka Vimana\" was the only film Nagaraj had produced in his entire career. Cinematography was handled by B. C. Gowrishankar, editing by D. Vasu, and art direction by Thota Tharani, who had worked with Rao on \"Raja Paarvai\" (1981). Casting. Since the film had no dialogue, Rao chose to cast actors from different parts of India. Haasan, a native of Tamil Nadu, was cast as the protagonist, an unemployed graduate.", "Finding in his pocket, a key to a suite in the plush \"Pushpak\" hotel, the graduate kidnaps and imprisons the rich man in his room at Anand Bhavan, while he moves into the rich man's suite at Pushpak, and takes over his lifestyle. The rich man's wife has an extramarital affair with his friend, who hires a contract killer to kill the rich man without her knowledge. The killer stakes out the rich man's suite at Pushpak and mistakes the graduate as his target. The graduate discovers the same young woman in a suite opposite his balcony in the same hotel. She is the daughter of a magician performing at the hotel, and she slaps him after mistaking him for pulling a prank on her. They mend ways while paying tribute at the funeral of the hotel owner, and then they spend time together and develop a romantic relationship. Meanwhile, the killer tries to kill the graduate with ice daggers, but he fails in every attempt, with the graduate unaware of the threat to his life. Eventually, the graduate realises the killer is in the hotel to kill someone but does not know who. The killer intrudes into his suite, and barely survives getting electrocuted while trying to stab the graduate. The killer travels to the lover's bungalow to report his failure, and the graduate follows him and learns the truth. The rich man's wife learns of her lover's treachery and leaves him. In a montage shown about the hotel owner, the graduate realises that he was once a poor man similar to himself.", "2015 film by Garin Hovannisian and Alec Mouhibian\n1915 is a 2015 American psychological thriller film written and directed by Garin Hovannisian and Alec Mouhibian. The film stars Simon Abkarian, Angela Sarafyan, Nikolai Kinski, Debra Christofferson, Jim Piddock, and Samuel Page. It follows a mysterious director staging a play to bring the ghosts of a forgotten tragedy back to life on the 100th anniversary of the Armenian genocide. The film was released in theaters on April 17, 2015, and through video on demand on April 22, 2015. Plot. Exactly 100 years after the Armenian genocide committed within the Ottoman Empire, a director (Simon Abkarian) is staging a play at the historic Los Angeles Theatre to honor the victims of the massacre. The play stars his enigmatic wife (Angela Sarafyan) as an Armenian woman in 1915 who must make a tragic and controversial decision that will change the course of history. This will not be an ordinary performance. As protesters surround the theater before showtime, and a series of strange accidents spread panic among its actors (Sam Page, Nikolai Kinski) and producer (Jim Piddock), it appears that Simon's mission is far more dangerous than we think—and the ghosts of the past are everywhere. Themes. The film explores many themes, especially that of denial—referring not only to the 100-year denial of the Armenian Genocide by the Republic of Turkey, but also the many forms of individual denial among the characters in the story.", "2001 Hindi comedy suspense thriller film directed by N. Chandra\nStyle is a 2001 Indian Hindi language comedy film directed by N. Chandra. The film stars Sharman Joshi and Sahil Khan. A sequel titled \"Xcuse Me\" was released in 2003. Plot. The film revolves around two slap-happy college students, Bantu/Nehal (Sharman Joshi) and Chantu/Amit (Sahil Khan), who stand out in the college for their expertise in ragging and playing pranks, and their ability to outfox others. As their college life nears an end, the duo begins to realize that they need to start getting more serious about their life and career. Realising that they are not cut out for a life of struggle and hard work, Bantu comes up with an idea to trick two rich girls into marrying them so that they can spend their lives comfortably which leads them to focus their attention on rich teenyboppers Sheena and Rani and set about wooing the two girls to win their love and ultimately the key to becoming rich. A mysterious woman named Nikki Malhotra enters the scene, and pretty soon Chantu and Bantu get embroiled in a murder mystery. Soundtrack. The music score was given by Sanjeev Darshan. The lyrics are written by Nitin Raikwar, Tejpal Kaur and Abbas Katka. The tune of the song \"Mohabbat Ho Na Jaye\" is a copy of the Egyptian artist Amr Diab's song \"Habibi Ya Nour El Ain\" . Reception.", "Muqaddar Ka Faisla (transl. Decision of fate) is a 1987 Hindi action film directed by Prakash Mehra and produced by Yash Johar. It stars Raaj Kumar, Raakhee, Raj Babbar, Meenakshi Sheshadri, Tina Munim in pivotal roles. Bappi Lahiri has composed the music for the film. Plot. An honest Hindu pandit (priest) is framed for embezzlement and rape, and not only dismissed from employment, but also arrested and imprisoned, leaving behind his family in destitution. On his return from prison, he is unable to locate his family, and plans to avenge his humiliation. But the challenge is that how can a former pandit, ex-convict, penniless, homeless, and without any resources, avenge himself against the cunning and manipulative people who framed him? Music. Lyrics: Anjaan", "Gunahon Ka Faisla is a 1988 Indian Bollywood action film directed by Shibu Mitra and produced by Pahlaj Nihalani. It stars Shatrughan Sinha, Chunky Pandey and Dimple Kapadia in pivotal roles. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Some of the scripts from this period, including a sequel to \"A Nightmare on Elm Street\", have never been made into movies; the proposed zombie film \"Braindead\" underwent extensive rewrites. Jackson's next film to see release was \"Meet the Feebles\" (1989), co-written with Sinclair, Walsh and Mulheron. Begun on a very low budget, \"Meet the Feebles\" went weeks over schedule. Jackson stated of his second feature-length film, \"It's got a quality of humour that alienates a lot of people. It's very black, very satirical, very savage.\" \"Heavenly Creatures\" and \"Forgotten Silver\". Released in 1994 after Jackson won a race to bring the story to the screen, \"Heavenly Creatures\" marked a major change for Jackson in terms of both style and tone. The real-life 1950s Parker–Hulme murder case, in which two teenage girls murdered one of their mothers, inspired the film. It was Fran Walsh that persuaded him that these events had the makings of a movie;(p466) Jackson has been quoted saying that the film \"only got made\" because of her enthusiasm for the subject matter. The film's fame coincided with the New Zealand media tracking down the real-life Juliet Hulme, who wrote books under the name Anne Perry. Melanie Lynskey and Kate Winslet played Parker and Hulme, respectively."], "distances": [0.63671875, 0.625, 0.6015625, 0.546875, 0.5390625, 0.423828125, 0.419921875, 0.4140625, 0.408203125, 0.40625], "supports": [1, 0, 0, 0, 0, 0, 0, 0, 1, 0], "metadatas": [{"support": 1, "pool_index": 150, "doc_name": "Pushpaka Vimana (1987 film)", "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d"}, {"support": 0, "doc_name": "Pushpaka Vimana (1987 film)", "pool_index": 153, "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d"}, {"mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "pool_index": 151, "doc_name": "Pushpaka Vimana (1987 film)", "support": 0}, {"pool_index": 154, "support": 0, "doc_name": "Pushpaka Vimana (1987 film)", "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d"}, {"mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "doc_name": "Pushpaka Vimana (1987 film)", "pool_index": 152, "support": 0}, {"doc_name": "1915 (film)", "pool_index": 16, "support": 0, "mapped_id": "0085a069-c8c1-4a78-9074-0f17d2073f9c"}, {"pool_index": 27, "support": 0, "doc_name": "Style (2001 film)", "mapped_id": "00bdf3e8-1e81-4fe8-8564-0043a56cec48"}, {"mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf", "pool_index": 11, "doc_name": "Muqaddar Ka Faisla", "support": 0}, {"support": 1, "doc_name": "Gunahon Ka Faisla", "pool_index": 10, "mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf"}, {"mapped_id": "007dc247-272e-475c-96c2-5479c1df1d95", "doc_name": "Peter Jackson", "support": 0, "pool_index": 224}], "recall": 1.0, "precision": 0.2, "ndcg": 0.7977228895450266, "mrr": 1.0}
