{"query_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "documents": ["Fictional character from EastEnders\nBen Mitchell is a fictional character from the BBC soap opera \"EastEnders\", who has been played by six different actors since his on-screen birth on 21 March 1996. Matthew Silver appeared as an infant Ben between 1996 and 1998, and Morgan Whittle played him as a toddler between 1999 and 2001. After a five-year absence from the series, Charlie Jones assumed the role of Ben in 2006. In 2010, the character was recast with Joshua Pascoe in the role, who made his first appearance on 13 December 2010. Pascoe quit the role in 2012 and Ben departed on 24 August 2012. Ben's return was announced in May 2014 with Harry Reid in the role; Ben returned on 22 September 2014. Reid was written out of the series in 2017 and Ben departed on 12 January 2018. Ben was reintroduced in 2019 with the role recast to Max Bowden. Ben returned on 1 April 2019. In December 2023, it was announced Bowden would exit the role. Ben departed the series on 28 March 2024, after being extradited to America for credit card fraud.", "Louise blames Jordan Johnson (Michael-Joel David Stuart), an acquaintance of Ben's, but when Phil sees burn marks on Louise's arm, she reveals that Ben is to blame. Phil worries Ben is copying Stella, and punches him when he catches Ben about to burn Louise again. Questioned as to why he hurt Louise, Ben claims that Jordan is bullying him. Phil advises Ben to fight back; soon after, Ben attacks Jordan with a spanner, leaving him with a fractured skull. Phil warns him against admitting to the attack, but Ben confesses and moves in with Ian. After hearing from Crown Court Ben could spend time in juvenile detention, Phil plans to send him to live with his brother Grant Mitchell (Ross Kemp) abroad, but Ben refuses thanks to his grandmother, Peggy Mitchell (Barbara Windsor), making him change his mind, after Phil's girlfriend Shirley Carter (Linda Henry) overhears Phil discussing the plans to Ben and receives a five-month sentence as a result. In July 2010, Phil indeed blames Peggy for Ben's sentencing. Ben tells Peggy and Phil he is coping despite being bullied by Cal Childs (Danny Barnham), and when the Mitchell family discovers this Ben asks them not to visit him. Ben, (now played by Joshua Pascoe) is released, and arrives home to discover Jay Brown (Jamie Borthwick), the foster child of Phil's relative Billy (Perry Fenwick), has usurped his place in Phil's affections. Ben is jealous of Jay initially but does develop a 'brotherly' relationship with him.", "In 2006, the residents hear that Kathy and Gavin have been killed in a car accident, so Ben (now played by Charlie Jones) returns to England to live with his half-brother, Ian Beale (Adam Woodyatt). He eventually moves in with Phil, after Phil wins a long custody battle. Ben dislikes Phil's new girlfriend Stella Crawford (Sophie Thompson), who in turn feels that Ben is intruding on their relationship. She abuses Ben physically and psychologically, from burning him with a hot spoon, also attempting to spoil his friendship with Abi Branning (Lorna Fitzgerald) when she discovers this, to threatening to kill Phil if Ben tells anyone about her actions. Phil and Stella become engaged. On their wedding day in July 2007, Ben admits that Stella has been abusing him; she commits suicide by jumping from a roof. Phil, a recovering alcoholic, begins drinking again in the aftermath, but resumes a life of sobriety for Ben's sake. Unbeknown to Phil, Ben develops an interest in dancing. He secretly takes classes, passing a dance exam, and is ultimately able to gain Phil's approval. In March 2010, Phil's daughter Louise Mitchell (Brittany Papple) comes to stay with the Mitchell family. She steals Ben's diary and fakes an entry which suggests he is gay. In retaliation, Ben burns Louise's hand the same way Stella burnt his. He later locks Louise in a summerhouse for a day in May 2010, then pretends to find her to earn approval from his father.", "However, the storyline where Ben was abused by Stella won \"Best Storyline\" at the 2007 \"Inside Soap\" Awards, and was nominated for the \"Best Soap Storyline\" accolade at the \"TV Quick\" and \"TV Choice\" Awards. In 2012, Pascoe was nominated \"Villain of the Year\", but lost out to Andrew Lancel (\"Coronation Street\"). Lisa O'Connell, also writing for \"The Guardian\", was complimentary of Ben's later, protracted coming out storyline, which she called \"a perfect foundation for years of dramatic conflict\". Storylines. 1996–2012. Ben is born to Phil Mitchell (Steve McFadden) and his then wife Kathy Beale (Gillian Taylforth) in March 1996. Ben becomes ill and is rushed to hospital, where he is diagnosed with meningitis and he is left partially deaf in one ear. As Kathy gives Ben all her affection, Phil turns to alcohol and has an affair with Lorna Cartwright (Janet Dibley), resulting in the breakdown of their marriage. In 1998, Kathy moves to South Africa and takes Ben with her. He accompanies her on two return visits in 1999 before returning with her to South Africa in early 2000. In 2001, Kathy marries a man named Gavin Sullivan (then an unseen character; later played by Paul Nicholas). The same year, Ben briefly returns to stay with Phil who then takes him back to South Africa.", "According to William Faulkner, a short story is character-driven and a writer's job is to \"...trot along behind him with a paper and pencil trying to keep up long enough to put down what he says and does.\" Some authors have argued that a short story must have a strict form. Somerset Maugham thought that the short story \"must have a definite design, which includes a point of departure, a climax and a point of test; in other words, it must have a plot\". Hugh Walpole had a similar view: \"A story should be a story; a record of things happening full of incidents, swift movements, unexpected development, leading through suspense to a climax and a satisfying denouement.\" This view of the short story as a finished product of art is however opposed by Anton Chekhov, who thought that a story should have neither a beginning nor an end. It should just be a \"slice of life\", presented suggestively. In his stories, Chekhov does not round off the end but leaves it to the readers to draw their own conclusions. Sukumar Azhikode defined a short story as \"a brief prose narrative with an intense episodic or anecdotal effect\". Flannery O'Connor emphasized the need to consider what is exactly meant by the descriptor short. Short story writers may define their works as part of the artistic and personal expression of the form. They may also attempt to resist categorization by genre and fixed formation."], "distances": [22.27663835668782, 16.61148242918232, 16.143810090804735, 13.837218005756949, 12.594873877647617], "supports": [0, 0, 0, 0, 0], "metadatas": [{"mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "doc_name": "Ben Mitchell (EastEnders)", "support": 0, "pool_index": 160}, {"mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "doc_name": "Ben Mitchell (EastEnders)", "support": 0, "pool_index": 164}, {"mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "doc_name": "Ben Mitchell (EastEnders)", "support": 0, "pool_index": 163}, {"mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "doc_name": "Ben Mitchell (EastEnders)", "support": 0, "pool_index": 162}, {"mapped_id": "0189c0a8-88a8-4785-a639-b0904cde3f2f", "doc_name": "Short story", "support": 0, "pool_index": 68}], "recall": 0.0, "precision": 0.0, "ndcg": 0.0, "mrr": 0.0}
{"query_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "documents": ["Wonka's Chocolate Room was constructed on the 007 Stage at Pinewood, complete with a faux chocolate waterfall and river. Squirrels were trained from birth for Veruca Salt's elimination. Actor Deep Roy performed each Oompa-Loompa individually rather than one performance duplicated digitally. Burton shot the film simultaneously alongside the stop-motion animated film \"Corpse Bride\", which he also directed. Willy Wonka-themed chocolate bars were sold, and a Golden Ticket contest was launched as part of the film's marketing campaign. Early plans to promote the film with a Broadway theatre musical were not realized. \"Charlie and the Chocolate Factory\" premiered on July 10, 2005, and was released in the United States on July 15 to positive critical reviews, who commended it for its visual appeal and dark tone. It was also a box office success, grossing US$475 million and becoming the eighth-highest-grossing film worldwide in 2005. The film received a nomination for Best Costume Design at the 78th Academy Awards, while Depp was nominated for the Golden Globe Award for Best Actor – Musical or Comedy. It remains Tim Burton's second-highest-grossing film to date. &lt;templatestyles src=\"Template:TOC limit/styles.css\" /&gt;\nPlot. Charlie Bucket is a kind and loving boy who lives in poverty with his family near the Wonka Factory.", "2005 film by Tim Burton\nCharlie and the Chocolate Factory is a 2005 musical fantasy film directed by Tim Burton and written by John August, based on the 1964 British novel of the same name by Roald Dahl. The film stars Johnny Depp as Willy Wonka and Freddie Highmore as Charlie Bucket, alongside David Kelly, Helena Bonham Carter, Noah Taylor, Missi Pyle, James Fox, Deep Roy, and Christopher Lee. The storyline follows Charlie as he wins a contest along with four other children and is led by Wonka on a tour of his chocolate factory. Development for a second adaptation of \"Charlie and the Chocolate Factory\" began in 1991, which resulted in Warner Bros. providing the Dahl estate with total artistic control. Prior to Burton's involvement, directors such as Gary Ross, Rob Minkoff, Martin Scorsese, and Tom Shadyac had been involved, while actors Bill Murray, Nicolas Cage, Jim Carrey, Michael Keaton, Brad Pitt, Will Smith, Adam Sandler, and many others, were either in discussion with or considered by the studio to play Wonka. Burton immediately brought regular collaborators Depp and Danny Elfman aboard. \"Charlie and the Chocolate Factory\" represents the first musical film directed by Burton and the first time since \"The Nightmare Before Christmas\" that Elfman contributed to a film score using written songs and his vocals. Filming took place from June to December 2004 at Pinewood Studios in the United Kingdom. Rather than using computer-generated environments, Burton primarily used built sets and practical effects, which he claimed was inspired by the book's emphasis on texture.", "&lt;templatestyles src=\"Div col/styles.css\"/&gt;\nOther cast members include Adam Godley as Mr. Teavee and Franziska Troegner as Mrs. Gloop. The other four Golden Ticket winners, Violet Beauregarde, Veruca Salt, Mike Teavee, and Augustus Gloop, are portrayed by AnnaSophia Robb, Julia Winter, Jordan Fry, and Philip Wiegratz, respectively. Blair Dunlop plays young Willy Wonka. Charlie's remaining grandparents, Grandma Georgina, Grandma Josephine, and Grandpa George, are portrayed by Liz Smith, Eileen Essell, and David Morris. Nitin Ganatra and Shelley Conn appear as Prince and Princess Pondicherry. Geoffrey Holder narrates the film. Production. Development. Author Roald Dahl disapproved of the 1971 film adaptation. Warner Bros. Pictures and Brillstein-Grey Entertainment entered into discussions with the Dahl estate in 1991, hoping to purchase the rights to produce another film version of \"Charlie and the Chocolate Factory\". The purchase was finalized in 1998, with Dahl's widow, Felicity (\"Liccy\"), and daughter, Lucy, receiving total artistic control and final privilege on the choices of actors, directors and writers. The Dahl estate's subsequent protection of the source material was the main reason that \"Charlie and the Chocolate Factory\" had languished in development hell since the 1990s.", "The company's owner, Willy Wonka, has long closed his factory to the public due to problems concerning industrial espionage, which also caused all his employees, including Charlie's Grandpa Joe, to lose their jobs. Charlie's father, meanwhile, has more recently been laid off from his own job at a toothpaste factory, although he does not admit this to Charlie. One day, Wonka announces a contest in which Golden Tickets have been placed in five random Wonka Bars worldwide, and the winners will receive a full tour of the factory as well as a lifetime supply of chocolate, while one will receive an additional prize at the end of the tour. Wonka's sales subsequently skyrocket, and the first four tickets are found by the gluttonous Augustus Gloop, the spoiled Veruca Salt, the arrogant Violet Beauregarde, and the ill-tempered Mike Teavee. Charlie tries twice to find a ticket, but both bars come up empty. After overhearing that the final ticket was found in Russia, Charlie finds a banknote and purchases a third Wonka Bar. The Russian ticket is revealed to be a forgery just as Charlie discovers the real ticket inside the wrapper. He receives monetary offers for the ticket, but the cashier warns him not to trade it regardless, and Charlie runs back home. At home, Charlie initially wants to trade the ticket for money for his family's betterment, but after a pep talk from Grandpa George, he decides to keep it, and brings Grandpa Joe to accompany him on the tour.", "Charlie and the other ticket holders are greeted outside the factory by Wonka, who then leads them into the facility. Individual character flaws cause the other four children to give in to temptation, resulting in their elimination from the tour while Wonka's new employees, the Oompa-Loompas, sing a song of morality after each. Meanwhile, Wonka reminisces on his troubled past and how his dentist father, Wilbur, strictly forbade him from consuming any candy. After sneaking a piece of candy, Wonka instantly became hooked and ran away from home to follow his dreams. When he returned, however, both his father and their house were gone. After the tour, the four eliminated children leave the factory with an exaggerated characteristic or deformity related to their elimination, while Charlie learns that Wonka, now approaching retirement, intended to find a worthy heir. Since Charlie was the least ill-behaved of the five, Wonka invites Charlie to come live and work in the factory with him, provided that he leave his family behind. Charlie declines, as his family is the most important thing in his life. As Charlie and his family's life improve, Wonka becomes despondent, causing his company and sales to decline. He eventually turns to Charlie for advice, and he decides to help Wonka reconcile with his estranged father, Wilbur. During the reunion, Charlie notices newspaper clippings of Wonka's success which Wilbur collected, while Wonka realizes the value of family as he and Wilbur finally reconcile. Afterwards, Wonka allows Charlie and his family to move into the factory together. Cast."], "distances": [34.054047412247066, 33.64173067726814, 30.11694569140912, 30.016677019411333, 21.614080559933207], "supports": [0, 0, 1, 0, 0], "metadatas": [{"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 0, "pool_index": 121}, {"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 0, "pool_index": 120}, {"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 1, "pool_index": 124}, {"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 0, "pool_index": 122}, {"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 0, "pool_index": 123}], "recall": 1.0, "precision": 0.2, "ndcg": 0.5, "mrr": 0.3333333333333333}
{"query_id": "00367852-4217-48b1-9313-2c21ea592610", "documents": ["Wagner published his book \"Pieces of Eight\" (Recovering The Riches Of A Lost Spanish Fleet) in 1966. This is a detailed account of the finding and exploration of many of these shipwrecks along the Florida \"Treasure Coast.\" An exhibit was set up with a grand opening on May 1, 1967, at the First National Bank of Satellite Beach, Florida. In 1987, another ship in the fleet, the \"Urca de Lima\", became the first shipwreck in the Florida Underwater Archaeological Preserves. Mel Fisher's company, Mel Fisher's Treasures, sold the rights to the 1715 Fleet shipwreck to Queens Jewels, LLC. In 2015, 1715 Fleet - Queens Jewels, LLC and their founder Brent Brisben discovered $4.5 million in gold coins off the coast of Vero Beach, Florida; the coins come from the 1715 Fleet shipwreck site known as the Corrigans wreck. List of identified ships. New evidence (see Jorge Proctor, 2021) shows that the Douglass Beach Wreck, long believed to be the \"Nuestra Señora de las Nieves\", is in fact the \"Santa Rita y Las Animas\", bought by Ubilla in Cuba and renamed \"Nuestra Señora de Regla\", like his flagship. In popular culture. In the 2008 movie \"Fool's Gold\", the protagonists are searching for the location of one of the sunken ships of the treasure fleet (along with its treasure). The treasure fleet was used as the backdrop for a scene in the video game \"\".", "Spanish treasure fleet\nThe 1715 Treasure Fleet was actually a combination of two Spanish treasure fleets returning from the New World to Spain, the \"Nueva España Fleet\", under Capt.-General Don Juan Esteban de Ubilla, and the \"Tierra Firme Fleet\", under Don Antonio de Echeverz y Zubiza. At two in the morning on Wednesday, July 31, 1715, seven days after departing from Havana, Cuba, all eleven ships of the fleet were lost in a hurricane along the east coast of Florida. A 12th ship, the French frigate \"Le Grifon\", had sailed with the fleet. Its captain was unfamiliar with the Florida coastline and elected to stay further out to sea. The \"Grifon\" safely returned to Europe. Because the fleet was carrying silver, it is also known as the 1715 Plate Fleet (\"plata\" being the Spanish word for silver). Some artifacts and even coins still wash up on Florida beaches from time to time. According to Cuban records, around 1,500 sailors perished while a small number survived in lifeboats. Many ships, including pirates, took part in the initial salvage. Initially a privateer, Henry Jennings was first accused of piracy for attacking such salvage ships and claiming their salvages. Exhibits and preserves. Treasure hunter Kip Wagner's team built an exhibit held at National Geographic \"Explorers Hall\" in Washington, D.C. that was featured in the January 1965 issue of \"National Geographic\". This was the beginning of a fine collection of 1715 plate fleet treasure that brought hundreds of visitors from around the world.", "St. David's Lighthouse keeper and treasure-hunter Romer Treece (Robert Shaw), believes the medallion had come from the wreckage of the surviving twelfth ship [of the 1715 Treasure Fleet], thought to be a French tobacco ship that was being protected by the 1715 fleet and named \"Grifon\" (spelt \"El Grifón\" in Peter Benchley's novel \"The Deep\"). The ship was thought to be returning to Havana, Cuba for repairs but instead sank off the coast of Bermuda.\" The plot of the Starz show \"Black Sails\" revolves heavily around the 1715 Treasure Fleet in its first season. The largest of the ships, the \"Urca de Lima\", is wrecked during the hurricane off the coast of Florida, carrying five million Spanish dollars' worth in gold, silver and other precious materials, pursued by Captain Flint and his crew. The treasure, colloquially referred to as \"the Urca gold\", is an important plot device throughout the series. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Treasure Fleet, sometimes billed as The Treasure Fleet, is a Chicago-based band featuring members of The Lawrence Arms, The Arrivals, and Smoking Popes. Originally formed in 2009 by Isaac Thotz and Neil Hennessy, the two added Dave Merriman and Mike Oberlin and played a few shows as a four piece before adding Eli Caterer as a lead guitarist. Their sound has been influenced by bands of the ‘60s and ‘70s. Treasure Fleet played The Fest in 2014 along with Paint It Black, The City on Film, and Iron Chic. The same year they played a four night stint with Alkaline Trio at Metro Chicago. They participated in Recess Records' 25th anniversary tour. Their debut album, \"Cocamotion\", was released in 2012. Their sophomore effort, \"Future Ways\", was released later the same year. In 2015, they released \"The Sun Machine\" on Recess Records. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Literary trope\nBuried treasure is a literary trope commonly associated with depictions of pirates, alongside Vikings, criminals, and Old West outlaws. According to popular conception, these people often buried their stolen fortunes in remote places, intending to return to them later (often with the use of a pirate’s treasure map). Pirates burying treasure was a rare occurrence, with the only known instance being William Kidd, who buried some of his wealth on Gardiners Island. The myth of buried pirate treasure was popularized by such 19th-century fiction as \"Wolfert Webber\", \"The Gold-Bug\", and \"Treasure Island\". The idea of treasure maps leading to buried treasure is considered a fictional device. There are cases of buried treasure from different historical periods, such as the Dacian king Decebalus and Visigoth king Alaric I, who both changed the course of rivers to hide their treasures. Legends of buried pirate treasure have existed for centuries, but authenticated discoveries are rare. For example, extensive excavations on Oak Island, Nova Scotia have not yielded any treasure. The only authenticated treasure chest in the United States is kept at the Pirate Soul Museum in St. Augustine, Florida. Buried treasure is a cultural concept and not the same as a hoard, which is typically found by archaeologists and metal detectors. The Fenn treasure, reportedly buried by millionaire Forrest Fenn in 2010, was found in 2020 in Wyoming. Pirates. Pirates burying treasure was rare."], "distances": [29.935643948370817, 27.007950120969177, 22.92668103197187, 15.278762557288335, 13.224451543698255], "supports": [1, 1, 1, 0, 0], "metadatas": [{"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "1715 Treasure Fleet", "support": 1, "pool_index": 186}, {"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "1715 Treasure Fleet", "support": 1, "pool_index": 185}, {"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "1715 Treasure Fleet", "support": 1, "pool_index": 188}, {"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "Treasure Fleet", "support": 0, "pool_index": 189}, {"mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "doc_name": "Buried treasure", "support": 0, "pool_index": 57}], "recall": 1.0, "precision": 0.6, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "documents": ["In 2010, Corr appeared in the final few episodes of ' as Michael Kanaan and was a regular character on the popular Australian television show \"Packed to the Rafters\", playing Dave Rafter's nephew Coby Jennings. In 2013, he appeared in the teen thriller film \"6 Plots\", and starred alongside John Jarratt in \"Wolf Creek 2\", the 2013 sequel to the horror film \"Wolf Creek\". In 2015, Corr starred in Neil Armfield's romantic-drama film \"Holding the Man\", adapted from Timothy Conigrave's 1995 memoir of the same name. He portrayed Conigrave opposite Craig Stott who portrayed Conigrave's partner, John Caleo. In 2016, he starred in the television series \"Wanted\". Corr appeared as Joseph in Helen Edmundson's 2018 film \"Mary Magdalene\". In 2022, he had a recurring role in HBO's \"House of the Dragon\" as Ser Harwin Strong. In 2024, Corr was named for feature film \"Kangaroo.\" Legal issues. In May 2014, Corr was charged with heroin possession after being found with a freezer bag holding 0.26g (less than 1/100 of an ounce) of the drug in the Sydney suburb of Bondi. After admitting to the possession, the actor was given a 12-month good behaviour bond with no conviction recorded. The arrest took place a few days after Corr's grandfather went into a coma following a heart attack.", "Australian actor\nRyan Corr is an Australian actor. He is known for his roles in the Australian drama series \"Packed to the Rafters\", \"Love Child\" and \"Underbelly\", along with film roles in \"Wolf Creek 2\" (2013), \"The Water Diviner\" (2014), \"Holding the Man\" (2015), as well as the \"Game of Thrones\" prequel \"House of the Dragon\". Early life. Corr was born in Melbourne. His father is Peter Corr, the head coach of the Australian women's goalball team. In 2009, he graduated from the National Institute of Dramatic Art (NIDA). Career. He began making appearances in film and television from the age of five, but started his acting career in earnest at age thirteen with the film \"Opraholic\". His first television performance was on \"The Sleepover Club\" with a supporting role as Matthew McDougal. Following this, he landed a lead role as Sheng Zamett on \"Silversun\" (2004). Soon after, Corr had guest appearances on shows such as ', \"Blue Heelers\", and \"Neighbours\". As a voice actor, he voiced a sheep in \"Charlotte's Web\". In 2006, the second series of \"Blue Water High\" aired on Australian TV in which Corr starred as young surfer Eric, one of the six chosen teens to attend Solar Blue.", "The setting of the early ballads is usually attributed by scholars to either the 13th century or the 14th, although it is recognised they are not necessarily historically consistent. The early ballads are also quite clear on Robin Hood's social status: he is a yeoman. While the precise meaning of this term changed over time, including free retainers of an aristocrat and small landholders, it always referred to commoners. The essence of it in the present context was \"neither a knight nor a peasant or 'husbonde' but something in between\". Artisans (such as millers) were among those regarded as 'yeomen' in the 14th century. From the 16th century on, there were attempts to elevate Robin Hood to the nobility, such as in Richard Grafton's \"Chronicle at Large\"; Anthony Munday presented him at the very end of the century as the Earl of Huntingdon in two extremely influential plays, as he is still commonly presented in modern times. As well as ballads, the legend was also transmitted by 'Robin Hood games' or plays that were an important part of the late medieval and early modern May Day festivities. The first record of a Robin Hood game was in 1426 in Exeter, but the reference does not indicate how old or widespread this custom was at the time. The Robin Hood games are known to have flourished in the later 15th and 16th centuries. It is commonly stated as fact that Maid Marian and a jolly friar (at least partly identifiable with Friar Tuck) entered the legend through the May Games. Early ballads.", "Tod vividly revises \"The Burning of Los Angeles\" in his mind, while being pushed around in the human waves of the riot. The final scene plays out, uninterrupted. The conclusion of the novel can be read as a moment of epiphany and mental clarity for the artist, or a complete \"mental breakdown\" and Tod's \"incorporation into the mechanized, modern world of Los Angeles.\" Themes. The characters are outcasts, who have come to Hollywood to fulfill a dream or wish:\n\"The importance of the wish in West's work was first noted by W. H. Auden, who declared (in one of the interludes in \"The Dyer's Hand\") that West's novels were essentially \"parables about a Kingdom of Hell whose ruler is not so much a Father of Lies as a Father of Wishes\". In this respect, James Light, in his book \"Violence, Dreams, and Dostoevsky: The Art of Nathanael West\", suggests that \"The Day of the Locust\" falls in with a motif in West's fiction; the exposure of hopeful narratives in modern American culture as frauds. As some critics point out, West's novel was a radical challenge to modernist literature. Some modernists set themselves up in opposition to mass culture; West depicts it and makes it an integral part of the novel. West's use of grotesque imagery and situations establishes the novel as a work of Juvenalian satire.", "\"I Was Kaiser Bill's Batman\" was a hit single in 1967 composed by British songwriters Roger Cook and Roger Greenaway. It was a novelty record, performed mostly by whistling. The name Whistling Jack Smith, credited on the most commercially successful recording, was a play on the name of the baritone singer of the 1920s, 1930s and 1940s, Whispering Jack Smith. Production. The tune was written by Greenaway and Cook and was originally titled \"Too Much Birdseed\". It was recorded as a single for Deram Records by record producer Noel Walker, using studio musicians together with the Mike Sammes Singers. The whistling on the record was, according to most sources, by John O'Neill, a trumpeter and singer with the Mike Sammes Singers who was known for his whistling skill, though other sources credit Noel Walker. The song is noted for its false ending: after the last chorus, a male voice shouts \"Oi\" (on the album version) and \"Hey\" (on the single version), and the tune starts up again with the repeated chorus, then fades out. Performances. Credited to Whistling Jack Smith, the record rose up the UK singles chart. When it was featured on \"Top of the Pops\", actor Coby Wells was used to mime the whistling, and later toured as the public face of Whistling Jack Smith. Wells' real name was Billy Moeller, a brother of Tommy Moeller, lead vocalist, guitarist, and pianist with Unit 4 + 2. The recording reached #5 on the UK singles chart in March 1967, staying in the chart for 12 weeks."], "distances": [20.663851197216935, 15.832518098606553, 11.713448038401607, 11.230096453574498, 10.860827142419655], "supports": [1, 1, 0, 0, 0], "metadatas": [{"mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "doc_name": "Ryan Corr", "support": 1, "pool_index": 171}, {"mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "doc_name": "Ryan Corr", "support": 1, "pool_index": 170}, {"mapped_id": "00797510-92d0-4289-965d-8f69978bcdd0", "doc_name": "Robin Hood", "support": 0, "pool_index": 93}, {"mapped_id": "00acbdb7-0afa-4f62-81b7-a95e501336a4", "doc_name": "The Day of the Locust", "support": 0, "pool_index": 193}, {"mapped_id": "018a5779-9152-4555-909c-4d7a12421ba0", "doc_name": "I Was Kaiser Bill's Batman", "support": 0, "pool_index": 210}], "recall": 1.0, "precision": 0.4, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "documents": ["Best Day Ever is the fifth mixtape by American rapper Mac Miller. It was released by Rostrum Records on March 11, 2011, as the follow-up to Miller's acclaimed mixtape \"K.I.D.S.\" (2010). The mixtape consists of sixteen songs produced by nine producers (predominantly ID Labs), and includes features from rappers Wiz Khalifa and Phonte. Four songs from \"Best Day Ever\" have music videos: \"Donald Trump\", \"Get Up\", \"Wear My Hat\" and \"Best Day Ever\". Release and promotion. Over 20,000 viewers joined Miller for a live video stream prior to the mixtape's release. As of March 2019, the mixtape has received over 1.2 million downloads and 1.5 million streams on its official host, DatPiff. The song \"Donald Trump\" was released as a single on May 17, 2011. It became his first singles entry on the US \"Billboard\" Hot 100, peaking at number 75, and was certified platinum by the Recording Industry Association of America (RIAA). Its music video has received over 180 million views on YouTube, and is Miller's most-viewed video. When the video surpassed 16 million views, Donald Trump acknowledged the song on the social networking site Twitter, stating \"Who wouldn't be flattered?\". In June 2016, \"Best Day Ever\" was remastered and commercially released by Rostrum Records for its fifth anniversary. Critical reception. The mixtape received favorable reviews, including an \"XL\" (second highest) from \"XXL\" magazine. Commercial performance.", "\"Best Day Ever\" is the first segment of the 20th episode of the fourth season of the American animated television series \"SpongeBob SquarePants\", and the 80th episode overall. The episode was written by Nate Cash, Tuck Tucker, and Steven Banks, and the animation was directed by Larry Leichliter; Cash and Tucker also functioned as storyboard directors. It originally aired on Nickelodeon in the United States on November 10, 2006. In the episode, SpongeBob is determined to have a perfect day, which, to his disappointment, does not go as he planned. Each of his friends has a different problem of their own, so he sets out to help them while spoiling his own agendas. The episode features a song titled \"The Best Day Ever\" written by Tom Kenny and Andy Paley. A soundtrack album, \"SpongeBob SquarePants: The Best Day Ever\", was released on September 12, 2006. \"Best Day Ever\" pulled an average of 6.7 million viewers upon release. The song was actually used two years earlier in the credits of \"The SpongeBob SquarePants Movie\". Plot. SpongeBob's \"Best Day Ever\" fails to turn out as he planned when he is forced to postpone his activities to help his friends with various problems. He wanted to work at the Krusty Krab, but it is condemned because of a nematode infestation. SpongeBob tries to get the nematodes to go away but they refused to and they eat his pants.", "Following Miller's death on September 7, 2018, \"Best Day Ever\" debuted at number 26 on the US \"Billboard\" 200 with 17,000 album-equivalent units. Track listing. Credits adapted from DatPiff and Spotify. Notes\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Puff said his name when she found him hiding in her purse in one attempt). He gets in right as the concert ends. Upset and angry that his \"Best Day Ever\" is a disaster, SpongeBob snaps and has a freak-out, runs up to the stage, and rips open the curtain yelling \"NO! It is NOT over!\" He grabs the microphone to give an elaborate speech about how his \"Best Day Ever\" has been ruined. However, Mr. Krabs, Patrick, Sandy and Squidward tell him about how he helped them with their problems and that they themselves were what his \"Best Day Ever\" was actually about. To make it up to him, they hold a production in which SpongeBob performs his song, \"Best Day Ever\", to complete his day with Patrick, Sandy, Squidward, and Mr. Krabs co-starring along in it. A few hours later, SpongeBob is still singing, but his friends are tired and sleepy, and the audience has all disappeared. When Squidward asks Mr. Krabs how long they have to keep up the performance, Mr. Krabs replies, \"Just 'til his little heart gives out, Squidward. Just 'til his little heart gives out.\" Production. \"Best Day Ever\" was written by Nate Cash, Tuck Tucker and Steven Banks, with Larry Leichliter serving as animation director. Cash and Tucker also functioned as storyboard directors. The episode originally aired on Nickelodeon in the United States on November 10, 2006.", "1962 film by Blake Edwards\nDays of Wine and Roses is a 1962 American romantic drama film directed by Blake Edwards with a screenplay by JP Miller adapted from his own 1958 \"Playhouse 90\" teleplay of the same name. The film was produced by Martin Manulis, with music by Henry Mancini, and features Jack Lemmon, Lee Remick, Charles Bickford and Jack Klugman. The film depicts the downward spiral of two average Americans who succumb to alcohol use disorder and attempt to deal with their problems. An Academy Award went to the film's theme music, composed by Mancini with lyrics by Johnny Mercer. The film received four other Oscar nominations, including Best Actor and Best Actress. In 2018, \"Days of Wine and Roses\" was selected for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant.\" Plot. San Francisco public relations executive Joe Clay meets secretary Kirsten Arnesen. At first, he mistakes her for a call girl, but then when he learns she is a client's secretary, he tries to apologize and court her but she brushes him off. Eventually she warms to him and they begin dating. Kirsten is a teetotaler until Joe introduces her to social drinking. She is initially reluctant, but after her first few Brandy Alexanders, she admits that having a drink makes her \"feel good.\" Despite the misgivings of Kirsten's father, who runs a San Mateo plant nursery and landscaping business, they marry and have a daughter, Debbie."], "distances": [29.47168120113997, 18.106759987516234, 17.711705973240015, 16.24628013047079, 7.352772358285728], "supports": [1, 0, 0, 0, 0], "metadatas": [{"mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "doc_name": "Best Day Ever (mixtape)", "support": 1, "pool_index": 110}, {"mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "doc_name": "Best Day Ever", "support": 0, "pool_index": 112}, {"mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "doc_name": "Best Day Ever (mixtape)", "support": 0, "pool_index": 111}, {"mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "doc_name": "Best Day Ever", "support": 0, "pool_index": 114}, {"mapped_id": "01fa3800-7594-4f6d-8871-b3fb685de2f3", "doc_name": "Days of Wine and Roses (film)", "support": 0, "pool_index": 241}], "recall": 1.0, "precision": 0.2, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "documents": ["Canadian women's curling championship\nThe Scotties Tournament of Hearts ('; commonly referred to as the Scotties) is the annual Canadian women's curling championship, sanctioned by Curling Canada, formerly called the Canadian Curling Association. The winner goes on to represent Canada at the women's world curling championships. Since 1985, the winner also gets to return to the following year's tournament as \"Team Canada\". It is formally known as the \"Canadian Women's Curling Championship\". Since 1982, the tournament has been sponsored by Kruger Products, which was formerly known as Scott Paper Limited when it was a Canadian subsidiary of Scott Paper Company. As such, the tournament was formerly known as the Scott Tournament of Hearts; when Kimberly-Clark merged with Scott, the Canadian arm was sold to the Quebec-based Kruger Inc. – while Kruger was granted a license to use several Scott brands in Canada until June 2007, it was given a long-term license to the Scotties brand because Kimberly-Clark already owned Kleenex. As such, the tournament was officially renamed the Scotties Tournament of Hearts in 2007. Until 2018, the format was a round robin of 12 teams. Starting with the 2015 Scotties Tournament of Hearts there have been more than twelve eligible teams; therefore a pre-qualification tournament was held to trim the field to twelve. In 2021, a new 18-team format was introduced, in which all 14 member associations of Curling Canada field a team in a main draw of two pools, alongside the defending champions, and the three highest-ranked teams on the Canadian Team Ranking System standings that did not win their provincial championships.", "The rinks of Hollie Duncan (Ontario), Émilia Gagné (Quebec), and Casey Scheidegger (Alberta) made their Scotties debut; although members of Team Ontario had previous experience at the national women's championship, mostly as alternates. Scotties veteran skip Sherry Anderson (Saskatchewan) led a team of Tournament of Hearts rookies. The teams are listed as follows:\nWildcard game. A wildcard play-in game was played on January 26; it was contested between the top two teams on the CTRS standings who did not win their respective provincial championships, and was played between The Glencoe Club's Chelsea Carey rink from Calgary and the East St. Paul Curling Club's Kerri Einarson rink from the Winnipeg exurb of East St. Paul. With Einarson's victory, Manitoba was represented by three different teams in the tournament. \"Friday, January 26, 18:30\"\nRound Robin standings. \"Final Round Robin Standings\"\nRound Robin results. All draw times are listed in Pacific Standard Time (). Draw 1. \"Saturday, January 27, 14:00\"\nDraw 2. \"Saturday, January 27, 19:00\"\nDraw 3. \"Sunday, January 28, 09:00\"\nDraw 4. \"Sunday, January 28, 14:00\"\nDraw 5. \"Sunday, January 28, 19:00\"\nDraw 6. \"Monday, January 29, 09:00\"\nDraw 7. \"Monday, January 29, 14:00\"\nDraw 8. \"Monday, January 29, 19:00\"\nDraw 9.", "The 2018 Scotties Tournament of Hearts, Canada's national women's curling championship, was held from January 27–February 4, 2018 at the South Okanagan Events Centre in Penticton, British Columbia. The winning team represented Canada at the 2018 Ford World Women's Curling Championship held from March 17–25 at the Memorial Gardens in North Bay, Ontario. The 2018 tournament was the first to use a new 16-team format, featuring representation by all fourteen member associations of Curling Canada, the second-place team from the 2017 tournament (as champion Rachel Homan declined to participate due to her qualification for the 2018 Winter Olympics), and a new wildcard team. As part of this new format, the Bronze medal game was removed from the schedule. Teams. Curling Canada introduced a new 16-team format for both the Tournament of Hearts and Brier for 2018, under which all 14 member associations of Curling Canada were represented in the main field, rather than being limited by a pre-qualifying tournament. The teams were divided into two pools for round robin play, after which the top four teams from each advanced to the Championship Pool. Defending champion Rachel Homan declined to participate as Team Canada in order to prepare for the 2018 Winter Olympics; Michelle Englot's team, who finished as runner-up in the 2017 tournament, participated in her place. The final spot in the tournament was filled by a wildcard play-in game held on the Friday before the tournament.", "Self-dosing with poison to gain immunity\nMithridatism is the practice of protecting oneself against a poison by gradually self-administering non-lethal amounts. The word is derived from Mithridates VI, the king of Pontus, who so feared being poisoned that he regularly ingested small doses, aiming to develop immunity. Background. Mithridates VI's father, Mithridates V, was assassinated by poisoning by a conspiracy among his attendants. After this, Mithridates VI's mother held regency over Pontus (a Hellenistic kingdom, 281 BC–62 AD) until a male heir came of age. Mithridates was in competition with his brother for the throne and his mother began to favor his brother. Supposedly, during his youth, he began to suspect plots against him at his own mother's orders and was aware of her possible connection with his father's death. He then began to notice pains in his stomach during his meals and suspected his mother had ordered small amounts of poison to be added to his food to slowly kill him off. With other assassination attempts, he fled into the wild. While in the wild, it is said that he began ingesting non-lethal amounts of poisons and mixing many into a universal remedy to make him immune to all known poisons. After Mithridates' death, many Roman physicians claimed to possess and improve the formula. In keeping with most medical practices of his era, Mithridates' anti-poison routines included a religious component, supervised by the \"Agari\", a group of Scythian shamans who never left him.", "2006 film\nGunahon Ka Sheher is a 2006 Pakistani Urdu language erotic film, directed by Pashto film director Saeed Ali Khan. Synopsis. The story of \"Aik Gunahoon Ka Shehr\" revolves around a young man (Ahmed Butt) fascinated by city life and the thrills it has to offer. Once there, unemployment eventually leads him to join a gang of blackmailers involved in sex crimes, in turn leading to his ruin. Controversy. When the team of Aik Gunahoon Ka Shehr approached the Pakistan Film Censor Board for a clearance certificate, objection was raised over the phrase Gunahoon Ka Shehr. Later the name was modified to Aik Gunahoon Ka Shehr. What exactly they aimed to achieve by this is still a mystery. Secondly, the members of the respected censor board charged that the film contained erotic scenes and dialogue. Consequently, the film appeared before a full board who chopped off several scenes and dialogues which they considered ‘unnecessary’ and ‘irrelevant’, resulting in the producer reshooting them. Annoyed, producer Saeed Iqbal presented his stand before the censor board members, stating that the story of the film depicts the true picture of youth today who indulge in sex and crime. \"The objection was unfair because already a number of Pakistani, Indian and English movies with sexual content are being exhibited at cinemas and cable networks throughout the country,\" he said. He further confessed that it is not a family film. \"Who likes to watch a family film in our dingy cinema houses?"], "distances": [16.553151608844743, 12.293920569253832, 12.101168463811277, 10.219552529854445, 9.251976774494278], "supports": [0, 1, 0, 1, 0], "metadatas": [{"mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "doc_name": "Scotties Tournament of Hearts", "support": 0, "pool_index": 109}, {"mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "doc_name": "2018 Scotties Tournament of Hearts", "support": 1, "pool_index": 106}, {"mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "doc_name": "2018 Scotties Tournament of Hearts", "support": 0, "pool_index": 105}, {"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "doc_name": "Mithridatism", "support": 1, "pool_index": 95}, {"mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf", "doc_name": "Gunahon Ka Sheher", "support": 0, "pool_index": 12}], "recall": 1.0, "precision": 0.4, "ndcg": 0.6509209298071326, "mrr": 0.5}
{"query_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "documents": ["1967 film by Robert Day\nTarzan and the Great River is a 1967 adventure film starring Mike Henry in his second of three film appearances as Tarzan. The twenty-seventh and penultimate film of the \"Tarzan\" film series that began with 1932's \"Tarzan the Ape Man\", the film was produced by Sy Weintraub and Steve Shagan, written by Bob Barbash (from a story by Barbash and Lewis Reed), and directed by Robert Day. Released on September 1, 1967, it was followed by \"Tarzan and the Jungle Boy\" in 1968. Plot. Tarzan is called to Brazil by an old friend, The Professor (Paulo Gracindo) to help stop the Jaguar Cult, led by Barcuma (Rafer Johnson), from destroying native villages and enslaving the survivors in his search for diamonds. Tarzan is assisted by Captain Sam Bishop (Jan Murray), a riverboat pilot, and Bishop's young ward, Pepe (Manuel Padilla Jr.), as well as Baron (a lion) and Cheeta (a chimpanzee). On their way they encounter Dr. Ann Philips (Diana Millay), who has witnessed the destruction of a village, and wants to continue fighting a plague by giving much-needed inoculations to natives who live along the Amazon River. Production notes. The movie was filmed entirely on location in Rio de Janeiro, Brazil (Rio de Janeiro Zoo, Parque Lage and Tijuca Forest). Dinky, the chimp portraying Cheeta, bit Mike Henry on the jaw during filming, requiring twenty stitches.", "The Tarzan River is a river in the United States territory of Guam. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "1963 collection of two Tarzan novellas by Edgar Rice Burroughs\nTarzan and the Tarzan Twins is a collection of two Tarzan novellas by American writer Edgar Rice Burroughs, for younger readers. It was originally published as two children's books, \"The Tarzan Twins\" by Voland in October 1927, and \"Tarzan and the Tarzan Twins, with Jad-bal-ja, the Golden Lion\", by Whitman in March 1936. These were brought together in November 1963 under the title of \"Tarzan and the Tarzan Twins\" in the first complete edition. Despite the gap in when they were written and first published, the events of the two stories occur in the same time-frame. The opening passage of \"Tarzan and the Tarzan Twins, with Jad-bal-ja, the Golden Lion\" specifies that its events occur immediately after those of \"The Tarzan Twins.\" In relation to other Tarzan stories, the two parts of the Tarzan Twins tale presumably fall between \"Tarzan and the Ant Men\" and \"Tarzan, Lord of the Jungle\" chronologically, as the initial part was published between these two novels. The second part confirms their placement in approximately this period, as it introduces a family that figures prominently in \"Tarzan and the Lost Empire\", the next book after \"Tarzan, Lord of the Jungle\"; specifically, it features Tarzan's first meeting with Doctor Karl von Harben, with whom he is already acquainted in \"Empire\". Because \"Twins\" is a children's book, however, it is customarily omitted from listings of the main Tarzan series.", "In 1911, American author Ralph D. Paine conducted a survey of all known or purported stories of buried treasure and published them in \"The Book of Buried Treasure\". He found a common trait in all the stories: there was always a lone survivor of a piratical crew who somehow preserved a chart showing where the treasure was buried, but unable to return himself, he transfers the map or information to a friend or shipmate, usually on his deathbed. This person would then go search in vain for the treasure, but not before transferring the legend down to another hapless seeker. Cases. The Roman historian Dio Cassius says that, in the early 2nd century, the Dacian king Decebalus had changed the course of the river Sargetia and buried tons of gold and silver in the riverbed. Later, he ordered the river to be restored, and the slaves involved in the works to be executed. However, one of his nobles revealed the treasure's location to the Romans. The Byzantine historian Jordanes tells a similar story of the burial of the Visigoth king Alaric I and his treasure under the river Busento in 410. The burial places of the Khazar kings (\"qoruq\") and other inner Asian people were also under a rerouted river. There are a number of reports of supposed buried pirate treasure that surfaced much earlier than these works, indicating that the idea was around for more than a century before those stories were published.", "Thus \"Tarzan, Lord of the Jungle\" is generally considered the eleventh Tarzan book rather than \"Twins\". Plot. Two schoolboys, Dick and Doc, are cousins who resemble each other because their mothers are twins. As Dick is also related to Tarzan through his father, they become known as the Tarzan Twins. Invited to visit Tarzan's African estate, they become lost in the jungle and are imprisoned by cannibals, from whom they escape. They are then reunited with their host, who introduces them to his pet lion, Jad-bal-ja. Subsequently, they become involved in an adventure involving exiles from the lost city of Opar, who have kidnapped Gretchen von Harben, the daughter of a missionary. The brutish Oparians, adherents of the deposed and deceased high priest Cadj, are seeking a place to continue worship of the Flaming God in the traditional way, as Opar's Queen La has outlawed human sacrifice in the lost city. They plan to make their young captive Gretchen, whom they dub \"Kla\", meaning \"New La\", their new high priestess. She is eventually rescued by Tarzan and the twins, while Glum, leader of the exiles, and some of his adherents are killed. Tarzan orders the survivors to return to Opar and be loyal to La. Comic adaptations. The book has been adapted into comic form by Gold Key Comics in \"Tarzan\" no. 196, dated April 1971, with a script by Gaylord DuBois and art by Mike Royer."], "distances": [28.4101453481203, 20.578727861635365, 20.57008852322543, 19.134422937971358, 18.569145014147967], "supports": [1, 0, 0, 0, 0], "metadatas": [{"mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan and the Great River", "support": 1, "pool_index": 5}, {"mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan River", "support": 0, "pool_index": 7}, {"mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan and the Tarzan Twins", "support": 0, "pool_index": 8}, {"mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "doc_name": "Buried treasure", "support": 0, "pool_index": 59}, {"mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan and the Tarzan Twins", "support": 0, "pool_index": 9}], "recall": 1.0, "precision": 0.2, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "documents": ["Software management\nSoftware asset management (SAM) is a business practice that involves managing and optimizing the purchase, deployment, maintenance, utilization, and disposal of software applications within an organization. According to ITIL, SAM is defined as “…all of the infrastructure and processes necessary for the effective management, control, and protection of the software assets…throughout all stages of their lifecycle.” \nFundamentally intended to be part of an organization's information technology business strategy, the goals of SAM are to reduce information technology (IT) costs and limit business and legal risk related to the ownership and use of software, while maximizing IT responsiveness and end-user productivity. SAM is particularly important for large corporations regarding redistribution of licenses and managing legal risks associated with software ownership and expiration. SAM technologies track license expiration, thus allowing the company to function ethically and within software compliance regulations. This can be important for both eliminating legal costs associated with license agreement violations and as part of a company's reputation management strategy. Both are important forms of risk management and are critical for large corporations' long-term business strategies. SAM is one facet of a broader business discipline known as IT asset management, which includes overseeing both software and hardware that comprise an organization's computers and network. Role within organizations. SAM can serve many different functions within organizations, depending on their software portfolios, IT infrastructures, resource availability, and business goals. For many organizations, the goal of implementing a SAM program is very tactical, explicitly focused on balancing the number of software licenses purchased with the number of actual licenses consumed or used.", "In addition to balancing the number of licenses purchased with the amount of consumption, an effective SAM program must also ensure that the usage of all installed software is in keeping with the terms and conditions of the specific vendor license agreement. In doing so, organizations can minimize liabilities associated with software piracy in the event of an audit by a software vendor or a third party such as the Business Software Alliance (BSA). SAM, according to this interpretation, involves conducting detailed software inventories on an ongoing basis to determine the exact number of software licenses consumed, comparing this information with the number of licenses purchased, and reviewing how the software is being used in respect to the terms and conditions and establishing controls to ensure that proper licensing practices are maintained on an ongoing basis. This can be accomplished through IT processes, purchasing policies and procedures, and technology solutions such as software inventory tools. Counting installations are the most common means of measuring license consumption but some software is licensed by the number of users, capital, processors, or CPU Cores. More broadly defined, the strategic goals of SAM often include (but are not limited to) the following: \nSAM Technology. Several technologies are available to support key SAM processes:\nInternational Organization for Standardization (ISO). The ISO/IEC 19770 family of standards are designed to help organizations manage IT assets including software assets (SAM). The published standards are outlined below:\nISO/IEC 19770-1:2017: IT Asset Management Systems Requirements is a process framework to enable an organization to incorporate ITAM (including SAM) processes and policies sufficient to satisfy corporate governance requirements and ensure effective support for IT service management overall.", "The implementation of SAM processes to be \"accomplished in multiple staged increments or tiers.\" Part 1 of the standard details SAM processes including control environment, planning and implementation, inventory, verification and compliance, operations management and life cycle. ISO/IEC 19770-2:2015: Software identification tag; establishes specifications for tagging software to optimize its identification and management. The current version was published in 2015 and is a revision to the 2009 original Software ID Tag standard. Using software identification tags or SWID tags makes discovery a simpler and more accurate process that can be verified by software vendors if they audit an organisations entire estate. SWID tags are implemented and supported by many vendors including IBM, Microsoft and Adobe. ISO/IEC 19770-3:2016: Entitlement Management Schema outlines a technical schema which can be used to encapsulate license details including contract information, entitlements, rights, limitations and details about invoice, PO numbers, etc. ISO/IEC 19770-4:2017: Resource Utilization Measurement provides an ITAM data standard for Resource Utilization Measurement (\"RUM\"). ISO/IEC 19770-5:2015: Overview and Vocabulary provides an overview of the 19770 standards as well as defines vocabulary used throughout the standards. Issues with scalability. An example of issues faced when scaling up discovery tools is with Microsoft's System Centre Configuration Manager (SCCM).", "VITAL is a software suite of digital asset management products by VTLS based on the open source Fedora architecture. It was unveiled at the 2004 American Library Association's Midwinter Meeting. Version 2.0 was released November 29, 2005 after acceptance testing by Australian Research Repositories Online to the World. In 2014, VTLS was acquired by Innovative Interfaces\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Using SCCM Metering Rules to monitor software usage across a small estate or a small number of applications is relatively easy and reliable given the total number of unique executables (.exe files) and the number of instances of each executable. Turning on Metering Rules for every packaged application and every executable in a large estate quickly makes the volume of data generated unmanageable and expensive to maintain. Most SAM tools which consume SCCM data rely on these Metering Rules to understand usage. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;"], "distances": [29.223317157475698, 24.60042185636114, 19.400728907711695, 18.360558965410167, 11.021680964168567], "supports": [1, 0, 0, 0, 0], "metadatas": [{"mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "doc_name": "Software asset management", "support": 1, "pool_index": 100}, {"mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "doc_name": "Software asset management", "support": 0, "pool_index": 101}, {"mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "doc_name": "Software asset management", "support": 0, "pool_index": 102}, {"mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "doc_name": "VITAL (asset management software)", "support": 0, "pool_index": 104}, {"mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "doc_name": "Software asset management", "support": 0, "pool_index": 103}], "recall": 1.0, "precision": 0.2, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "documents": ["Self-dosing with poison to gain immunity\nMithridatism is the practice of protecting oneself against a poison by gradually self-administering non-lethal amounts. The word is derived from Mithridates VI, the king of Pontus, who so feared being poisoned that he regularly ingested small doses, aiming to develop immunity. Background. Mithridates VI's father, Mithridates V, was assassinated by poisoning by a conspiracy among his attendants. After this, Mithridates VI's mother held regency over Pontus (a Hellenistic kingdom, 281 BC–62 AD) until a male heir came of age. Mithridates was in competition with his brother for the throne and his mother began to favor his brother. Supposedly, during his youth, he began to suspect plots against him at his own mother's orders and was aware of her possible connection with his father's death. He then began to notice pains in his stomach during his meals and suspected his mother had ordered small amounts of poison to be added to his food to slowly kill him off. With other assassination attempts, he fled into the wild. While in the wild, it is said that he began ingesting non-lethal amounts of poisons and mixing many into a universal remedy to make him immune to all known poisons. After Mithridates' death, many Roman physicians claimed to possess and improve the formula. In keeping with most medical practices of his era, Mithridates' anti-poison routines included a religious component, supervised by the \"Agari\", a group of Scythian shamans who never left him.", "It has been suggested that Russian mystic Rasputin's survival of a poisoning attempt was due to mithridatism, but this has not been proven. Indian epics talk about this practice as well. It has been said that, during the rule of the king Chandragupta Maurya (320–298 BC), there was a practice of selecting beautiful girls and administering poison in small amounts until they grew up, thus making them insensitive to poison. These maidens were called \"vishakanyas\" (visha 'poison' + kanya 'maiden'). It was believed that making love with vishakanyas could result in the death of their partners, hence they were employed to kill enemies. The emperor Bindusara was the son of the first Mauryan emperor Chandragupta Maurya and his queen Durdhara. According to the \"Rajavalikatha\", a Jain work, the original name of this emperor was Simhasena. A legend mentioned in the Jain texts tells the story of how Chandragupta's Guru and advisor Chanakya used to feed the emperor with small doses of poison to build his immunity against possible poisoning attempts by his enemies. One day, Chandragupta, unaware that his food contained poison, shared his food with his pregnant wife, Queen Durdhara, who was seven days away from delivery. The queen, who was not immune to the poison, collapsed and died within a few minutes.", "Chanakya entered the room at the moment she collapsed, and in order to save the child in the womb, he immediately cut open the dead queen's belly and took the baby out. He was just in time; a drop of poison had already reached the baby and touched his head, leaving a permanent blueish spot (a \"bindu\") on his forehead. Thus, the newborn was named \"Bindusara\". In practice. Mithridatism is not effective against all types of poison. Immunity is generally only possible with biologically complex types which the immune system can respond to. Depending on the toxin, the practice can lead to the lethal accumulation of a poison in the body. Results depend on how each poison is processed by the body, i.e. on how the toxic compound is metabolized or passed out of the body. However, in some cases, it is possible to build up a metabolic tolerance against specific non-biological poisons. This involves conditioning the liver to produce more of the particular enzymes that metabolize these poisons. For example, heavy drinkers develop a tolerance to the effects of alcohol. However, metabolic tolerance can also lead to accumulation of the less toxic metabolized compound which can slowly damage the liver. With alcohol this generally leads to conditions such as alcoholic fatty liver disease. Metabolic tolerance is not effective on all types of non-biological poisons. Exposure to certain toxic substances, such as hydrofluoric acid and heavy metals, is either lethal or has little to no effect. A minor exception is cyanide, which can be metabolized by the liver.", "Brief work of literature, usually written in narrative prose\nA short story is a piece of prose fiction. It can typically be read in a single sitting and focuses on a self-contained incident or series of linked incidents, with the intent of evoking a single effect or mood. The short story is one of the oldest types of literature and has existed in the form of legends, mythic tales, folk tales, fairy tales, tall tales, fables, and anecdotes in various ancient communities around the world. The modern short story developed in the early 19th century. Definition. The short story is a crafted form in its own right. Short stories make use of plot, resonance and other dynamic components as in a novel, but typically to a lesser degree. While the short story is largely distinct from the novel or novella/short novel, authors generally draw from a common pool of literary techniques. The short story is sometimes referred to as a genre. Determining what exactly defines a short story remains problematic. A classic definition of a short story is that one should be able to read it in one sitting, a point most notably made in Edgar Allan Poe's essay \"The Philosophy of Composition\" (1846). H. G. Wells described the purpose of the short story as \"The jolly art, of making something very bright and moving; it may be horrible or pathetic or funny or profoundly illuminating, having only this essential, that it should take from fifteen to fifty minutes to read aloud.\"", "Venus Hum is an electronic pop music group from Nashville, Tennessee, consisting of vocalist Annette Strean and multi-instrumentalists Kip Kubin and Tony Miracle. Miracle has a rare heart condition which results in perpetually hearing his own heartbeat in his ears. This condition is known as \"venous hum\", from which the group's name is derived. Their first full-length album, titled \"Venus Hum\", was released in 2001. \"Big Beautiful Sky\" was released two years later. Also in 2003, Venus Hum toured with and opened for Blue Man Group, with Strean providing vocals on \"I Feel Love\". After their collaboration with J. J. Abrams (\"Alias\", \"Lost\", \"\"), and their subsequent creation of the EP \"Songs for Superheroes\", it was uncertain whether Venus Hum would release any new material. Strean had developed painful vocal fold nodules and needed a speech pathologist to relearn her singing ability. Kip diversified, furthering his interest in filmmaking, becoming a director of music videos, electronic press kits and special features. Tony traveled, living in Los Angeles and Cincinnati and releasing an experimental solo album under the moniker \"Satellite City\". After a two-year hiatus, the group reorganized and released a new album, \"The Colors in the Wheel\" on July 25, 2006, under the Mono-Fi Records label, which they described as \"unconventional, three-dimensional and completely five-sensual\" featuring an edgier sound than their previous work."], "distances": [34.02348353575931, 26.480522344818016, 23.032471696477526, 22.481549013857006, 21.9022390848828], "supports": [1, 0, 0, 0, 1], "metadatas": [{"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "doc_name": "Mithridatism", "support": 1, "pool_index": 95}, {"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "doc_name": "Mithridatism", "support": 0, "pool_index": 96}, {"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "doc_name": "Mithridatism", "support": 0, "pool_index": 97}, {"mapped_id": "0189c0a8-88a8-4785-a639-b0904cde3f2f", "doc_name": "Short story", "support": 0, "pool_index": 67}, {"mapped_id": "0078f48f-b72d-4b72-b386-cc4086c9e9ee", "doc_name": "Venus Hum", "support": 1, "pool_index": 245}], "recall": 1.0, "precision": 0.4, "ndcg": 0.8503449055347546, "mrr": 1.0}
{"query_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "documents": ["Treasure Fleet, sometimes billed as The Treasure Fleet, is a Chicago-based band featuring members of The Lawrence Arms, The Arrivals, and Smoking Popes. Originally formed in 2009 by Isaac Thotz and Neil Hennessy, the two added Dave Merriman and Mike Oberlin and played a few shows as a four piece before adding Eli Caterer as a lead guitarist. Their sound has been influenced by bands of the ‘60s and ‘70s. Treasure Fleet played The Fest in 2014 along with Paint It Black, The City on Film, and Iron Chic. The same year they played a four night stint with Alkaline Trio at Metro Chicago. They participated in Recess Records' 25th anniversary tour. Their debut album, \"Cocamotion\", was released in 2012. Their sophomore effort, \"Future Ways\", was released later the same year. In 2015, they released \"The Sun Machine\" on Recess Records. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Finding in his pocket, a key to a suite in the plush \"Pushpak\" hotel, the graduate kidnaps and imprisons the rich man in his room at Anand Bhavan, while he moves into the rich man's suite at Pushpak, and takes over his lifestyle. The rich man's wife has an extramarital affair with his friend, who hires a contract killer to kill the rich man without her knowledge. The killer stakes out the rich man's suite at Pushpak and mistakes the graduate as his target. The graduate discovers the same young woman in a suite opposite his balcony in the same hotel. She is the daughter of a magician performing at the hotel, and she slaps him after mistaking him for pulling a prank on her. They mend ways while paying tribute at the funeral of the hotel owner, and then they spend time together and develop a romantic relationship. Meanwhile, the killer tries to kill the graduate with ice daggers, but he fails in every attempt, with the graduate unaware of the threat to his life. Eventually, the graduate realises the killer is in the hotel to kill someone but does not know who. The killer intrudes into his suite, and barely survives getting electrocuted while trying to stab the graduate. The killer travels to the lover's bungalow to report his failure, and the graduate follows him and learns the truth. The rich man's wife learns of her lover's treachery and leaves him. In a montage shown about the hotel owner, the graduate realises that he was once a poor man similar to himself.", "He played the titular lead in the independent film \"Being Charlie\", a semi-autobiographical feature about director Rob Reiner's relationship with his son, which premiered at the 2015 Toronto International Film Festival; the film was released theatrically in 2016. In 2017, he starred in William H. Macy's comedy-drama film \"Krystal\", and as Olly in \"Everything, Everything\", a film adaptation of the novel of the same name. In 2018, Robinson starred as the titular Simon Spier in the gay coming out teen drama film \"Love, Simon\". The film was considered ground-breaking because it was the first major studio film to focus on a gay, teenage romance. Robinson's performance as Simon garnered critical acclaim. After reading the script, Robinson revealed that he broke his own rule to no longer play high schoolers because he saw the cultural importance of the film. That year, Robinson was named in \"Forbes\"' \"30 Under 30\" list in the Hollywood &amp; Entertainment category. In 2019, he co-starred in the third film version of Richard Wright's \"Native Son\". In 2020, Robinson co-starred in the FX miniseries \"A Teacher\", and he narrated his DM responses to the protagonist of \"Love, Victor\", a \"Love, Simon\" spinoff TV series on \"Hulu\", and appeared in two episodes of the show. In 2021, he starred in the Netflix miniseries \"Maid\", opposite Margaret Qualley and Andie MacDowell. References.", "Seeing what the hotel owner achieved by fair means, the graduate begins to question his actions. He sees the roadside beggar has died, and municipality workers arrive to take away the body. However, discovering the beggar's stash, they abandon his body and squabble over the money. The graduate decides to stop his deceit. He frees the rich man and explains the situation to him in a letter. The rich man and his wife reunite, and he stops drinking. The graduate decides to come clean to the magician's daughter too. He learns the magician's family is about to leave Pushpak. He confesses the truth to the magician's daughter, and to his surprise she forgives him. She writes down something on a paper and drops a rose wrapped in the paper from her car window as they depart Pushpak. The graduate picks up the rose, but the wind blows the paper into a gutter. Later, the graduate is shown standing in line again to apply for job vacancies. Cast. &lt;templatestyles src=\"Div col/styles.css\"/&gt;* Kamal Haasan as the unemployed graduate\nProduction. Development. Singeetam Srinivasa Rao was assisting director K. V. Reddy in a film where there was a scene requiring a character to emote fear without dialogues. Rao wondered if he could make an entire film that way for a long time, but did not have an idea for the story.", "Because of the 2007–2008 Writers Guild of America strike, Robinson's family moved back to Washington where he continued to perform on stage in and around Seattle. In 2010, Robinson was cast in the role of Ryder Scanlon, the nephew of Melissa Joan Hart's character, on the ABC Family sitcom \"Melissa &amp; Joey,\" playing the character until its cancellation in 2015. In 2011, while on hiatus from \"Melissa &amp; Joey\", Robinson began filming of the Disney Channel original movie \"Frenemies\"; Robinson played the role of Jake Logan. \"Frenemies\" premiered in January 2012, on the Disney Channel. In 2012, Robinson was cast in the lead role of Joe Toy in director Jordan Vogt-Roberts' \"The Kings of Summer\". He also guest-starred in the episode \"Blue Bell Boy,\" during the third season of HBO's \"Boardwalk Empire\". He also began appearing in a series of television commercials for Cox Communications entitled \"Buffer Time is Bonding Time.\" In 2015, Robinson portrayed Zach Mitchell in \"Jurassic World\", in which he was widely seen. He played Ben Parish in the film adaptation of the novel \"The 5th Wave\", which was released in January 2016. These roles made him unavailable for multiple episodes of the final season of \"Melissa &amp; Joey\", but he returned for the final three episodes."], "distances": [15.776261546389202, 15.077921007388529, 15.06801651933997, 14.783734156207817, 14.760593875010061], "supports": [0, 0, 0, 0, 0], "metadatas": [{"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "Treasure Fleet", "support": 0, "pool_index": 189}, {"mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "doc_name": "Pushpaka Vimana (1987 film)", "support": 0, "pool_index": 152}, {"mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc", "doc_name": "Nick Robinson (American actor)", "support": 0, "pool_index": 204}, {"mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "doc_name": "Pushpaka Vimana (1987 film)", "support": 0, "pool_index": 153}, {"mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc", "doc_name": "Nick Robinson (American actor)", "support": 0, "pool_index": 203}], "recall": 0.0, "precision": 0.0, "ndcg": 0.0, "mrr": 0.0}
