{"query_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "documents": ["Fictional character from EastEnders\nBen Mitchell is a fictional character from the BBC soap opera \"EastEnders\", who has been played by six different actors since his on-screen birth on 21 March 1996. Matthew Silver appeared as an infant Ben between 1996 and 1998, and Morgan Whittle played him as a toddler between 1999 and 2001. After a five-year absence from the series, Charlie Jones assumed the role of Ben in 2006. In 2010, the character was recast with Joshua Pascoe in the role, who made his first appearance on 13 December 2010. Pascoe quit the role in 2012 and Ben departed on 24 August 2012. Ben's return was announced in May 2014 with Harry Reid in the role; Ben returned on 22 September 2014. Reid was written out of the series in 2017 and Ben departed on 12 January 2018. Ben was reintroduced in 2019 with the role recast to Max Bowden. Ben returned on 1 April 2019. In December 2023, it was announced Bowden would exit the role. Ben departed the series on 28 March 2024, after being extradited to America for credit card fraud.", "However, the storyline where Ben was abused by Stella won \"Best Storyline\" at the 2007 \"Inside Soap\" Awards, and was nominated for the \"Best Soap Storyline\" accolade at the \"TV Quick\" and \"TV Choice\" Awards. In 2012, Pascoe was nominated \"Villain of the Year\", but lost out to Andrew Lancel (\"Coronation Street\"). Lisa O'Connell, also writing for \"The Guardian\", was complimentary of Ben's later, protracted coming out storyline, which she called \"a perfect foundation for years of dramatic conflict\". Storylines. 1996–2012. Ben is born to Phil Mitchell (Steve McFadden) and his then wife Kathy Beale (Gillian Taylforth) in March 1996. Ben becomes ill and is rushed to hospital, where he is diagnosed with meningitis and he is left partially deaf in one ear. As Kathy gives Ben all her affection, Phil turns to alcohol and has an affair with Lorna Cartwright (Janet Dibley), resulting in the breakdown of their marriage. In 1998, Kathy moves to South Africa and takes Ben with her. He accompanies her on two return visits in 1999 before returning with her to South Africa in early 2000. In 2001, Kathy marries a man named Gavin Sullivan (then an unseen character; later played by Paul Nicholas). The same year, Ben briefly returns to stay with Phil who then takes him back to South Africa.", "Louise blames Jordan Johnson (Michael-Joel David Stuart), an acquaintance of Ben's, but when Phil sees burn marks on Louise's arm, she reveals that Ben is to blame. Phil worries Ben is copying Stella, and punches him when he catches Ben about to burn Louise again. Questioned as to why he hurt Louise, Ben claims that Jordan is bullying him. Phil advises Ben to fight back; soon after, Ben attacks Jordan with a spanner, leaving him with a fractured skull. Phil warns him against admitting to the attack, but Ben confesses and moves in with Ian. After hearing from Crown Court Ben could spend time in juvenile detention, Phil plans to send him to live with his brother Grant Mitchell (Ross Kemp) abroad, but Ben refuses thanks to his grandmother, Peggy Mitchell (Barbara Windsor), making him change his mind, after Phil's girlfriend Shirley Carter (Linda Henry) overhears Phil discussing the plans to Ben and receives a five-month sentence as a result. In July 2010, Phil indeed blames Peggy for Ben's sentencing. Ben tells Peggy and Phil he is coping despite being bullied by Cal Childs (Danny Barnham), and when the Mitchell family discovers this Ben asks them not to visit him. Ben, (now played by Joshua Pascoe) is released, and arrives home to discover Jay Brown (Jamie Borthwick), the foster child of Phil's relative Billy (Perry Fenwick), has usurped his place in Phil's affections. Ben is jealous of Jay initially but does develop a 'brotherly' relationship with him.", "In 2006, the residents hear that Kathy and Gavin have been killed in a car accident, so Ben (now played by Charlie Jones) returns to England to live with his half-brother, Ian Beale (Adam Woodyatt). He eventually moves in with Phil, after Phil wins a long custody battle. Ben dislikes Phil's new girlfriend Stella Crawford (Sophie Thompson), who in turn feels that Ben is intruding on their relationship. She abuses Ben physically and psychologically, from burning him with a hot spoon, also attempting to spoil his friendship with Abi Branning (Lorna Fitzgerald) when she discovers this, to threatening to kill Phil if Ben tells anyone about her actions. Phil and Stella become engaged. On their wedding day in July 2007, Ben admits that Stella has been abusing him; she commits suicide by jumping from a roof. Phil, a recovering alcoholic, begins drinking again in the aftermath, but resumes a life of sobriety for Ben's sake. Unbeknown to Phil, Ben develops an interest in dancing. He secretly takes classes, passing a dance exam, and is ultimately able to gain Phil's approval. In March 2010, Phil's daughter Louise Mitchell (Brittany Papple) comes to stay with the Mitchell family. She steals Ben's diary and fakes an entry which suggests he is gay. In retaliation, Ben burns Louise's hand the same way Stella burnt his. He later locks Louise in a summerhouse for a day in May 2010, then pretends to find her to earn approval from his father.", "Ben's storylines include: a feud between the show's Mitchell and Beale families for his custody; developing a love of dance and the arts, which is a source of tension between him and his father, Phil Mitchell (Steve McFadden); being physically and mentally abused by Phil's girlfriend Stella Crawford (Sophie Thompson); struggling to come to terms with his homosexuality and then attempting to hide it before coming out; being imprisoned for manslaughter after unintentionally killing Heather Trott (Cheryl Fergison); having a daughter, Lexi Pearce, with Lola Pearce (Danielle Harold), finding out his mother Kathy Beale (Gillian Taylforth) is still alive after faking her own death, relationships with Paul Coker (Jonny Labey) and the closeted Callum Highway (Tony Clay), coming to terms with Paul's death in a homophobic attack, being shot by Hunter Owen (Charlie Winter), blackmailing Martin Fowler (James Bye), losing his hearing after sustaining an injury during a boat crash, going into crime with Danny Hardcastle (Paul Usher), featuring in a male rape storyline, in which Ben is raped by Lewis Butler (Aidan O'Callaghan), and suffering from bulimia. As played by Jones, Ben received generally poor reviews from critics. Grace Dent of \"The Guardian\" wrote several negative opinion pieces on the character, and contacted the BBC with a list of suggestions for humorous storylines in which he could be killed off.", "Chanakya entered the room at the moment she collapsed, and in order to save the child in the womb, he immediately cut open the dead queen's belly and took the baby out. He was just in time; a drop of poison had already reached the baby and touched his head, leaving a permanent blueish spot (a \"bindu\") on his forehead. Thus, the newborn was named \"Bindusara\". In practice. Mithridatism is not effective against all types of poison. Immunity is generally only possible with biologically complex types which the immune system can respond to. Depending on the toxin, the practice can lead to the lethal accumulation of a poison in the body. Results depend on how each poison is processed by the body, i.e. on how the toxic compound is metabolized or passed out of the body. However, in some cases, it is possible to build up a metabolic tolerance against specific non-biological poisons. This involves conditioning the liver to produce more of the particular enzymes that metabolize these poisons. For example, heavy drinkers develop a tolerance to the effects of alcohol. However, metabolic tolerance can also lead to accumulation of the less toxic metabolized compound which can slowly damage the liver. With alcohol this generally leads to conditions such as alcoholic fatty liver disease. Metabolic tolerance is not effective on all types of non-biological poisons. Exposure to certain toxic substances, such as hydrofluoric acid and heavy metals, is either lethal or has little to no effect. A minor exception is cyanide, which can be metabolized by the liver.", "1915 film\nBaby is a 1915 American silent comedy film featuring Oliver Hardy.", "According to William Faulkner, a short story is character-driven and a writer's job is to \"...trot along behind him with a paper and pencil trying to keep up long enough to put down what he says and does.\" Some authors have argued that a short story must have a strict form. Somerset Maugham thought that the short story \"must have a definite design, which includes a point of departure, a climax and a point of test; in other words, it must have a plot\". Hugh Walpole had a similar view: \"A story should be a story; a record of things happening full of incidents, swift movements, unexpected development, leading through suspense to a climax and a satisfying denouement.\" This view of the short story as a finished product of art is however opposed by Anton Chekhov, who thought that a story should have neither a beginning nor an end. It should just be a \"slice of life\", presented suggestively. In his stories, Chekhov does not round off the end but leaves it to the readers to draw their own conclusions. Sukumar Azhikode defined a short story as \"a brief prose narrative with an intense episodic or anecdotal effect\". Flannery O'Connor emphasized the need to consider what is exactly meant by the descriptor short. Short story writers may define their works as part of the artistic and personal expression of the form. They may also attempt to resist categorization by genre and fixed formation.", "&lt;templatestyles src=\"Div col/styles.css\"/&gt;\nOther cast members include Adam Godley as Mr. Teavee and Franziska Troegner as Mrs. Gloop. The other four Golden Ticket winners, Violet Beauregarde, Veruca Salt, Mike Teavee, and Augustus Gloop, are portrayed by AnnaSophia Robb, Julia Winter, Jordan Fry, and Philip Wiegratz, respectively. Blair Dunlop plays young Willy Wonka. Charlie's remaining grandparents, Grandma Georgina, Grandma Josephine, and Grandpa George, are portrayed by Liz Smith, Eileen Essell, and David Morris. Nitin Ganatra and Shelley Conn appear as Prince and Princess Pondicherry. Geoffrey Holder narrates the film. Production. Development. Author Roald Dahl disapproved of the 1971 film adaptation. Warner Bros. Pictures and Brillstein-Grey Entertainment entered into discussions with the Dahl estate in 1991, hoping to purchase the rights to produce another film version of \"Charlie and the Chocolate Factory\". The purchase was finalized in 1998, with Dahl's widow, Felicity (\"Liccy\"), and daughter, Lucy, receiving total artistic control and final privilege on the choices of actors, directors and writers. The Dahl estate's subsequent protection of the source material was the main reason that \"Charlie and the Chocolate Factory\" had languished in development hell since the 1990s.", "Upon returning to Oakdale, Betsy is ready to leave Craig but loses her nerve when he plans a romantic evening for her. Torn between her love for Steve and her commitment to Craig, Betsy makes love to Craig. When Betsy later becomes pregnant, she's convinced the child is Craig's and decides to commit herself to the marriage. Steve is left heartbroken over this decision, with Craig continuously hinting that Steve and Diana McColl seem to be an item now. Soon after, Steve is wanted for the theft of Whit McColl's gold coins. Later, Betsy finds a wounded Steve in the back seat. Despite knowing that he is wanted by the police, she takes him to the boathouse and tends to his wounds. Betsy enlists Steve's friend, Tucker Foster, to help them find out who framed Steve. Then Betsy's grandfather, David, catches Betsy sneaking into the supply room at Memorial Hospital to get medicine for Steve. David discovers that Steve is suffering from blood poisoning and gangrene and will die unless he gets treatment. With Betsy's help, David operates on Steve right there in the boathouse. Meanwhile, one of Whit's rare coins has been bought by Bobbi Maxwell and her boyfriend, Lonnie. They trace Tucker from the pawnshop and call him for a meeting. Betsy and Steve join the \"coin hunt\" and arrive for the meeting to try to buy back the coin. Craig is relieved, because now he could spend more time with Diana."], "distances": [0.06451612903225806, 0.06066176470588235, 0.05982142857142857, 0.059714795008912656, 0.05808080808080808, 0.04449760765550239, 0.042222222222222223, 0.02857142857142857, 0.027777777777777776, 0.02702702702702703], "supports": [0, 0, 0, 0, 1, 0, 0, 0, 1, 0], "metadatas": [{"support": 0, "pool_index": 160, "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "doc_name": "Ben Mitchell (EastEnders)"}, {"pool_index": 162, "support": 0, "doc_name": "Ben Mitchell (EastEnders)", "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f"}, {"doc_name": "Ben Mitchell (EastEnders)", "support": 0, "pool_index": 164, "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f"}, {"support": 0, "doc_name": "Ben Mitchell (EastEnders)", "pool_index": 163, "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f"}, {"mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "pool_index": 161, "doc_name": "Ben Mitchell (EastEnders)", "support": 1}, {"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "doc_name": "Mithridatism", "pool_index": 97, "support": 0}, {"pool_index": 19, "support": 0, "doc_name": "Baby (1915 film)", "mapped_id": "0085a069-c8c1-4a78-9074-0f17d2073f9c"}, {"mapped_id": "0189c0a8-88a8-4785-a639-b0904cde3f2f", "doc_name": "Short story", "support": 0, "pool_index": 68}, {"doc_name": "Charlie and the Chocolate Factory (film)", "support": 1, "pool_index": 124, "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59"}, {"pool_index": 236, "doc_name": "Steve Andropoulos and Betsy Stewart", "mapped_id": "0177bf17-6a23-45b0-a27d-1cd9acc1290c", "support": 0}], "recall": 1.0, "precision": 0.2, "ndcg": 0.42177340954886444, "mrr": 0.2}
{"query_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "documents": ["Wonka's Chocolate Room was constructed on the 007 Stage at Pinewood, complete with a faux chocolate waterfall and river. Squirrels were trained from birth for Veruca Salt's elimination. Actor Deep Roy performed each Oompa-Loompa individually rather than one performance duplicated digitally. Burton shot the film simultaneously alongside the stop-motion animated film \"Corpse Bride\", which he also directed. Willy Wonka-themed chocolate bars were sold, and a Golden Ticket contest was launched as part of the film's marketing campaign. Early plans to promote the film with a Broadway theatre musical were not realized. \"Charlie and the Chocolate Factory\" premiered on July 10, 2005, and was released in the United States on July 15 to positive critical reviews, who commended it for its visual appeal and dark tone. It was also a box office success, grossing US$475 million and becoming the eighth-highest-grossing film worldwide in 2005. The film received a nomination for Best Costume Design at the 78th Academy Awards, while Depp was nominated for the Golden Globe Award for Best Actor – Musical or Comedy. It remains Tim Burton's second-highest-grossing film to date. &lt;templatestyles src=\"Template:TOC limit/styles.css\" /&gt;\nPlot. Charlie Bucket is a kind and loving boy who lives in poverty with his family near the Wonka Factory.", "&lt;templatestyles src=\"Div col/styles.css\"/&gt;\nOther cast members include Adam Godley as Mr. Teavee and Franziska Troegner as Mrs. Gloop. The other four Golden Ticket winners, Violet Beauregarde, Veruca Salt, Mike Teavee, and Augustus Gloop, are portrayed by AnnaSophia Robb, Julia Winter, Jordan Fry, and Philip Wiegratz, respectively. Blair Dunlop plays young Willy Wonka. Charlie's remaining grandparents, Grandma Georgina, Grandma Josephine, and Grandpa George, are portrayed by Liz Smith, Eileen Essell, and David Morris. Nitin Ganatra and Shelley Conn appear as Prince and Princess Pondicherry. Geoffrey Holder narrates the film. Production. Development. Author Roald Dahl disapproved of the 1971 film adaptation. Warner Bros. Pictures and Brillstein-Grey Entertainment entered into discussions with the Dahl estate in 1991, hoping to purchase the rights to produce another film version of \"Charlie and the Chocolate Factory\". The purchase was finalized in 1998, with Dahl's widow, Felicity (\"Liccy\"), and daughter, Lucy, receiving total artistic control and final privilege on the choices of actors, directors and writers. The Dahl estate's subsequent protection of the source material was the main reason that \"Charlie and the Chocolate Factory\" had languished in development hell since the 1990s.", "2005 film by Tim Burton\nCharlie and the Chocolate Factory is a 2005 musical fantasy film directed by Tim Burton and written by John August, based on the 1964 British novel of the same name by Roald Dahl. The film stars Johnny Depp as Willy Wonka and Freddie Highmore as Charlie Bucket, alongside David Kelly, Helena Bonham Carter, Noah Taylor, Missi Pyle, James Fox, Deep Roy, and Christopher Lee. The storyline follows Charlie as he wins a contest along with four other children and is led by Wonka on a tour of his chocolate factory. Development for a second adaptation of \"Charlie and the Chocolate Factory\" began in 1991, which resulted in Warner Bros. providing the Dahl estate with total artistic control. Prior to Burton's involvement, directors such as Gary Ross, Rob Minkoff, Martin Scorsese, and Tom Shadyac had been involved, while actors Bill Murray, Nicolas Cage, Jim Carrey, Michael Keaton, Brad Pitt, Will Smith, Adam Sandler, and many others, were either in discussion with or considered by the studio to play Wonka. Burton immediately brought regular collaborators Depp and Danny Elfman aboard. \"Charlie and the Chocolate Factory\" represents the first musical film directed by Burton and the first time since \"The Nightmare Before Christmas\" that Elfman contributed to a film score using written songs and his vocals. Filming took place from June to December 2004 at Pinewood Studios in the United Kingdom. Rather than using computer-generated environments, Burton primarily used built sets and practical effects, which he claimed was inspired by the book's emphasis on texture.", "The company's owner, Willy Wonka, has long closed his factory to the public due to problems concerning industrial espionage, which also caused all his employees, including Charlie's Grandpa Joe, to lose their jobs. Charlie's father, meanwhile, has more recently been laid off from his own job at a toothpaste factory, although he does not admit this to Charlie. One day, Wonka announces a contest in which Golden Tickets have been placed in five random Wonka Bars worldwide, and the winners will receive a full tour of the factory as well as a lifetime supply of chocolate, while one will receive an additional prize at the end of the tour. Wonka's sales subsequently skyrocket, and the first four tickets are found by the gluttonous Augustus Gloop, the spoiled Veruca Salt, the arrogant Violet Beauregarde, and the ill-tempered Mike Teavee. Charlie tries twice to find a ticket, but both bars come up empty. After overhearing that the final ticket was found in Russia, Charlie finds a banknote and purchases a third Wonka Bar. The Russian ticket is revealed to be a forgery just as Charlie discovers the real ticket inside the wrapper. He receives monetary offers for the ticket, but the cashier warns him not to trade it regardless, and Charlie runs back home. At home, Charlie initially wants to trade the ticket for money for his family's betterment, but after a pep talk from Grandpa George, he decides to keep it, and brings Grandpa Joe to accompany him on the tour.", "Charlie and the other ticket holders are greeted outside the factory by Wonka, who then leads them into the facility. Individual character flaws cause the other four children to give in to temptation, resulting in their elimination from the tour while Wonka's new employees, the Oompa-Loompas, sing a song of morality after each. Meanwhile, Wonka reminisces on his troubled past and how his dentist father, Wilbur, strictly forbade him from consuming any candy. After sneaking a piece of candy, Wonka instantly became hooked and ran away from home to follow his dreams. When he returned, however, both his father and their house were gone. After the tour, the four eliminated children leave the factory with an exaggerated characteristic or deformity related to their elimination, while Charlie learns that Wonka, now approaching retirement, intended to find a worthy heir. Since Charlie was the least ill-behaved of the five, Wonka invites Charlie to come live and work in the factory with him, provided that he leave his family behind. Charlie declines, as his family is the most important thing in his life. As Charlie and his family's life improve, Wonka becomes despondent, causing his company and sales to decline. He eventually turns to Charlie for advice, and he decides to help Wonka reconcile with his estranged father, Wilbur. During the reunion, Charlie notices newspaper clippings of Wonka's success which Wilbur collected, while Wonka realizes the value of family as he and Wilbur finally reconcile. Afterwards, Wonka allows Charlie and his family to move into the factory together. Cast.", "English actor born 1986\nNicholas \"Nick\" Robinson is an English actor who has appeared regularly on British television, most famously as William Beech in \"Goodnight Mister Tom\", starring John Thaw. He also played the lead in the television series \"Harry and the Wrinklies\" based upon the book of the same name by Alan Temperley, produced by Scottish Television. Career. He began his career in theatre and, at the age of 7, appeared in the West End transfer of An Inspector Calls, produced by the National Theatre, at the Aldwych Theatre. His next appearance was in Theatre De Complicite's production of \"The Caucasian Chalk Circle\" in the Olivier Theatre and on its national tour. He later played the title role in the Royal Shakespeare Company's production of \"Little Eyolf\", directed by Adrian Noble. Robinson was most famous for his role in \"Goodnight Mister Tom\". This won the awards of the Bafta for the Most Popular TV programme in 1998 voted for by readers of the Radio Times, Best Drama performance in 1999 and the Best ITV/Channel 5 Programme of 1998. He has made a few other television programmes including an episode of \"Midsomer Murders\" and he was also in the film version of \"Tom's Midnight Garden\". Other appearances include \"Ruth Rendell Mysteries, Urban Gothic\" and \"Down to Earth\". Robinson also works extensively as a producer; most recently he presented the UK premiere production of Rodgers and Hammerstein's State Fair directed by Thom Southerland, at the Trafalgar Studios in London's West End.", "His production company is WingNut Films, and his most regular collaborators are co-writers and producers Walsh and Philippa Boyens. Jackson was made a Companion of the New Zealand Order of Merit in 2002. He was later knighted (as a Knight Companion of the order) by Sir Anand Satyanand, the Governor-General of New Zealand, at a ceremony in Wellington in April 2010. In December 2014, Jackson was awarded a star on the Hollywood Walk of Fame. Early life. Jackson was born on 31 October 1961 in Wellington\nand was raised in its far northern suburb of Pukerua Bay. His parents – Joan (\"née\" Ruck),(p20) a factory worker and housewife, and William \"Bill\" Jackson, a wages clerk – were immigrants from England. As a child, Jackson was a keen film fan, growing up on Ray Harryhausen films, as well as finding inspiration in the television series \"Thunderbirds\" and \"Monty Python's Flying Circus\". After a family friend gave the Jacksons a Super 8 cine-camera with Peter in mind, he began making short films with his friends. Jackson has long cited \"King Kong\" as his favourite film, and around the age of nine he attempted to remake it using his own stop-motion models. Also, as a child Jackson made a World War II epic called \"The Dwarf Patrol\" seen on the \"Bad Taste\" bonus disc, which featured his first special effect of poking pinholes in the film for gun shots, and a James Bond spoof named \"Coldfinger\".", "He played the titular lead in the independent film \"Being Charlie\", a semi-autobiographical feature about director Rob Reiner's relationship with his son, which premiered at the 2015 Toronto International Film Festival; the film was released theatrically in 2016. In 2017, he starred in William H. Macy's comedy-drama film \"Krystal\", and as Olly in \"Everything, Everything\", a film adaptation of the novel of the same name. In 2018, Robinson starred as the titular Simon Spier in the gay coming out teen drama film \"Love, Simon\". The film was considered ground-breaking because it was the first major studio film to focus on a gay, teenage romance. Robinson's performance as Simon garnered critical acclaim. After reading the script, Robinson revealed that he broke his own rule to no longer play high schoolers because he saw the cultural importance of the film. That year, Robinson was named in \"Forbes\"' \"30 Under 30\" list in the Hollywood &amp; Entertainment category. In 2019, he co-starred in the third film version of Richard Wright's \"Native Son\". In 2020, Robinson co-starred in the FX miniseries \"A Teacher\", and he narrated his DM responses to the protagonist of \"Love, Victor\", a \"Love, Simon\" spinoff TV series on \"Hulu\", and appeared in two episodes of the show. In 2021, he starred in the Netflix miniseries \"Maid\", opposite Margaret Qualley and Andie MacDowell. References.", "Because of the 2007–2008 Writers Guild of America strike, Robinson's family moved back to Washington where he continued to perform on stage in and around Seattle. In 2010, Robinson was cast in the role of Ryder Scanlon, the nephew of Melissa Joan Hart's character, on the ABC Family sitcom \"Melissa &amp; Joey,\" playing the character until its cancellation in 2015. In 2011, while on hiatus from \"Melissa &amp; Joey\", Robinson began filming of the Disney Channel original movie \"Frenemies\"; Robinson played the role of Jake Logan. \"Frenemies\" premiered in January 2012, on the Disney Channel. In 2012, Robinson was cast in the lead role of Joe Toy in director Jordan Vogt-Roberts' \"The Kings of Summer\". He also guest-starred in the episode \"Blue Bell Boy,\" during the third season of HBO's \"Boardwalk Empire\". He also began appearing in a series of television commercials for Cox Communications entitled \"Buffer Time is Bonding Time.\" In 2015, Robinson portrayed Zach Mitchell in \"Jurassic World\", in which he was widely seen. He played Ben Parish in the film adaptation of the novel \"The 5th Wave\", which was released in January 2016. These roles made him unavailable for multiple episodes of the final season of \"Melissa &amp; Joey\", but he returned for the final three episodes.", "In 2006, the residents hear that Kathy and Gavin have been killed in a car accident, so Ben (now played by Charlie Jones) returns to England to live with his half-brother, Ian Beale (Adam Woodyatt). He eventually moves in with Phil, after Phil wins a long custody battle. Ben dislikes Phil's new girlfriend Stella Crawford (Sophie Thompson), who in turn feels that Ben is intruding on their relationship. She abuses Ben physically and psychologically, from burning him with a hot spoon, also attempting to spoil his friendship with Abi Branning (Lorna Fitzgerald) when she discovers this, to threatening to kill Phil if Ben tells anyone about her actions. Phil and Stella become engaged. On their wedding day in July 2007, Ben admits that Stella has been abusing him; she commits suicide by jumping from a roof. Phil, a recovering alcoholic, begins drinking again in the aftermath, but resumes a life of sobriety for Ben's sake. Unbeknown to Phil, Ben develops an interest in dancing. He secretly takes classes, passing a dance exam, and is ultimately able to gain Phil's approval. In March 2010, Phil's daughter Louise Mitchell (Brittany Papple) comes to stay with the Mitchell family. She steals Ben's diary and fakes an entry which suggests he is gay. In retaliation, Ben burns Louise's hand the same way Stella burnt his. He later locks Louise in a summerhouse for a day in May 2010, then pretends to find her to earn approval from his father."], "distances": [0.06350806451612903, 0.06256109481915934, 0.061553030303030304, 0.058823529411764705, 0.05714285714285714, 0.04878048780487805, 0.04494949494949495, 0.04145299145299146, 0.04001600640256102, 0.027777777777777776], "supports": [0, 1, 0, 0, 0, 1, 0, 0, 0, 0], "metadatas": [{"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "pool_index": 121, "doc_name": "Charlie and the Chocolate Factory (film)", "support": 0}, {"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "pool_index": 124, "support": 1, "doc_name": "Charlie and the Chocolate Factory (film)"}, {"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 0, "pool_index": 120}, {"doc_name": "Charlie and the Chocolate Factory (film)", "pool_index": 122, "support": 0, "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59"}, {"support": 0, "doc_name": "Charlie and the Chocolate Factory (film)", "pool_index": 123, "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59"}, {"pool_index": 200, "doc_name": "Nick Robinson (English actor)", "support": 1, "mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc"}, {"doc_name": "Peter Jackson", "mapped_id": "007dc247-272e-475c-96c2-5479c1df1d95", "pool_index": 221, "support": 0}, {"support": 0, "mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc", "doc_name": "Nick Robinson (American actor)", "pool_index": 204}, {"support": 0, "doc_name": "Nick Robinson (American actor)", "pool_index": 203, "mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc"}, {"support": 0, "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "doc_name": "Ben Mitchell (EastEnders)", "pool_index": 163}], "recall": 1.0, "precision": 0.2, "ndcg": 0.6052602440527057, "mrr": 0.5}
{"query_id": "00367852-4217-48b1-9313-2c21ea592610", "documents": ["Spanish treasure fleet\nThe 1715 Treasure Fleet was actually a combination of two Spanish treasure fleets returning from the New World to Spain, the \"Nueva España Fleet\", under Capt.-General Don Juan Esteban de Ubilla, and the \"Tierra Firme Fleet\", under Don Antonio de Echeverz y Zubiza. At two in the morning on Wednesday, July 31, 1715, seven days after departing from Havana, Cuba, all eleven ships of the fleet were lost in a hurricane along the east coast of Florida. A 12th ship, the French frigate \"Le Grifon\", had sailed with the fleet. Its captain was unfamiliar with the Florida coastline and elected to stay further out to sea. The \"Grifon\" safely returned to Europe. Because the fleet was carrying silver, it is also known as the 1715 Plate Fleet (\"plata\" being the Spanish word for silver). Some artifacts and even coins still wash up on Florida beaches from time to time. According to Cuban records, around 1,500 sailors perished while a small number survived in lifeboats. Many ships, including pirates, took part in the initial salvage. Initially a privateer, Henry Jennings was first accused of piracy for attacking such salvage ships and claiming their salvages. Exhibits and preserves. Treasure hunter Kip Wagner's team built an exhibit held at National Geographic \"Explorers Hall\" in Washington, D.C. that was featured in the January 1965 issue of \"National Geographic\". This was the beginning of a fine collection of 1715 plate fleet treasure that brought hundreds of visitors from around the world.", "Wagner published his book \"Pieces of Eight\" (Recovering The Riches Of A Lost Spanish Fleet) in 1966. This is a detailed account of the finding and exploration of many of these shipwrecks along the Florida \"Treasure Coast.\" An exhibit was set up with a grand opening on May 1, 1967, at the First National Bank of Satellite Beach, Florida. In 1987, another ship in the fleet, the \"Urca de Lima\", became the first shipwreck in the Florida Underwater Archaeological Preserves. Mel Fisher's company, Mel Fisher's Treasures, sold the rights to the 1715 Fleet shipwreck to Queens Jewels, LLC. In 2015, 1715 Fleet - Queens Jewels, LLC and their founder Brent Brisben discovered $4.5 million in gold coins off the coast of Vero Beach, Florida; the coins come from the 1715 Fleet shipwreck site known as the Corrigans wreck. List of identified ships. New evidence (see Jorge Proctor, 2021) shows that the Douglass Beach Wreck, long believed to be the \"Nuestra Señora de las Nieves\", is in fact the \"Santa Rita y Las Animas\", bought by Ubilla in Cuba and renamed \"Nuestra Señora de Regla\", like his flagship. In popular culture. In the 2008 movie \"Fool's Gold\", the protagonists are searching for the location of one of the sunken ships of the treasure fleet (along with its treasure). The treasure fleet was used as the backdrop for a scene in the video game \"\".", "St. David's Lighthouse keeper and treasure-hunter Romer Treece (Robert Shaw), believes the medallion had come from the wreckage of the surviving twelfth ship [of the 1715 Treasure Fleet], thought to be a French tobacco ship that was being protected by the 1715 fleet and named \"Grifon\" (spelt \"El Grifón\" in Peter Benchley's novel \"The Deep\"). The ship was thought to be returning to Havana, Cuba for repairs but instead sank off the coast of Bermuda.\" The plot of the Starz show \"Black Sails\" revolves heavily around the 1715 Treasure Fleet in its first season. The largest of the ships, the \"Urca de Lima\", is wrecked during the hurricane off the coast of Florida, carrying five million Spanish dollars' worth in gold, silver and other precious materials, pursued by Captain Flint and his crew. The treasure, colloquially referred to as \"the Urca gold\", is an important plot device throughout the series. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Literary trope\nBuried treasure is a literary trope commonly associated with depictions of pirates, alongside Vikings, criminals, and Old West outlaws. According to popular conception, these people often buried their stolen fortunes in remote places, intending to return to them later (often with the use of a pirate’s treasure map). Pirates burying treasure was a rare occurrence, with the only known instance being William Kidd, who buried some of his wealth on Gardiners Island. The myth of buried pirate treasure was popularized by such 19th-century fiction as \"Wolfert Webber\", \"The Gold-Bug\", and \"Treasure Island\". The idea of treasure maps leading to buried treasure is considered a fictional device. There are cases of buried treasure from different historical periods, such as the Dacian king Decebalus and Visigoth king Alaric I, who both changed the course of rivers to hide their treasures. Legends of buried pirate treasure have existed for centuries, but authenticated discoveries are rare. For example, extensive excavations on Oak Island, Nova Scotia have not yielded any treasure. The only authenticated treasure chest in the United States is kept at the Pirate Soul Museum in St. Augustine, Florida. Buried treasure is a cultural concept and not the same as a hoard, which is typically found by archaeologists and metal detectors. The Fenn treasure, reportedly buried by millionaire Forrest Fenn in 2010, was found in 2020 in Wyoming. Pirates. Pirates burying treasure was rare.", "The main character, Edward Kenway, is aboard one of the ships in the fleet as a prisoner, and manages to escape with the help of his future quartermaster, Adéwalé, recruiting other captive pirates as a crew. The pirates eventually manage to escape the fleet and the hurricane by stealing the twelfth ship, the brig \"El Dorado\", which Edward keeps and renames the \"Jackdaw\", becoming the player's ship for the rest of the game. Edward later makes reference to the event when Blackbeard inquires as to how he got the Jackdaw, and the latter then suggests visiting the site to salvage some of the lost treasure. In the 1977 movie \"The Deep\" \"David Sanders (Nick Nolte) and his British girlfriend Gail Berke (Jacqueline Bisset) recover a number of artifacts (from a diving expedition off the coast of Bermuda, homeland of Captain Henry Jennings), including an ampule of amber-colored liquid and a medallion bearing the image of a woman and the letters 'S.C.O.P.N' (an abbreviation of the Latin 'Santa Clara Ora Pro Nobis' that translates to English as 'Saint Clara Pray For Us') and a date, 1714.", "Treasure Fleet, sometimes billed as The Treasure Fleet, is a Chicago-based band featuring members of The Lawrence Arms, The Arrivals, and Smoking Popes. Originally formed in 2009 by Isaac Thotz and Neil Hennessy, the two added Dave Merriman and Mike Oberlin and played a few shows as a four piece before adding Eli Caterer as a lead guitarist. Their sound has been influenced by bands of the ‘60s and ‘70s. Treasure Fleet played The Fest in 2014 along with Paint It Black, The City on Film, and Iron Chic. The same year they played a four night stint with Alkaline Trio at Metro Chicago. They participated in Recess Records' 25th anniversary tour. Their debut album, \"Cocamotion\", was released in 2012. Their sophomore effort, \"Future Ways\", was released later the same year. In 2015, they released \"The Sun Machine\" on Recess Records. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "The only pirate known to have actually buried treasure was William Kidd, who is believed to have buried at least some of his wealth on Gardiners Island near Long Island before sailing into New York City. Kidd had originally been commissioned as a privateer for England, but his behavior had strayed into outright piracy, and he hoped that his treasure could serve as a bargaining chip in negotiations to avoid punishment. His bid was unsuccessful, however, and Kidd was hanged as a pirate. In English fiction, there are three well-known stories that helped to popularize the myth of buried pirate treasure: \"Wolfert Webber\" (1824) by Washington Irving, \"The Gold-Bug\" (1843) by Edgar Allan Poe and \"Treasure Island\" (1883) by Robert Louis Stevenson. These stories differ widely in plot and literary treatment but are all based on the William Kidd legend. David Cordingly states that \"The effect of \"Treasure Island\" on our perception of pirates cannot be overestimated,\" and says the idea of treasure maps leading to buried treasure \"is an entirely fictional device\". Stevenson's \"Treasure Island\" was directly influenced by Irving's \"Wolfert Webber,\" Stevenson saying in his preface, \"It is my debt to Washington Irving that exercises my conscience, and justly so, for I believe plagiarism was rarely carried farther... the whole inner spirit and a good deal of the material detail of my first chapters... were the property of Washington Irving.\"", "In 1911, American author Ralph D. Paine conducted a survey of all known or purported stories of buried treasure and published them in \"The Book of Buried Treasure\". He found a common trait in all the stories: there was always a lone survivor of a piratical crew who somehow preserved a chart showing where the treasure was buried, but unable to return himself, he transfers the map or information to a friend or shipmate, usually on his deathbed. This person would then go search in vain for the treasure, but not before transferring the legend down to another hapless seeker. Cases. The Roman historian Dio Cassius says that, in the early 2nd century, the Dacian king Decebalus had changed the course of the river Sargetia and buried tons of gold and silver in the riverbed. Later, he ordered the river to be restored, and the slaves involved in the works to be executed. However, one of his nobles revealed the treasure's location to the Romans. The Byzantine historian Jordanes tells a similar story of the burial of the Visigoth king Alaric I and his treasure under the river Busento in 410. The burial places of the Khazar kings (\"qoruq\") and other inner Asian people were also under a rerouted river. There are a number of reports of supposed buried pirate treasure that surfaced much earlier than these works, indicating that the idea was around for more than a century before those stories were published.", "Of all the Indians in the territory of Colombia, the Wayuu were unique in having learned the use of firearms and horses. In 1769 the Spanish took 22 Wayuus captive, in order to put them to work building the fortifications of Cartagena. The reaction of the Wayuus was unexpected. On 2 May 1769, at El Rincón, near Riohacha, they set their village afire, burning the church and two Spaniards who had taken refuge in it. They also captured the priest. The Spanish immediately dispatched an expedition from El Rincón to capture the Wayuus. At the head of this force was José Antonio de Sierra, a mestizo who had also headed the party that had taken the 22 Guajiro captives. The Guajiros recognized him and forced his party to take refuge in the house of the curate, which they then set afire. Sierra and eight of his men were killed. This success was soon known in other Guajiro areas, and more men joined the revolt. According to Messía, at the peak, there were 20,000 Wayuus under arms. Many had firearms acquired from English and Dutch smugglers, sometimes even from the Spanish. This enabled the rebels to take nearly all the settlements of the region, which they burned. According to the authorities, more than 100 Spaniards were killed and many others were taken prisoner. Many cattle were also taken by the rebels. The Spaniards took refuge in Riohacha and sent urgent messages to Maracaibo, Valledupar, Santa Marta and Cartagena, the latter responding by sending 100 troops.", "Viceroyalty of the Spanish Empire (1717–1822)\nThe Viceroyalty of the New Kingdom of Granada ( ), also called Viceroyalty of New Granada or Viceroyalty of Santafé, was the name given on 27 May 1717 to the jurisdiction of the Spanish Empire in northern South America, corresponding to modern Colombia, Ecuador, Panama and Venezuela. Created in 1717 by King Felipe V, as part of a new territorial control policy, it was suspended in 1723 for financial problems and was restored in 1739 until the independence movement suspended it again in 1810. The territory corresponding to Panama was incorporated later in 1739, and the provinces of Venezuela were separated from the Viceroyalty and assigned to the Captaincy General of Venezuela in 1777. In addition to those core areas, the territory of the Viceroyalty of New Granada included Guyana, Trinidad and Tobago, southwestern Suriname, parts of northwestern Brazil, and northern Peru. A strip along the Atlantic Ocean in Mosquito Coast was added by the Royal Decree of 20 November 1803, but the British battled for administrative control. Colonial history. Two centuries after the establishment of the New Kingdom of Granada in the 16th century, whose governor was dependent upon the Viceroy of Peru at Lima, and an \"audiencia\" at Santa Fé de Bogotá (today capital of the republic of Colombia), the slowness of communications between the two capitals led to the creation of an independent Viceroyalty of New Granada in 1717 (and its reestablishment in 1739 after a short interruption)."], "distances": [0.06350806451612903, 0.06350806451612903, 0.059714795008912656, 0.05887445887445887, 0.05634920634920634, 0.054411764705882354, 0.054093567251461985, 0.05334281650071124, 0.05202702702702703, 0.04889683959451401], "supports": [1, 1, 1, 0, 0, 0, 0, 0, 1, 0], "metadatas": [{"doc_name": "1715 Treasure Fleet", "support": 1, "pool_index": 185, "mapped_id": "00367852-4217-48b1-9313-2c21ea592610"}, {"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "1715 Treasure Fleet", "pool_index": 186, "support": 1}, {"pool_index": 188, "doc_name": "1715 Treasure Fleet", "mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "support": 1}, {"mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "pool_index": 57, "doc_name": "Buried treasure", "support": 0}, {"pool_index": 187, "mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "1715 Treasure Fleet", "support": 0}, {"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "support": 0, "pool_index": 189, "doc_name": "Treasure Fleet"}, {"pool_index": 58, "support": 0, "mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "doc_name": "Buried treasure"}, {"mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "pool_index": 59, "support": 0, "doc_name": "Buried treasure"}, {"doc_name": "Viceroyalty of New Granada", "support": 1, "mapped_id": "00bdf195-a662-411d-9b1f-e03d702e1296", "pool_index": 87}, {"pool_index": 85, "mapped_id": "00bdf195-a662-411d-9b1f-e03d702e1296", "doc_name": "Viceroyalty of New Granada", "support": 0}], "recall": 1.0, "precision": 0.4, "ndcg": 0.9493885684853097, "mrr": 1.0}
{"query_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "documents": ["In 2010, Corr appeared in the final few episodes of ' as Michael Kanaan and was a regular character on the popular Australian television show \"Packed to the Rafters\", playing Dave Rafter's nephew Coby Jennings. In 2013, he appeared in the teen thriller film \"6 Plots\", and starred alongside John Jarratt in \"Wolf Creek 2\", the 2013 sequel to the horror film \"Wolf Creek\". In 2015, Corr starred in Neil Armfield's romantic-drama film \"Holding the Man\", adapted from Timothy Conigrave's 1995 memoir of the same name. He portrayed Conigrave opposite Craig Stott who portrayed Conigrave's partner, John Caleo. In 2016, he starred in the television series \"Wanted\". Corr appeared as Joseph in Helen Edmundson's 2018 film \"Mary Magdalene\". In 2022, he had a recurring role in HBO's \"House of the Dragon\" as Ser Harwin Strong. In 2024, Corr was named for feature film \"Kangaroo.\" Legal issues. In May 2014, Corr was charged with heroin possession after being found with a freezer bag holding 0.26g (less than 1/100 of an ounce) of the drug in the Sydney suburb of Bondi. After admitting to the possession, the actor was given a 12-month good behaviour bond with no conviction recorded. The arrest took place a few days after Corr's grandfather went into a coma following a heart attack.", "Australian actor\nRyan Corr is an Australian actor. He is known for his roles in the Australian drama series \"Packed to the Rafters\", \"Love Child\" and \"Underbelly\", along with film roles in \"Wolf Creek 2\" (2013), \"The Water Diviner\" (2014), \"Holding the Man\" (2015), as well as the \"Game of Thrones\" prequel \"House of the Dragon\". Early life. Corr was born in Melbourne. His father is Peter Corr, the head coach of the Australian women's goalball team. In 2009, he graduated from the National Institute of Dramatic Art (NIDA). Career. He began making appearances in film and television from the age of five, but started his acting career in earnest at age thirteen with the film \"Opraholic\". His first television performance was on \"The Sleepover Club\" with a supporting role as Matthew McDougal. Following this, he landed a lead role as Sheng Zamett on \"Silversun\" (2004). Soon after, Corr had guest appearances on shows such as ', \"Blue Heelers\", and \"Neighbours\". As a voice actor, he voiced a sheep in \"Charlotte's Web\". In 2006, the second series of \"Blue Water High\" aired on Australian TV in which Corr starred as young surfer Eric, one of the six chosen teens to attend Solar Blue.", "Irish musician\nAndrea Jane Corr (born 17 May 1974) is an Irish musician and actress. Corr debuted in 1990 as the lead singer of the Celtic folk rock and pop rock group The Corrs along with her three elder siblings Caroline, Sharon and Jim. Aside from singing lead vocals, Corr plays the tin whistle, the mandolin, the ukulele and the piano. With the others, Corr has released seven studio albums, two compilation albums, one remix album and two live albums. Corr has also pursued a solo career, releasing her debut album, \"Ten Feet High\", in 2007. The album moved away from the sound of the Corrs and features a dance-pop sound. Her next album, released on 30 May 2011, was entirely made up of covers of songs that were important to her when younger. Corr is involved in charitable activities. She has played charity concerts to raise money for the Pavarotti &amp; Friends Liberian Children's Village, Freeman Hospital in Newcastle upon Tyne, England, the victims of the Omagh bombing in Northern Ireland and The Prince's Trust in 2004. She is an ambassador for the Nelson Mandela's \"46664\" campaign, raising awareness towards AIDS in Africa. During the Edinburgh Live 8 on 2 July 2005 The Corrs performed \"When the Stars Go Blue\" alongside Bono to promote the Make Poverty History campaign. Along with her siblings, she was appointed an honorary M.B.E. in 2005 by Queen Elizabeth II for her contribution to music and charity. Early years.", "But when Betsy tells Craig she is going to call her broker and sell some stocks to get money for the cruise, Craig panics. He has made some bad investments and lost all her money in the stock market. The Montgomeries are broke, only Betsy doesn't know it yet. In the process of attempting to help Steve, Betsy finds that she is still in love with him and decides to leave her husband. Upon returning from a romantic evening with Steve at the boathouse, Betsy went into labor. It was a breech birth, and Steve had to get her to the hospital quickly. Diana discovered him there and tried to get him to leave, but Steve couldn't tear himself away from Betsy, who gave birth to a healthy daughter. In remembrance of her father Dan, she named the child Danielle. Craig told his wife how much he loved her, and now that they had a child, he hoped things would be all right between them. Although Betsy told Craig it was over, things changed when he was fired from his job. Later, Betsy was so moved when she heard Craig talking to his sleeping daughter about his losses, and told Steve she couldn't leave Craig right now. When Steve exploded, Betsy stormed out, saying that they were through. On Kim's advice, a sad Betsy wrote a note to Steve telling him how much she loved him. However, unbeknownst to her, Craig found the note, tore it up and forged a new one saying Betsy loved Craig and regretted having to betray him.", "The setting of the early ballads is usually attributed by scholars to either the 13th century or the 14th, although it is recognised they are not necessarily historically consistent. The early ballads are also quite clear on Robin Hood's social status: he is a yeoman. While the precise meaning of this term changed over time, including free retainers of an aristocrat and small landholders, it always referred to commoners. The essence of it in the present context was \"neither a knight nor a peasant or 'husbonde' but something in between\". Artisans (such as millers) were among those regarded as 'yeomen' in the 14th century. From the 16th century on, there were attempts to elevate Robin Hood to the nobility, such as in Richard Grafton's \"Chronicle at Large\"; Anthony Munday presented him at the very end of the century as the Earl of Huntingdon in two extremely influential plays, as he is still commonly presented in modern times. As well as ballads, the legend was also transmitted by 'Robin Hood games' or plays that were an important part of the late medieval and early modern May Day festivities. The first record of a Robin Hood game was in 1426 in Exeter, but the reference does not indicate how old or widespread this custom was at the time. The Robin Hood games are known to have flourished in the later 15th and 16th centuries. It is commonly stated as fact that Maid Marian and a jolly friar (at least partly identifiable with Friar Tuck) entered the legend through the May Games. Early ballads.", "The main character, Edward Kenway, is aboard one of the ships in the fleet as a prisoner, and manages to escape with the help of his future quartermaster, Adéwalé, recruiting other captive pirates as a crew. The pirates eventually manage to escape the fleet and the hurricane by stealing the twelfth ship, the brig \"El Dorado\", which Edward keeps and renames the \"Jackdaw\", becoming the player's ship for the rest of the game. Edward later makes reference to the event when Blackbeard inquires as to how he got the Jackdaw, and the latter then suggests visiting the site to salvage some of the lost treasure. In the 1977 movie \"The Deep\" \"David Sanders (Nick Nolte) and his British girlfriend Gail Berke (Jacqueline Bisset) recover a number of artifacts (from a diving expedition off the coast of Bermuda, homeland of Captain Henry Jennings), including an ampule of amber-colored liquid and a medallion bearing the image of a woman and the letters 'S.C.O.P.N' (an abbreviation of the Latin 'Santa Clara Ora Pro Nobis' that translates to English as 'Saint Clara Pray For Us') and a date, 1714.", "Tod vividly revises \"The Burning of Los Angeles\" in his mind, while being pushed around in the human waves of the riot. The final scene plays out, uninterrupted. The conclusion of the novel can be read as a moment of epiphany and mental clarity for the artist, or a complete \"mental breakdown\" and Tod's \"incorporation into the mechanized, modern world of Los Angeles.\" Themes. The characters are outcasts, who have come to Hollywood to fulfill a dream or wish:\n\"The importance of the wish in West's work was first noted by W. H. Auden, who declared (in one of the interludes in \"The Dyer's Hand\") that West's novels were essentially \"parables about a Kingdom of Hell whose ruler is not so much a Father of Lies as a Father of Wishes\". In this respect, James Light, in his book \"Violence, Dreams, and Dostoevsky: The Art of Nathanael West\", suggests that \"The Day of the Locust\" falls in with a motif in West's fiction; the exposure of hopeful narratives in modern American culture as frauds. As some critics point out, West's novel was a radical challenge to modernist literature. Some modernists set themselves up in opposition to mass culture; West depicts it and makes it an integral part of the novel. West's use of grotesque imagery and situations establishes the novel as a work of Juvenalian satire.", "\"I Was Kaiser Bill's Batman\" was a hit single in 1967 composed by British songwriters Roger Cook and Roger Greenaway. It was a novelty record, performed mostly by whistling. The name Whistling Jack Smith, credited on the most commercially successful recording, was a play on the name of the baritone singer of the 1920s, 1930s and 1940s, Whispering Jack Smith. Production. The tune was written by Greenaway and Cook and was originally titled \"Too Much Birdseed\". It was recorded as a single for Deram Records by record producer Noel Walker, using studio musicians together with the Mike Sammes Singers. The whistling on the record was, according to most sources, by John O'Neill, a trumpeter and singer with the Mike Sammes Singers who was known for his whistling skill, though other sources credit Noel Walker. The song is noted for its false ending: after the last chorus, a male voice shouts \"Oi\" (on the album version) and \"Hey\" (on the single version), and the tune starts up again with the repeated chorus, then fades out. Performances. Credited to Whistling Jack Smith, the record rose up the UK singles chart. When it was featured on \"Top of the Pops\", actor Coby Wells was used to mime the whistling, and later toured as the public face of Whistling Jack Smith. Wells' real name was Billy Moeller, a brother of Tommy Moeller, lead vocalist, guitarist, and pianist with Unit 4 + 2. The recording reached #5 on the UK singles chart in March 1967, staying in the chart for 12 weeks.", "Upon returning to Oakdale, Betsy is ready to leave Craig but loses her nerve when he plans a romantic evening for her. Torn between her love for Steve and her commitment to Craig, Betsy makes love to Craig. When Betsy later becomes pregnant, she's convinced the child is Craig's and decides to commit herself to the marriage. Steve is left heartbroken over this decision, with Craig continuously hinting that Steve and Diana McColl seem to be an item now. Soon after, Steve is wanted for the theft of Whit McColl's gold coins. Later, Betsy finds a wounded Steve in the back seat. Despite knowing that he is wanted by the police, she takes him to the boathouse and tends to his wounds. Betsy enlists Steve's friend, Tucker Foster, to help them find out who framed Steve. Then Betsy's grandfather, David, catches Betsy sneaking into the supply room at Memorial Hospital to get medicine for Steve. David discovers that Steve is suffering from blood poisoning and gangrene and will die unless he gets treatment. With Betsy's help, David operates on Steve right there in the boathouse. Meanwhile, one of Whit's rare coins has been bought by Bobbi Maxwell and her boyfriend, Lonnie. They trace Tucker from the pawnshop and call him for a meeting. Betsy and Steve join the \"coin hunt\" and arrive for the meeting to try to buy back the coin. Craig is relieved, because now he could spend more time with Diana.", "He had been close with his grandfather, who had flown with him to acting jobs when he was a child. According to Corr's lawyer, Corr was grateful for the arrest, because it stopped him from using heroin for the first time. Corr later stated, \"I found myself in a position where I was incredibly upset, someone offered me something and 200 metres after, I was picked up with it. It was an error of judgment.\" References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;"], "distances": [0.06451612903225806, 0.0625, 0.05634920634920634, 0.030303030303030304, 0.030303030303030304, 0.029411764705882353, 0.029411764705882353, 0.02857142857142857, 0.027777777777777776, 0.02702702702702703], "supports": [1, 1, 0, 0, 0, 0, 0, 0, 0, 0], "metadatas": [{"mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "support": 1, "doc_name": "Ryan Corr", "pool_index": 171}, {"support": 1, "mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "pool_index": 170, "doc_name": "Ryan Corr"}, {"doc_name": "Andrea Corr", "mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "support": 0, "pool_index": 174}, {"doc_name": "Steve Andropoulos and Betsy Stewart", "pool_index": 237, "mapped_id": "0177bf17-6a23-45b0-a27d-1cd9acc1290c", "support": 0}, {"mapped_id": "00797510-92d0-4289-965d-8f69978bcdd0", "doc_name": "Robin Hood", "support": 0, "pool_index": 93}, {"pool_index": 187, "doc_name": "1715 Treasure Fleet", "support": 0, "mapped_id": "00367852-4217-48b1-9313-2c21ea592610"}, {"mapped_id": "00acbdb7-0afa-4f62-81b7-a95e501336a4", "doc_name": "The Day of the Locust", "support": 0, "pool_index": 193}, {"mapped_id": "018a5779-9152-4555-909c-4d7a12421ba0", "doc_name": "I Was Kaiser Bill's Batman", "support": 0, "pool_index": 210}, {"mapped_id": "0177bf17-6a23-45b0-a27d-1cd9acc1290c", "doc_name": "Steve Andropoulos and Betsy Stewart", "support": 0, "pool_index": 236}, {"doc_name": "Ryan Corr", "mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "support": 0, "pool_index": 172}], "recall": 1.0, "precision": 0.2, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "documents": ["Best Day Ever is the fifth mixtape by American rapper Mac Miller. It was released by Rostrum Records on March 11, 2011, as the follow-up to Miller's acclaimed mixtape \"K.I.D.S.\" (2010). The mixtape consists of sixteen songs produced by nine producers (predominantly ID Labs), and includes features from rappers Wiz Khalifa and Phonte. Four songs from \"Best Day Ever\" have music videos: \"Donald Trump\", \"Get Up\", \"Wear My Hat\" and \"Best Day Ever\". Release and promotion. Over 20,000 viewers joined Miller for a live video stream prior to the mixtape's release. As of March 2019, the mixtape has received over 1.2 million downloads and 1.5 million streams on its official host, DatPiff. The song \"Donald Trump\" was released as a single on May 17, 2011. It became his first singles entry on the US \"Billboard\" Hot 100, peaking at number 75, and was certified platinum by the Recording Industry Association of America (RIAA). Its music video has received over 180 million views on YouTube, and is Miller's most-viewed video. When the video surpassed 16 million views, Donald Trump acknowledged the song on the social networking site Twitter, stating \"Who wouldn't be flattered?\". In June 2016, \"Best Day Ever\" was remastered and commercially released by Rostrum Records for its fifth anniversary. Critical reception. The mixtape received favorable reviews, including an \"XL\" (second highest) from \"XXL\" magazine. Commercial performance.", "Following Miller's death on September 7, 2018, \"Best Day Ever\" debuted at number 26 on the US \"Billboard\" 200 with 17,000 album-equivalent units. Track listing. Credits adapted from DatPiff and Spotify. Notes\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "\"Best Day Ever\" is the first segment of the 20th episode of the fourth season of the American animated television series \"SpongeBob SquarePants\", and the 80th episode overall. The episode was written by Nate Cash, Tuck Tucker, and Steven Banks, and the animation was directed by Larry Leichliter; Cash and Tucker also functioned as storyboard directors. It originally aired on Nickelodeon in the United States on November 10, 2006. In the episode, SpongeBob is determined to have a perfect day, which, to his disappointment, does not go as he planned. Each of his friends has a different problem of their own, so he sets out to help them while spoiling his own agendas. The episode features a song titled \"The Best Day Ever\" written by Tom Kenny and Andy Paley. A soundtrack album, \"SpongeBob SquarePants: The Best Day Ever\", was released on September 12, 2006. \"Best Day Ever\" pulled an average of 6.7 million viewers upon release. The song was actually used two years earlier in the credits of \"The SpongeBob SquarePants Movie\". Plot. SpongeBob's \"Best Day Ever\" fails to turn out as he planned when he is forced to postpone his activities to help his friends with various problems. He wanted to work at the Krusty Krab, but it is condemned because of a nematode infestation. SpongeBob tries to get the nematodes to go away but they refused to and they eat his pants.", "Puff said his name when she found him hiding in her purse in one attempt). He gets in right as the concert ends. Upset and angry that his \"Best Day Ever\" is a disaster, SpongeBob snaps and has a freak-out, runs up to the stage, and rips open the curtain yelling \"NO! It is NOT over!\" He grabs the microphone to give an elaborate speech about how his \"Best Day Ever\" has been ruined. However, Mr. Krabs, Patrick, Sandy and Squidward tell him about how he helped them with their problems and that they themselves were what his \"Best Day Ever\" was actually about. To make it up to him, they hold a production in which SpongeBob performs his song, \"Best Day Ever\", to complete his day with Patrick, Sandy, Squidward, and Mr. Krabs co-starring along in it. A few hours later, SpongeBob is still singing, but his friends are tired and sleepy, and the audience has all disappeared. When Squidward asks Mr. Krabs how long they have to keep up the performance, Mr. Krabs replies, \"Just 'til his little heart gives out, Squidward. Just 'til his little heart gives out.\" Production. \"Best Day Ever\" was written by Nate Cash, Tuck Tucker and Steven Banks, with Larry Leichliter serving as animation director. Cash and Tucker also functioned as storyboard directors. The episode originally aired on Nickelodeon in the United States on November 10, 2006.", "Turning Point! is a Tyrone Davis album released in 1976. This was his final release for Dakar Records. This is the first of two albums by Tyrone Davis in 1976. \"Love and Touch\" was released after his move over to Columbia Records. Background. Primarily produced by Leo Graham with the exception of two songs (\"Saving My Love for You\" and \"Turn Back the Hands of Time\"), which were handled by Carl Davis and Tom Tom 84. \"Turning Point\" was the album's lead single and reached No. 1 on the \"Billboard\" Hot Soul Singles chart in February 1976. It was the first number-one soul single to not crossover to the Hot 100 and any \"Billboard\" pop singles chart since 1955. It was Davis's last number-one soul/R&amp;B hit. Two follow ups, \"It's So Good (To Be Home with You)\" and \"Ever Lovin' Girl\", peaked at Nos. 9 and 39, respectfully, on the soul singles chart. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "1962 film by Blake Edwards\nDays of Wine and Roses is a 1962 American romantic drama film directed by Blake Edwards with a screenplay by JP Miller adapted from his own 1958 \"Playhouse 90\" teleplay of the same name. The film was produced by Martin Manulis, with music by Henry Mancini, and features Jack Lemmon, Lee Remick, Charles Bickford and Jack Klugman. The film depicts the downward spiral of two average Americans who succumb to alcohol use disorder and attempt to deal with their problems. An Academy Award went to the film's theme music, composed by Mancini with lyrics by Johnny Mercer. The film received four other Oscar nominations, including Best Actor and Best Actress. In 2018, \"Days of Wine and Roses\" was selected for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant.\" Plot. San Francisco public relations executive Joe Clay meets secretary Kirsten Arnesen. At first, he mistakes her for a call girl, but then when he learns she is a client's secretary, he tries to apologize and court her but she brushes him off. Eventually she warms to him and they begin dating. Kirsten is a teetotaler until Joe introduces her to social drinking. She is initially reluctant, but after her first few Brandy Alexanders, she admits that having a drink makes her \"feel good.\" Despite the misgivings of Kirsten's father, who runs a San Mateo plant nursery and landscaping business, they marry and have a daughter, Debbie.", "His cries wake a sleeping Debbie, who asks if Kirsten is coming back. Joe tells her Kirsten is sick and, after deflecting her questions about Kirsten \"getting well,\" stares out at the empty street, the bar's flashing neon sign reflected in the window. Production. Background. JP Miller found his title in the 1896 poem \"Vitae Summa Brevis Spem Nos Vetat Incohare Longam\" by the English writer Ernest Dowson (1867–1900): It also inspired the title song devised by Henry Mancini and Johnny Mercer. They are not long, the weeping and the laughter,\nLove and desire and hate;\nI think they have no portion in us after\nWe pass the gate. They are not long, the days of wine and roses:\nOut of a misty dream\nOur path emerges for a while, then closes\nWithin a dream. Johnny Mercer had also written the lyrics for the theme from \"Laura\", a 1944 film in which Dowson's poem is quoted in its entirety. Miller's teleplay for \"Playhouse 90\", also titled \"Days of Wine and Roses\", had received favorable critical attention and was nominated for an Emmy Award in the category Best Writing of a Single Dramatic Program - One Hour or Longer. Manulis, a \"Playhouse 90\" producer, decided the material was ideal for a movie. Some critics observed that the movie lacked the impact of the original television production, which starred Cliff Robertson as Joe and Piper Laurie as Kirsten. In an article written for \"DVD Journal,\" critic D.K.", "Filming took place almost entirely on location at the historic Los Angeles Theatre, in downtown LA. Long believed to be haunted, the theater is its own character in the story, and the deleted scenes include references to one of its founders, Charlie Chaplin. Music. The original score of the film was composed by System of a Down's lead singer, Serj Tankian. It is his first film score. Release. The theatrical release of \"1915\" in the United States took place on April 17, 2015, with the film's premiere taking place on April 13 at the Egyptian Theatre in conjunction with the American Cinematheque. It released widely in Russia on April 23, 2015, and in Armenia on April 25, 2015. Its first international preview was at the Maxim Gorky Theatre in Berlin, Germany on April 5, 2015. It released in Australia in June, 2015. On May 26, 2016, the film was released in the UK. On June 4 it was released in France. In 2015 it was featured selection in the Golden Apricot International Film Festival, Romanian International Film Festival, and Lake Van International Film Festival in Turkey, where it won the Special Jury Prize. It was also awarded \"Best Film\" by the World Entertainment Armenian Awards. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "1985 film by Martin Scorsese\nAfter Hours is a 1985 American black comedy film directed by Martin Scorsese, written by Joseph Minion, and produced by Amy Robinson, Griffin Dunne, and Robert F. Colesberry. Dunne stars as Paul Hackett, an office worker who experiences a series of misadventures while attempting to make his way home from Manhattan's SoHo district during the night. \"After Hours\" was critically acclaimed for its black humor, and is considered to be an underrated Scorsese film. As of 2024, it is Scorsese's most recent film that is not an adaptation or biopic. The film won the Independent Spirit Award for Best Feature. Scorsese won the Cannes Film Festival Award for Best Director and the Independent Spirit Award for Best Director for the film. Plot. After a boring day at work, computer data entry worker Paul Hackett strikes up conversation with a stranger named Marcy Franklin in a café in New York City. Marcy tells him that she is living in SoHo with a sculptor named Kiki Bridges, who makes and sells plaster-of-Paris paperweights resembling cream cheese bagels, and leaves him her number. Later in the night, after calling the number under the pretense of buying a paperweight, Paul takes a taxi to the apartment. On the way, his $20 bill is blown out the window of the cab, leaving him with only some change, much to the incredulity of the cab driver.", "She furthermore describes the situation as \"Not Fair\" because while he plays the perfect boyfriend in every other way, he is selfish when it comes to their sex life (\"all you do is take\") – thus the song gives the impression that all his niceness and concern may have been just a face to get what he wants from his girlfriend without any genuine concern with her satisfaction and happiness. The single was officially released on January and climbed the charts, still being in the top 10 in June. The single was released as a digital download on 21 March 2009 (iTunes) and on 11 May 2009 as a CD. Allen performed it live for the first time on \"Ant &amp; Dec's Saturday Night Takeaway\" on 21 March 2009. The censored version of the song, which is often used on the radio, blanks out the words \"wet patch\" and \"I spent ages giving head\" on the second verse, replacing them with a burst of the background instruments. An alternative version only removes the word \"head\", replacing it with a short chord played on a mouth organ. While performing the song in the BBC Radio Live Lounge and on \"The Graham Norton Show\", she replaced the latter with \"I spent ages kneading bread\". Composition. \"Not Fair\" is a \"bluegrass-infused\" country song. Commercial performance. \"Not Fair\" charted two months before the release date at number 200 in the UK. By 2 May, \"Not Fair\" reached the #10 spot on the official chart before reaching a final peak of #5."], "distances": [0.06350806451612903, 0.06256109481915934, 0.061553030303030304, 0.058823529411764705, 0.053571428571428575, 0.053571428571428575, 0.05266805266805267, 0.05012531328320802, 0.04738015607580825, 0.03818181818181818], "supports": [1, 0, 0, 0, 0, 0, 1, 0, 0, 0], "metadatas": [{"mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "doc_name": "Best Day Ever (mixtape)", "support": 1, "pool_index": 110}, {"mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "doc_name": "Best Day Ever (mixtape)", "support": 0, "pool_index": 111}, {"doc_name": "Best Day Ever", "support": 0, "mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "pool_index": 112}, {"support": 0, "mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "pool_index": 114, "doc_name": "Best Day Ever"}, {"support": 0, "pool_index": 32, "mapped_id": "00a596f6-8823-48d1-9dc5-4364118bbbe0", "doc_name": "Turning Point!"}, {"support": 0, "mapped_id": "01fa3800-7594-4f6d-8871-b3fb685de2f3", "doc_name": "Days of Wine and Roses (film)", "pool_index": 241}, {"pool_index": 244, "mapped_id": "01fa3800-7594-4f6d-8871-b3fb685de2f3", "doc_name": "Days of Wine and Roses (film)", "support": 1}, {"support": 0, "mapped_id": "0085a069-c8c1-4a78-9074-0f17d2073f9c", "pool_index": 18, "doc_name": "1915 (film)"}, {"doc_name": "After Hours (film)", "support": 0, "mapped_id": "01570018-cd65-4e49-ac6f-a5204a6a7ce2", "pool_index": 53}, {"support": 0, "doc_name": "Not Fair", "pool_index": 63, "mapped_id": "01eaf75a-fc8a-4681-9d13-17919284202e"}], "recall": 1.0, "precision": 0.2, "ndcg": 0.8175295903539445, "mrr": 1.0}
{"query_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "documents": ["The rinks of Hollie Duncan (Ontario), Émilia Gagné (Quebec), and Casey Scheidegger (Alberta) made their Scotties debut; although members of Team Ontario had previous experience at the national women's championship, mostly as alternates. Scotties veteran skip Sherry Anderson (Saskatchewan) led a team of Tournament of Hearts rookies. The teams are listed as follows:\nWildcard game. A wildcard play-in game was played on January 26; it was contested between the top two teams on the CTRS standings who did not win their respective provincial championships, and was played between The Glencoe Club's Chelsea Carey rink from Calgary and the East St. Paul Curling Club's Kerri Einarson rink from the Winnipeg exurb of East St. Paul. With Einarson's victory, Manitoba was represented by three different teams in the tournament. \"Friday, January 26, 18:30\"\nRound Robin standings. \"Final Round Robin Standings\"\nRound Robin results. All draw times are listed in Pacific Standard Time (). Draw 1. \"Saturday, January 27, 14:00\"\nDraw 2. \"Saturday, January 27, 19:00\"\nDraw 3. \"Sunday, January 28, 09:00\"\nDraw 4. \"Sunday, January 28, 14:00\"\nDraw 5. \"Sunday, January 28, 19:00\"\nDraw 6. \"Monday, January 29, 09:00\"\nDraw 7. \"Monday, January 29, 14:00\"\nDraw 8. \"Monday, January 29, 19:00\"\nDraw 9.", "Canadian women's curling championship\nThe Scotties Tournament of Hearts ('; commonly referred to as the Scotties) is the annual Canadian women's curling championship, sanctioned by Curling Canada, formerly called the Canadian Curling Association. The winner goes on to represent Canada at the women's world curling championships. Since 1985, the winner also gets to return to the following year's tournament as \"Team Canada\". It is formally known as the \"Canadian Women's Curling Championship\". Since 1982, the tournament has been sponsored by Kruger Products, which was formerly known as Scott Paper Limited when it was a Canadian subsidiary of Scott Paper Company. As such, the tournament was formerly known as the Scott Tournament of Hearts; when Kimberly-Clark merged with Scott, the Canadian arm was sold to the Quebec-based Kruger Inc. – while Kruger was granted a license to use several Scott brands in Canada until June 2007, it was given a long-term license to the Scotties brand because Kimberly-Clark already owned Kleenex. As such, the tournament was officially renamed the Scotties Tournament of Hearts in 2007. Until 2018, the format was a round robin of 12 teams. Starting with the 2015 Scotties Tournament of Hearts there have been more than twelve eligible teams; therefore a pre-qualification tournament was held to trim the field to twelve. In 2021, a new 18-team format was introduced, in which all 14 member associations of Curling Canada field a team in a main draw of two pools, alongside the defending champions, and the three highest-ranked teams on the Canadian Team Ranking System standings that did not win their provincial championships.", "The 2018 Scotties Tournament of Hearts, Canada's national women's curling championship, was held from January 27–February 4, 2018 at the South Okanagan Events Centre in Penticton, British Columbia. The winning team represented Canada at the 2018 Ford World Women's Curling Championship held from March 17–25 at the Memorial Gardens in North Bay, Ontario. The 2018 tournament was the first to use a new 16-team format, featuring representation by all fourteen member associations of Curling Canada, the second-place team from the 2017 tournament (as champion Rachel Homan declined to participate due to her qualification for the 2018 Winter Olympics), and a new wildcard team. As part of this new format, the Bronze medal game was removed from the schedule. Teams. Curling Canada introduced a new 16-team format for both the Tournament of Hearts and Brier for 2018, under which all 14 member associations of Curling Canada were represented in the main field, rather than being limited by a pre-qualifying tournament. The teams were divided into two pools for round robin play, after which the top four teams from each advanced to the Championship Pool. Defending champion Rachel Homan declined to participate as Team Canada in order to prepare for the 2018 Winter Olympics; Michelle Englot's team, who finished as runner-up in the 2017 tournament, participated in her place. The final spot in the tournament was filled by a wildcard play-in game held on the Friday before the tournament.", "It was created as a new championship trophy, rather than the \"crystal football\" that has been given by the American Football Coaches Association (AFCA) since 1986, as officials wanted a new trophy that was unconnected with the previous BCS championship system. The inaugural game was held at AT&amp;T Stadium in Arlington, Texas, on January 12, 2015, and was won by Ohio State. A top-ranked team did not win the College Football Playoff National Championship until LSU won the sixth edition of the game, in January 2020. Alabama has the most appearances in a College Football Playoff National Championship, with six, and also the most wins, with three. The College Football Playoff National Championship is not awarded by the National Collegiate Athletic Association (NCAA). The highest level of college football that the NCAA awards a championship in is the Division I Football Championship Subdivision (FCS). Venues. Cities across the United States can bid on the National Championship Game each year. The number of cities capable of bidding for the event is restricted by a requirement to have a stadium with at least 65,000 seats. The stadium restriction would limit the bidding to most cities with a National Football League franchise, since all but four of the stadiums in the league meet the capacity requirements. Unlike the Super Bowl, there is no \"de jure\" restriction on climate. A venue can not host a semi-final game and the National Championship Game in the same season. Host cities/regions. Ten different regions and ten different stadiums have hosted the National Championship Game. Game results. Rankings are from the CFP Poll released prior to matchup.", "‡ Attendance at the January 2021 game was limited due to the COVID-19 pandemic in the United States. &lt;br&gt;\nSource:\nAppearances by team. Championship games. Updated through the January 2024 edition (10 games, 20 total appearances). Semifinal games. Updated through the January 2024 edition (20 games, 40 total appearances). Appearances by conference. Updated through the January 2024 edition (10 games, 20 total appearances). Coaches. The following coaches led their teams to the National Championship final. Nick Saban has reached the final the most times, six, with a 3–3 record. MVPs. An offensive MVP and defensive MVP are named for each final. Game records. Source:\nNational anthem performers. The national anthem usually begins with a drumroll by two drummers, with one member representing each team. The national anthem for the 2021 game was pre-recorded due to COVID concerns. Broadcasters. Television. Beginning with the 2027 championship, ABC will simulcast the national championship with ESPN. Notes. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "\"Thursday, February 01, 19:00\"\nDraw 17. \"Friday, February 02, 14:00\"\nDraw 18. \"Friday, February 02, 19:00\"\nPlayoffs. 1 vs. 2. \"Saturday, February 03, 19:00\"\n3 vs. 4. \"Saturday, February 03, 14:00\"\nSemifinal. \"Sunday, February 04, 09:00\"\nFinal. \"Sunday, February 04, 16:00\"\nStatistics. Top 5 player percentages. \"Final Round Robin Percentages; minimum 6 games\"\nAwards. The awards and all-star teams were as follows:\n\"First Team\"\n\"Second Team\"\nNotes. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Self-dosing with poison to gain immunity\nMithridatism is the practice of protecting oneself against a poison by gradually self-administering non-lethal amounts. The word is derived from Mithridates VI, the king of Pontus, who so feared being poisoned that he regularly ingested small doses, aiming to develop immunity. Background. Mithridates VI's father, Mithridates V, was assassinated by poisoning by a conspiracy among his attendants. After this, Mithridates VI's mother held regency over Pontus (a Hellenistic kingdom, 281 BC–62 AD) until a male heir came of age. Mithridates was in competition with his brother for the throne and his mother began to favor his brother. Supposedly, during his youth, he began to suspect plots against him at his own mother's orders and was aware of her possible connection with his father's death. He then began to notice pains in his stomach during his meals and suspected his mother had ordered small amounts of poison to be added to his food to slowly kill him off. With other assassination attempts, he fled into the wild. While in the wild, it is said that he began ingesting non-lethal amounts of poisons and mixing many into a universal remedy to make him immune to all known poisons. After Mithridates' death, many Roman physicians claimed to possess and improve the formula. In keeping with most medical practices of his era, Mithridates' anti-poison routines included a religious component, supervised by the \"Agari\", a group of Scythian shamans who never left him.", "\"Tuesday, January 30, 09:00\"\nDraw 10. \"Tuesday, January 30, 14:00\"\nDraw 11. \"Tuesday, January 30, 19:00\"\nDraw 12. \"Wednesday, January 31, 09:00\"\nDraw 13. \"Wednesday, January 31, 14:00\"\nDraw 14. \"Wednesday, January 31, 19:00\"\nTiebreakers. \"Thursday, February 1, 09:00\"\nPlacement Round. Each team that finished fifth through eight in their pool played the team that finished in the same position in the opposite pool for the purpose of determining final tournament ranking. For example, the winner of the game between fifth place teams was ranked ninth place overall, the loser of that game was ranked tenth place, and so on. Seeding Games. All game times are listed in Pacific Standard Time (). A5 vs. B5. \"Friday, February 02, 09:00\"\nA6 vs. B6. \"Friday, February 02, 09:00\"\nA7 vs. B7. \"Friday, February 02, 09:00\"\nA8 vs. B8. \"Friday, February 02, 09:00\"\nChampionship Pool Standings. All wins and losses earned in the round robin (including results against teams that failed to advance) were carried forward into the Championship Pool. Wins in tiebreaker games were not carried forward. \"Final Championship Pool Standings\"\nChampionship Pool Results. All draw times are listed in Pacific Standard Time (). Draw 15. \"Thursday, February 01, 14:00\"\nDraw 16.", "2006 film\nGunahon Ka Sheher is a 2006 Pakistani Urdu language erotic film, directed by Pashto film director Saeed Ali Khan. Synopsis. The story of \"Aik Gunahoon Ka Shehr\" revolves around a young man (Ahmed Butt) fascinated by city life and the thrills it has to offer. Once there, unemployment eventually leads him to join a gang of blackmailers involved in sex crimes, in turn leading to his ruin. Controversy. When the team of Aik Gunahoon Ka Shehr approached the Pakistan Film Censor Board for a clearance certificate, objection was raised over the phrase Gunahoon Ka Shehr. Later the name was modified to Aik Gunahoon Ka Shehr. What exactly they aimed to achieve by this is still a mystery. Secondly, the members of the respected censor board charged that the film contained erotic scenes and dialogue. Consequently, the film appeared before a full board who chopped off several scenes and dialogues which they considered ‘unnecessary’ and ‘irrelevant’, resulting in the producer reshooting them. Annoyed, producer Saeed Iqbal presented his stand before the censor board members, stating that the story of the film depicts the true picture of youth today who indulge in sex and crime. \"The objection was unfair because already a number of Pakistani, Indian and English movies with sexual content are being exhibited at cinemas and cable networks throughout the country,\" he said. He further confessed that it is not a family film. \"Who likes to watch a family film in our dingy cinema houses?", "End of season American football event\nThe College Football Playoff National Championship is a post-season college football bowl game, used to determine a national champion of the NCAA Division I Football Bowl Subdivision (FBS), which began play in the 2014 college football season. The game is held on the second Monday of January and serves as the final game of the College Football Playoff, a bracket tournament between the top four teams in the country as determined by a selection committee, which was established as a successor to the Bowl Championship Series and then its similar BCS National Championship Game. The participating teams in the College Football Playoff National Championship are determined by two semifinal games (sometimes called the \"Plus-One system\"), hosted by an annual rotation of bowls commonly known as the New Year's Six. Thus, the teams to compete in the final are not directly selected by a selection committee, as had been the format used for the BCS National Championship Game. The game is played at a neutral site, determined through bids by prospective host cities (similar to the Super Bowl and NCAA Final Four). When announcing it was soliciting bids for the 2016 and 2017 title games, playoff organizers noted that the bids must propose host stadiums with a capacity of at least 65,000 spectators, and cities cannot host both a semi-final game and the title game in the same year. The winner of the game is awarded the College Football Playoff National Championship Trophy, which is sponsored by Dr Pepper."], "distances": [0.06350806451612903, 0.06350806451612903, 0.06060606060606061, 0.046536796536796536, 0.04564102564102564, 0.029411764705882353, 0.029411764705882353, 0.02857142857142857, 0.02857142857142857, 0.027777777777777776], "supports": [1, 0, 0, 0, 0, 0, 1, 0, 0, 0], "metadatas": [{"mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "support": 1, "doc_name": "2018 Scotties Tournament of Hearts", "pool_index": 106}, {"support": 0, "pool_index": 109, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "doc_name": "Scotties Tournament of Hearts"}, {"pool_index": 105, "doc_name": "2018 Scotties Tournament of Hearts", "support": 0, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882"}, {"mapped_id": "00cbc86f-0170-4774-8d3d-452de0a94c0b", "pool_index": 156, "support": 0, "doc_name": "College Football Playoff National Championship"}, {"pool_index": 157, "mapped_id": "00cbc86f-0170-4774-8d3d-452de0a94c0b", "support": 0, "doc_name": "College Football Playoff National Championship"}, {"support": 0, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "pool_index": 108, "doc_name": "2018 Scotties Tournament of Hearts"}, {"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "doc_name": "Mithridatism", "support": 1, "pool_index": 95}, {"support": 0, "doc_name": "2018 Scotties Tournament of Hearts", "pool_index": 107, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882"}, {"mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf", "doc_name": "Gunahon Ka Sheher", "support": 0, "pool_index": 12}, {"doc_name": "College Football Playoff National Championship", "support": 0, "mapped_id": "00cbc86f-0170-4774-8d3d-452de0a94c0b", "pool_index": 155}], "recall": 1.0, "precision": 0.2, "ndcg": 0.8175295903539445, "mrr": 1.0}
{"query_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "documents": ["1967 film by Robert Day\nTarzan and the Great River is a 1967 adventure film starring Mike Henry in his second of three film appearances as Tarzan. The twenty-seventh and penultimate film of the \"Tarzan\" film series that began with 1932's \"Tarzan the Ape Man\", the film was produced by Sy Weintraub and Steve Shagan, written by Bob Barbash (from a story by Barbash and Lewis Reed), and directed by Robert Day. Released on September 1, 1967, it was followed by \"Tarzan and the Jungle Boy\" in 1968. Plot. Tarzan is called to Brazil by an old friend, The Professor (Paulo Gracindo) to help stop the Jaguar Cult, led by Barcuma (Rafer Johnson), from destroying native villages and enslaving the survivors in his search for diamonds. Tarzan is assisted by Captain Sam Bishop (Jan Murray), a riverboat pilot, and Bishop's young ward, Pepe (Manuel Padilla Jr.), as well as Baron (a lion) and Cheeta (a chimpanzee). On their way they encounter Dr. Ann Philips (Diana Millay), who has witnessed the destruction of a village, and wants to continue fighting a plague by giving much-needed inoculations to natives who live along the Amazon River. Production notes. The movie was filmed entirely on location in Rio de Janeiro, Brazil (Rio de Janeiro Zoo, Parque Lage and Tijuca Forest). Dinky, the chimp portraying Cheeta, bit Mike Henry on the jaw during filming, requiring twenty stitches.", "The Tarzan River is a river in the United States territory of Guam. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "1963 collection of two Tarzan novellas by Edgar Rice Burroughs\nTarzan and the Tarzan Twins is a collection of two Tarzan novellas by American writer Edgar Rice Burroughs, for younger readers. It was originally published as two children's books, \"The Tarzan Twins\" by Voland in October 1927, and \"Tarzan and the Tarzan Twins, with Jad-bal-ja, the Golden Lion\", by Whitman in March 1936. These were brought together in November 1963 under the title of \"Tarzan and the Tarzan Twins\" in the first complete edition. Despite the gap in when they were written and first published, the events of the two stories occur in the same time-frame. The opening passage of \"Tarzan and the Tarzan Twins, with Jad-bal-ja, the Golden Lion\" specifies that its events occur immediately after those of \"The Tarzan Twins.\" In relation to other Tarzan stories, the two parts of the Tarzan Twins tale presumably fall between \"Tarzan and the Ant Men\" and \"Tarzan, Lord of the Jungle\" chronologically, as the initial part was published between these two novels. The second part confirms their placement in approximately this period, as it introduces a family that figures prominently in \"Tarzan and the Lost Empire\", the next book after \"Tarzan, Lord of the Jungle\"; specifically, it features Tarzan's first meeting with Doctor Karl von Harben, with whom he is already acquainted in \"Empire\". Because \"Twins\" is a children's book, however, it is customarily omitted from listings of the main Tarzan series.", "Thus \"Tarzan, Lord of the Jungle\" is generally considered the eleventh Tarzan book rather than \"Twins\". Plot. Two schoolboys, Dick and Doc, are cousins who resemble each other because their mothers are twins. As Dick is also related to Tarzan through his father, they become known as the Tarzan Twins. Invited to visit Tarzan's African estate, they become lost in the jungle and are imprisoned by cannibals, from whom they escape. They are then reunited with their host, who introduces them to his pet lion, Jad-bal-ja. Subsequently, they become involved in an adventure involving exiles from the lost city of Opar, who have kidnapped Gretchen von Harben, the daughter of a missionary. The brutish Oparians, adherents of the deposed and deceased high priest Cadj, are seeking a place to continue worship of the Flaming God in the traditional way, as Opar's Queen La has outlawed human sacrifice in the lost city. They plan to make their young captive Gretchen, whom they dub \"Kla\", meaning \"New La\", their new high priestess. She is eventually rescued by Tarzan and the twins, while Glum, leader of the exiles, and some of his adherents are killed. Tarzan orders the survivors to return to Opar and be loyal to La. Comic adaptations. The book has been adapted into comic form by Gold Key Comics in \"Tarzan\" no. 196, dated April 1971, with a script by Gaylord DuBois and art by Mike Royer.", "The chimpanzee was destroyed, and Henry later sued the producers for this accident and other unsafe working conditions on all three of his Tarzan films. The parties settled out of court. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "In 1911, American author Ralph D. Paine conducted a survey of all known or purported stories of buried treasure and published them in \"The Book of Buried Treasure\". He found a common trait in all the stories: there was always a lone survivor of a piratical crew who somehow preserved a chart showing where the treasure was buried, but unable to return himself, he transfers the map or information to a friend or shipmate, usually on his deathbed. This person would then go search in vain for the treasure, but not before transferring the legend down to another hapless seeker. Cases. The Roman historian Dio Cassius says that, in the early 2nd century, the Dacian king Decebalus had changed the course of the river Sargetia and buried tons of gold and silver in the riverbed. Later, he ordered the river to be restored, and the slaves involved in the works to be executed. However, one of his nobles revealed the treasure's location to the Romans. The Byzantine historian Jordanes tells a similar story of the burial of the Visigoth king Alaric I and his treasure under the river Busento in 410. The burial places of the Khazar kings (\"qoruq\") and other inner Asian people were also under a rerouted river. There are a number of reports of supposed buried pirate treasure that surfaced much earlier than these works, indicating that the idea was around for more than a century before those stories were published.", "New Zealand filmmaker (born 1961)\nSir Peter Robert Jackson (born 31 October 1961) is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the \"Lord of the Rings\" trilogy (2001–2003) and the \"Hobbit\" trilogy (2012–2014), both of which are adapted from the novels of the same name by J. R. R. Tolkien. Other notable films include the critically lauded drama \"Heavenly Creatures\" (1994), the horror comedy \"The Frighteners\" (1996), the epic monster remake film \"King Kong\" (2005), the World War I documentary film \"They Shall Not Grow Old\" (2018) and the documentary \"\" (2021). He is the fourth-highest-grossing film director of all-time, his films having made over $6.5 billion worldwide. Jackson began his career with the \"splatstick\" horror comedy \"Bad Taste\" (1987) and the black comedy \"Meet the Feebles\" (1989) before filming the zombie comedy \"Braindead\" (1992). He shared a nomination for Academy Award for Best Original Screenplay with his partner Fran Walsh for \"Heavenly Creatures\", which brought him to mainstream prominence in the film industry. Jackson has been awarded three Academy Awards for \"\" (2003), including Best Picture, Best Director, and Best Adapted Screenplay. His other awards include three BAFTAs, a Golden Globe, two Primetime Emmy Awards and four Saturn Awards among others.", "He mentioned Martin Scorsese's crime films \"Goodfellas\" and \"Casino\", remarking on \"something about those particular movies and the way Martin Scorsese just fearlessly rockets his camera around and has shot those films that I can watch those movies and feel inspired.\" Jackson said the 1970 film \"Waterloo\" inspired him in his youth. Other influences include George Romero, Sam Raimi and the special effects by Ray Harryhausen. Career. Splatter phase. Jackson's first feature was \"Bad Taste\", a haphazard fashion splatter comedy which took years to make. It included many of Jackson's friends acting and working on it for free. Shooting was normally done on weekends since Jackson was then working full-time. \"Bad Taste\" is about aliens that come to earth with the intention of turning humans into food. Jackson had two acting roles including a famous scene in which he fights himself on top of a cliff. The film was finally completed thanks to a late injection of finance from the New Zealand Film Commission, after Jim Booth, the body's executive director, became convinced of Jackson's talent (Booth later left the commission to become Jackson's producer). \"Bad Taste\" debuted at the Cannes Film Festival in May 1987. Around this time, Jackson began working on writing a number of film scripts, in varied collaborative groupings with playwright Stephen Sinclair, writer Fran Walsh and writer/actor Danny Mulheron. Walsh would later become his life partner.", "Biographer Dan Wooding believe the album is Wakeman's \"own personal journey into the unknown\". Recording. Wakeman recalled the difficulty in getting A&amp;M to understand and support \"No Earthly Connection\" partly due to the length of \"Music Reincarnate\" which occupied the entire first side and finish on part of the second. The label suggested to have parts cut in order for the track to fit on a single side, but Wakeman refused as its length was what he intended the piece to be. He also refused to extend the piece to fill both sides entirely as it resembled the problem he had with the Yes album \"Tales from Topographic Oceans\" (1973), a double album containing four, side long tracks that were deliberately extended to fit each side of a vinyl, an idea that Wakeman disagreed with. Instead, Wakeman filled the second side with two \"related story wise\" tracks, \"The Prisoner\" and \"The Lost Cycle\". The album was recorded from January to March 1976 with Wakeman credited as the producer. He was joined by engineer Paul Tregurtha and engineering assistant Didier Utard. Wakeman lived in the studio building with the engineers for the entire time, with his band members staying for a large amount of it. At one point in the recording, Wakeman woke up during the night after he thought of a particular sound he wished to put onto tape and woke an engineer to record it. \"There was something quite magical about that and I've never been able to do it ever again\".", "The queen consort with the shortest tenure was Yolande de Dreux, second wife of Alexander III, who was queen for days in 1285 and 1286. The shortest tenure as heir apparent was that of the unnamed son of Henry VIII who died within hours of birth on 7 September 1513. Elizabeth I holds the records for the shortest tenure of an English heir presumptive (almost 2 years as heir-presumptive to Henry VIII) unless one recognizes the 13-day tenure attributed to Lady Jane Grey's sister, The Lady Herbert of Cardiff. This would also be the record for shortest total tenure as heir-presumptive (Elizabeth was later heiress-presumptive to her sister Mary). The shortest total tenure as a male heir-presumptive was George I (54 days). The shortest tenure as a female heir presumptive Mary, Queen of Scots who was heir presumptive from birth until her accession to the throne at the age of 6 days. Pretenders in power. During the Middle Ages and the mid-18th century, a number of pretenders to the throne controlled all or a substantial portion of England and Scotland:\nLongevity. Monarchs. Longest-lived. The longest-lived British monarch and ruler was Queen Elizabeth II, who was aged 96 years, 140 days, having surpassed her great-great-grandmother Queen Victoria on 21 December 2007, who had held the record since 18 January 1901, surpassing her own grandfather George III—just four days before her own death on 22 January 1901."], "distances": [0.06451612903225806, 0.0625, 0.05887445887445887, 0.05798319327731093, 0.05661881977671451, 0.05163398692810457, 0.04738562091503268, 0.043255813953488376, 0.04040816326530612, 0.027777777777777776], "supports": [1, 0, 0, 0, 0, 0, 1, 0, 0, 1], "metadatas": [{"pool_index": 5, "support": 1, "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan and the Great River"}, {"support": 0, "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan River", "pool_index": 7}, {"support": 0, "doc_name": "Tarzan and the Tarzan Twins", "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "pool_index": 8}, {"mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan and the Tarzan Twins", "support": 0, "pool_index": 9}, {"support": 0, "doc_name": "Tarzan and the Great River", "pool_index": 6, "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f"}, {"mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "doc_name": "Buried treasure", "support": 0, "pool_index": 59}, {"mapped_id": "007dc247-272e-475c-96c2-5479c1df1d95", "support": 1, "doc_name": "Peter Jackson", "pool_index": 220}, {"pool_index": 223, "doc_name": "Peter Jackson", "support": 0, "mapped_id": "007dc247-272e-475c-96c2-5479c1df1d95"}, {"mapped_id": "00c2befc-9313-4f1d-a469-6d4780fdc424", "support": 0, "pool_index": 78, "doc_name": "No Earthly Connection"}, {"mapped_id": "0136c6f6-a24a-4cef-a6e0-18c84b30339f", "doc_name": "List of British monarchy records", "support": 1, "pool_index": 147}], "recall": 1.0, "precision": 0.3, "ndcg": 0.7613569414627896, "mrr": 1.0}
{"query_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "documents": ["Software management\nSoftware asset management (SAM) is a business practice that involves managing and optimizing the purchase, deployment, maintenance, utilization, and disposal of software applications within an organization. According to ITIL, SAM is defined as “…all of the infrastructure and processes necessary for the effective management, control, and protection of the software assets…throughout all stages of their lifecycle.” \nFundamentally intended to be part of an organization's information technology business strategy, the goals of SAM are to reduce information technology (IT) costs and limit business and legal risk related to the ownership and use of software, while maximizing IT responsiveness and end-user productivity. SAM is particularly important for large corporations regarding redistribution of licenses and managing legal risks associated with software ownership and expiration. SAM technologies track license expiration, thus allowing the company to function ethically and within software compliance regulations. This can be important for both eliminating legal costs associated with license agreement violations and as part of a company's reputation management strategy. Both are important forms of risk management and are critical for large corporations' long-term business strategies. SAM is one facet of a broader business discipline known as IT asset management, which includes overseeing both software and hardware that comprise an organization's computers and network. Role within organizations. SAM can serve many different functions within organizations, depending on their software portfolios, IT infrastructures, resource availability, and business goals. For many organizations, the goal of implementing a SAM program is very tactical, explicitly focused on balancing the number of software licenses purchased with the number of actual licenses consumed or used.", "In addition to balancing the number of licenses purchased with the amount of consumption, an effective SAM program must also ensure that the usage of all installed software is in keeping with the terms and conditions of the specific vendor license agreement. In doing so, organizations can minimize liabilities associated with software piracy in the event of an audit by a software vendor or a third party such as the Business Software Alliance (BSA). SAM, according to this interpretation, involves conducting detailed software inventories on an ongoing basis to determine the exact number of software licenses consumed, comparing this information with the number of licenses purchased, and reviewing how the software is being used in respect to the terms and conditions and establishing controls to ensure that proper licensing practices are maintained on an ongoing basis. This can be accomplished through IT processes, purchasing policies and procedures, and technology solutions such as software inventory tools. Counting installations are the most common means of measuring license consumption but some software is licensed by the number of users, capital, processors, or CPU Cores. More broadly defined, the strategic goals of SAM often include (but are not limited to) the following: \nSAM Technology. Several technologies are available to support key SAM processes:\nInternational Organization for Standardization (ISO). The ISO/IEC 19770 family of standards are designed to help organizations manage IT assets including software assets (SAM). The published standards are outlined below:\nISO/IEC 19770-1:2017: IT Asset Management Systems Requirements is a process framework to enable an organization to incorporate ITAM (including SAM) processes and policies sufficient to satisfy corporate governance requirements and ensure effective support for IT service management overall.", "The implementation of SAM processes to be \"accomplished in multiple staged increments or tiers.\" Part 1 of the standard details SAM processes including control environment, planning and implementation, inventory, verification and compliance, operations management and life cycle. ISO/IEC 19770-2:2015: Software identification tag; establishes specifications for tagging software to optimize its identification and management. The current version was published in 2015 and is a revision to the 2009 original Software ID Tag standard. Using software identification tags or SWID tags makes discovery a simpler and more accurate process that can be verified by software vendors if they audit an organisations entire estate. SWID tags are implemented and supported by many vendors including IBM, Microsoft and Adobe. ISO/IEC 19770-3:2016: Entitlement Management Schema outlines a technical schema which can be used to encapsulate license details including contract information, entitlements, rights, limitations and details about invoice, PO numbers, etc. ISO/IEC 19770-4:2017: Resource Utilization Measurement provides an ITAM data standard for Resource Utilization Measurement (\"RUM\"). ISO/IEC 19770-5:2015: Overview and Vocabulary provides an overview of the 19770 standards as well as defines vocabulary used throughout the standards. Issues with scalability. An example of issues faced when scaling up discovery tools is with Microsoft's System Centre Configuration Manager (SCCM).", "Using SCCM Metering Rules to monitor software usage across a small estate or a small number of applications is relatively easy and reliable given the total number of unique executables (.exe files) and the number of instances of each executable. Turning on Metering Rules for every packaged application and every executable in a large estate quickly makes the volume of data generated unmanageable and expensive to maintain. Most SAM tools which consume SCCM data rely on these Metering Rules to understand usage. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "VITAL is a software suite of digital asset management products by VTLS based on the open source Fedora architecture. It was unveiled at the 2004 American Library Association's Midwinter Meeting. Version 2.0 was released November 29, 2005 after acceptance testing by Australian Research Repositories Online to the World. In 2014, VTLS was acquired by Innovative Interfaces\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "2006 film\nGunahon Ka Sheher is a 2006 Pakistani Urdu language erotic film, directed by Pashto film director Saeed Ali Khan. Synopsis. The story of \"Aik Gunahoon Ka Shehr\" revolves around a young man (Ahmed Butt) fascinated by city life and the thrills it has to offer. Once there, unemployment eventually leads him to join a gang of blackmailers involved in sex crimes, in turn leading to his ruin. Controversy. When the team of Aik Gunahoon Ka Shehr approached the Pakistan Film Censor Board for a clearance certificate, objection was raised over the phrase Gunahoon Ka Shehr. Later the name was modified to Aik Gunahoon Ka Shehr. What exactly they aimed to achieve by this is still a mystery. Secondly, the members of the respected censor board charged that the film contained erotic scenes and dialogue. Consequently, the film appeared before a full board who chopped off several scenes and dialogues which they considered ‘unnecessary’ and ‘irrelevant’, resulting in the producer reshooting them. Annoyed, producer Saeed Iqbal presented his stand before the censor board members, stating that the story of the film depicts the true picture of youth today who indulge in sex and crime. \"The objection was unfair because already a number of Pakistani, Indian and English movies with sexual content are being exhibited at cinemas and cable networks throughout the country,\" he said. He further confessed that it is not a family film. \"Who likes to watch a family film in our dingy cinema houses?", "Seeing what the hotel owner achieved by fair means, the graduate begins to question his actions. He sees the roadside beggar has died, and municipality workers arrive to take away the body. However, discovering the beggar's stash, they abandon his body and squabble over the money. The graduate decides to stop his deceit. He frees the rich man and explains the situation to him in a letter. The rich man and his wife reunite, and he stops drinking. The graduate decides to come clean to the magician's daughter too. He learns the magician's family is about to leave Pushpak. He confesses the truth to the magician's daughter, and to his surprise she forgives him. She writes down something on a paper and drops a rose wrapped in the paper from her car window as they depart Pushpak. The graduate picks up the rose, but the wind blows the paper into a gutter. Later, the graduate is shown standing in line again to apply for job vacancies. Cast. &lt;templatestyles src=\"Div col/styles.css\"/&gt;* Kamal Haasan as the unemployed graduate\nProduction. Development. Singeetam Srinivasa Rao was assisting director K. V. Reddy in a film where there was a scene requiring a character to emote fear without dialogues. Rao wondered if he could make an entire film that way for a long time, but did not have an idea for the story.", "Gunahon Ka Devta may refer to:\nSee also. Topics referred to by the same term\n&lt;templatestyles src=\"Dmbox/styles.css\" /&gt;\n This page lists associated with the title .", "\"Show Me Love\" is the English version of the song \"Ya Tvoya Ne Pervaya\" (Cyrillic: \"Я твоя не первая\") by Russian music duo t.A.T.u. It was released as a promotional single for radio stations, taken from their first English-language studio album \"200 km/h in the Wrong Lane\" (2002). It was meant to be the third official single from \"200 km/h in the Wrong Lane\", after \"All the Things She Said\" and \"Not Gonna Get Us\", however Interscope Records cancelled it and released \"How Soon Is Now?\" instead. The radio promo was only released in Poland. Background and composition. According to t.A.T.u. member Lena Katina, Ivan Shapovalov was inspired to create t.A.T.u. after the release of the 1998 Swedish film \"Show Me Love\", which was centred on a romance between two schoolgirls. The album version of \"Show Me Love\" opens to Katina and Julia Volkova speaking in their native Russian, which translated means \"Hello / Hello / Can you see the wind? / So what? / Just look out of the window / So what? / There was sun yesterday / So what? / Why are you always saying the same thing? / I am an answering machine\". The song then begins, featuring a prominent synthesizer beat throughout the duration of the song, with lyrics regarding to events played down to seem like nuances.", "Using three-quarters high-strength steel and an intensive design, the body structure is 50 per cent stiffer than the outgoing model. Strength enhancements include the incorporation of tailor-welded blanks in the front chassis rails and floor reinforcing, resulting in a bare shell mass of . These advancements not only result in noise, vibration and harshness reductions but also lead to improved handling and crash safety. The development of the VE prompted Holden to redesign the facility in Elizabeth, South Australia, facilitating the assembly of entire sections of the car off the foremost production line. This production method allows for a seamless construction of complete sub-sections such as the engine and transmissions to be assembled on rigs that simplify production. This process is applied to the front-end module of the VE Commodore, comprising its headlights, bumpers, airbag sensors and other accessory components. This modular construction permits the easy removal of the entire front-end as a single-piece unit, resulting in reduced repair costs and easier access to the engine bay. This production technique was the first used by GM and won the SAE Australasia's 2006 \"Automotive Engineering Excellence Award\". A modular design structure known as the \"Flex\" strategy has been applied to the interior where fundamentally different components such as audio units and instrument clusters can be swapped out for the various Commodore variants, creating radically varied interior look and feel without much higher costs. The upshot of this is much greater differentiation between the variants than the outgoing model, creating three distinct interior looks, dubbed \"Functional\", \"Performance\" and \"Luxury\"."], "distances": [0.06451612903225806, 0.0625, 0.06060606060606061, 0.05798319327731093, 0.05798319327731093, 0.04423076923076923, 0.03970125786163522, 0.027777777777777776, 0.027777777777777776, 0.02702702702702703], "supports": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0], "metadatas": [{"pool_index": 100, "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "doc_name": "Software asset management", "support": 1}, {"mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "pool_index": 101, "doc_name": "Software asset management", "support": 0}, {"support": 0, "doc_name": "Software asset management", "pool_index": 102, "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed"}, {"support": 0, "pool_index": 103, "doc_name": "Software asset management", "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed"}, {"pool_index": 104, "support": 0, "doc_name": "VITAL (asset management software)", "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed"}, {"support": 0, "pool_index": 12, "doc_name": "Gunahon Ka Sheher", "mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf"}, {"support": 0, "doc_name": "Pushpaka Vimana (1987 film)", "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "pool_index": 153}, {"doc_name": "Gunahon Ka Devta", "pool_index": 14, "support": 0, "mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf"}, {"mapped_id": "00bfd1eb-be2d-452a-bfff-7366b34221e1", "doc_name": "Show Me Love (t.A.T.u. song)", "support": 0, "pool_index": 184}, {"pool_index": 134, "support": 0, "mapped_id": "0094a9d1-99e6-442c-bd8f-25d4f13c587f", "doc_name": "Holden Commodore (VE)"}], "recall": 1.0, "precision": 0.1, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "documents": ["Self-dosing with poison to gain immunity\nMithridatism is the practice of protecting oneself against a poison by gradually self-administering non-lethal amounts. The word is derived from Mithridates VI, the king of Pontus, who so feared being poisoned that he regularly ingested small doses, aiming to develop immunity. Background. Mithridates VI's father, Mithridates V, was assassinated by poisoning by a conspiracy among his attendants. After this, Mithridates VI's mother held regency over Pontus (a Hellenistic kingdom, 281 BC–62 AD) until a male heir came of age. Mithridates was in competition with his brother for the throne and his mother began to favor his brother. Supposedly, during his youth, he began to suspect plots against him at his own mother's orders and was aware of her possible connection with his father's death. He then began to notice pains in his stomach during his meals and suspected his mother had ordered small amounts of poison to be added to his food to slowly kill him off. With other assassination attempts, he fled into the wild. While in the wild, it is said that he began ingesting non-lethal amounts of poisons and mixing many into a universal remedy to make him immune to all known poisons. After Mithridates' death, many Roman physicians claimed to possess and improve the formula. In keeping with most medical practices of his era, Mithridates' anti-poison routines included a religious component, supervised by the \"Agari\", a group of Scythian shamans who never left him.", "It has been suggested that Russian mystic Rasputin's survival of a poisoning attempt was due to mithridatism, but this has not been proven. Indian epics talk about this practice as well. It has been said that, during the rule of the king Chandragupta Maurya (320–298 BC), there was a practice of selecting beautiful girls and administering poison in small amounts until they grew up, thus making them insensitive to poison. These maidens were called \"vishakanyas\" (visha 'poison' + kanya 'maiden'). It was believed that making love with vishakanyas could result in the death of their partners, hence they were employed to kill enemies. The emperor Bindusara was the son of the first Mauryan emperor Chandragupta Maurya and his queen Durdhara. According to the \"Rajavalikatha\", a Jain work, the original name of this emperor was Simhasena. A legend mentioned in the Jain texts tells the story of how Chandragupta's Guru and advisor Chanakya used to feed the emperor with small doses of poison to build his immunity against possible poisoning attempts by his enemies. One day, Chandragupta, unaware that his food contained poison, shared his food with his pregnant wife, Queen Durdhara, who was seven days away from delivery. The queen, who was not immune to the poison, collapsed and died within a few minutes.", "Chanakya entered the room at the moment she collapsed, and in order to save the child in the womb, he immediately cut open the dead queen's belly and took the baby out. He was just in time; a drop of poison had already reached the baby and touched his head, leaving a permanent blueish spot (a \"bindu\") on his forehead. Thus, the newborn was named \"Bindusara\". In practice. Mithridatism is not effective against all types of poison. Immunity is generally only possible with biologically complex types which the immune system can respond to. Depending on the toxin, the practice can lead to the lethal accumulation of a poison in the body. Results depend on how each poison is processed by the body, i.e. on how the toxic compound is metabolized or passed out of the body. However, in some cases, it is possible to build up a metabolic tolerance against specific non-biological poisons. This involves conditioning the liver to produce more of the particular enzymes that metabolize these poisons. For example, heavy drinkers develop a tolerance to the effects of alcohol. However, metabolic tolerance can also lead to accumulation of the less toxic metabolized compound which can slowly damage the liver. With alcohol this generally leads to conditions such as alcoholic fatty liver disease. Metabolic tolerance is not effective on all types of non-biological poisons. Exposure to certain toxic substances, such as hydrofluoric acid and heavy metals, is either lethal or has little to no effect. A minor exception is cyanide, which can be metabolized by the liver.", "The enzyme rhodanese converts the cyanide into the much less toxic thiocyanate. This process allows humans to ingest small amounts of cyanide in food like apple seeds and survive small amounts of cyanide gas from fires and cigarettes. However, one cannot effectively condition the liver against cyanide, unlike alcohol. Relatively larger amounts of cyanide are still highly lethal because, while the body can produce more rhodanese, the process also requires large amounts of sulfur-containing substrates. In literature. Mithridatism has been used as a plot device in fiction and on-screen; including the Indian fantasy series \"Chandrakanta\", Alexandre Dumas's \"The Count of Monte Cristo\", Holly Black's \"The Cruel Prince\", Nathaniel Hawthorne's \"Rappaccini's Daughter\", Yoshiaki Kawajiri's \"Ninja Scroll\", Dorothy Sayers's \"Strong Poison\", Agatha Christie's \"Curtain\", the manhwa Roxana, the manga/anime Spy x Family, William Goldman's \"The Princess Bride\" (as well as its film adaptation), and the American historical series \"The Borgias\". In Michael Curtis Ford's historical novel \"The Last King\", on the life and conquests of Mithridates VI, the technique is used by Mithridates.", "According to one version of the legend, the oil had then passed to Henry's maternal grandfather, Henry of Grosmont, 1st Duke of Lancaster. Evidence of Henry's deliberate connexion to St Thomas lies in the structure of the tomb itself. The wooden panel at the western end of his tomb bears a painting of the martyrdom of Becket, and the tester, or wooden canopy, above the tomb is painted with Henry's personal motto, 'Soverayne', alternated by crowned golden eagles. Likewise, the three large coats of arms that dominate the tester painting are surrounded by collars of SS, a golden eagle enclosed in each tiret. The presence of such eagle motifs most likely points directly to Henry's coronation oil and his ideological association with St Thomas. Sometime after the King's death, an imposing tomb was built for him and his queen, probably commissioned and paid for by Queen Joan herself. On top of the tomb chest lie detailed alabaster effigies of the King and Queen, crowned and dressed in their ceremonial robes. Henry's body was evidently well-embalmed, as an exhumation in 1832 established, allowing historians to state with reasonable certainty that the effigies are accurate portrait. The Corona Tower. The Corona Tower (sometimes known as \"Beckets's Crown\"), a circular structure at the east end of the Trinity chapel, is widely thought to have received its name from having been built to contain the relic of the crown of St. Thomas's head which was struck off during his murder.", "The Tomb of Ghiyas ud din Balban is located in Mehrauli, New Delhi, India. Built in circa 1287 CE in rubble masonry, the tomb is a building of historical importance in the development of Indo-Islamic architecture, as it was here that first Islamic arch made its appearance in India, and according to many, the first Islamic dome as well, which however hasn't survived, making \"Alai Darwaza\" built in 1311 CE, in the nearby Qutb complex, the earliest surviving dome in India. Ghiyas ud din Balban (1200–1287) was a Turkic ruler of the Delhi Sultanate during the rule of Mamluk dynasty of Delhi (or Slave dynasty) from 1266 to 1287. He was one of the most prominent rulers of the Slave Dynasty. The tomb of Balban was discovered in the mid-20th century. Overview. It is an imposing stone and masonry building, though lacking the splendid ornamentation to be seen in the tomb of his master, Iltutmish. The tomb is surrounded by the ruins of an extensive late-medieval settlement and it offers, from certain angles, a remarkable view of the Qutub Minar. To the east of Balban's tomb, lies a ruined rectangular structure said to be the grave of Khan Shahid, Balban's son, whose original name was Muhammad, who died fighting against the Mongols near Multan in 1285. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "For the first thirteen Olympics, the \"stadion\" footrace was the only event contested, and victory in that sprint was so valued that the next Olympiad was named after the winner, e.g. \"the third year of the eighteenth Olympiad when Ladas of Argos won the stadion.\" The Ancient Games varied over time, but they came to feature running events, a pentathlon (consisting of a jumping event, discus and javelin throws, a foot race, and wrestling), boxing, wrestling, pankration, and equestrian events. Tradition has it that Coroebus, a cook from the city of Elis, was the first Olympic champion, which indicates that the competition was not limited to the aristocracy. The Olympics were of fundamental religious importance, and the sporting events, which were held alongside ritual sacrifices honouring both Zeus (whose famous statue by Phidias stood in his temple at Olympia) and Pelops (divine hero and mythical king of Olympia), did not start until the festival's second day. (Pelops was famous for his chariot race with King Oenomaus of Pisatis.) The winners of the events were admired and immortalised in poems and statues. Although a wreath made from the sacred olive tree in the precinct of Zeus was the only official prize at the Olympic Games, winners' fame brought them economic wealth, too, in the form of subsidies from their hometowns and wealthy sponsors.", "Dr. Rand Brandes tells the story of the title \"Field Work\" in \"The Cambridge Companion to Seamus Heaney\". Heaney originally wanted to name the work “Polder.” His editor, Charles Monteith, insisted that Heaney change the title because readers may not be able to pronounce the word. Heaney then wanted the title “Easter Water,” but this name was also discarded in favor of the final name: \"Field Work\". Heaney said of the final title: \"I gave \"Field Work\" that title partly because there’s an element of samplings in it. But I think there’s an opener note in it as well. What holds \"Field Work\" together—this is only my view of it—is a certain ease of the voice.\" Heaney also provided his own explanation of how all his titles came about: “What usually happens is that I start to look for one [a title] once a ‘critical mass’ of poems gets written. I find that if I have a working title at that stage – say when half a volume is in existence – the title itself can help in shaping, or at least inclining and suggesting, the poems to come.”\nReception. In a review for \"The New York Times\", O’Donoghue called \"Field Work\": “a superb book, the most eloquent and far-reaching book he has written, a perennial poetry offered at a time when many of us have despaired of seeing such a thing.\"", "However, the earliest surviving copies of the narrative ballads that tell his story date to the second half of the 15th century, or the first decade of the 16th century. In these early accounts, Robin Hood's partisanship of the lower classes, his devotion to the Virgin Mary and associated special regard for women, his outstanding skill as an archer, his anti-clericalism, and his particular animosity towards the Sheriff of Nottingham are already clear. Little John, Much the Miller's Son, and Will Scarlet (as Will \"Scarlok\" or \"Scathelocke\") all appear, although not yet Maid Marian or Friar Tuck. The friar has been part of the legend since at least the later 15th century, when he is mentioned in a Robin Hood play script. In modern popular culture, Robin Hood is typically seen as a contemporary and supporter of the late-12th-century king Richard the Lionheart, Robin being driven to outlawry during the misrule of Richard's brother John while Richard was away at the Third Crusade. This view first gained currency in the 16th century. It is not supported by the earliest ballads. The early compilation, \"A Gest of Robyn Hode\", names the king as 'Edward'; and while it does show Robin Hood accepting the King's pardon, he later repudiates it and returns to the greenwood. The oldest surviving ballad, \"Robin Hood and the Monk\", gives even less support to the picture of Robin Hood as a partisan of the true king.", "Some sources say as many as 40,000 attended. These Games featured mainly athletic but also combat sports such as wrestling and the pankration, horse and chariot racing events. It has been widely written that during the Games, all conflicts among the participating city-states were postponed until the Games were finished. This cessation of hostilities was known as the Olympic peace or truce. This idea is a modern myth because the Greeks never suspended their wars. The truce did allow those religious pilgrims who were traveling to Olympia to pass through warring territories unmolested because they were protected by Zeus. See also Finley and Pleket. The origin of the Olympics is shrouded in mystery and legend; one of the most popular myths identifies Heracles and his father Zeus as the progenitors of the Games. According to legend, it was Heracles who first called the Games \"Olympic\" and established the custom of holding them every four years. The myth continues that after Heracles completed his twelve labours, he built the Olympic Stadium as an honour to Zeus. Following its completion, he walked in a straight line for 200 steps and called this distance a \"stadion\" (, Latin: , \"stage\"), which later became a unit of distance. The most widely accepted inception date for the Ancient Olympics is 776 BC; this is based on inscriptions, found at Olympia, listing the winners of a footrace held every four years starting in 776 BC."], "distances": [0.06451612903225806, 0.061553030303030304, 0.059714795008912656, 0.0529616724738676, 0.05202702702702703, 0.051587301587301584, 0.04939024390243903, 0.048611111111111105, 0.040884438881935756, 0.04], "supports": [1, 0, 0, 0, 0, 1, 0, 1, 0, 0], "metadatas": [{"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "pool_index": 95, "doc_name": "Mithridatism", "support": 1}, {"doc_name": "Mithridatism", "pool_index": 96, "mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "support": 0}, {"pool_index": 97, "mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "support": 0, "doc_name": "Mithridatism"}, {"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "pool_index": 98, "support": 0, "doc_name": "Mithridatism"}, {"doc_name": "Trinity Chapel", "mapped_id": "0153cd9c-7536-4ed5-9f1f-0dbf8472a40d", "pool_index": 227, "support": 0}, {"mapped_id": "0166cf7e-2a3b-495d-845f-6427f2f4d8cd", "pool_index": 115, "support": 1, "doc_name": "Tomb of Balban"}, {"pool_index": 139, "doc_name": "Olympic Games", "support": 0, "mapped_id": "00e02ea6-9cca-4c59-9425-b2454cb95776"}, {"doc_name": "Field Work (poetry collection)", "support": 1, "pool_index": 71, "mapped_id": "00eadf15-98f9-482d-b421-af2e5c7bc273"}, {"mapped_id": "00797510-92d0-4289-965d-8f69978bcdd0", "doc_name": "Robin Hood", "pool_index": 92, "support": 0}, {"mapped_id": "00e02ea6-9cca-4c59-9425-b2454cb95776", "pool_index": 138, "doc_name": "Olympic Games", "support": 0}], "recall": 1.0, "precision": 0.3, "ndcg": 0.7844801364718913, "mrr": 1.0}
{"query_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "documents": ["Finding in his pocket, a key to a suite in the plush \"Pushpak\" hotel, the graduate kidnaps and imprisons the rich man in his room at Anand Bhavan, while he moves into the rich man's suite at Pushpak, and takes over his lifestyle. The rich man's wife has an extramarital affair with his friend, who hires a contract killer to kill the rich man without her knowledge. The killer stakes out the rich man's suite at Pushpak and mistakes the graduate as his target. The graduate discovers the same young woman in a suite opposite his balcony in the same hotel. She is the daughter of a magician performing at the hotel, and she slaps him after mistaking him for pulling a prank on her. They mend ways while paying tribute at the funeral of the hotel owner, and then they spend time together and develop a romantic relationship. Meanwhile, the killer tries to kill the graduate with ice daggers, but he fails in every attempt, with the graduate unaware of the threat to his life. Eventually, the graduate realises the killer is in the hotel to kill someone but does not know who. The killer intrudes into his suite, and barely survives getting electrocuted while trying to stab the graduate. The killer travels to the lover's bungalow to report his failure, and the graduate follows him and learns the truth. The rich man's wife learns of her lover's treachery and leaves him. In a montage shown about the hotel owner, the graduate realises that he was once a poor man similar to himself.", "The film was released on 27 November 1987 with different titles for different linguistic regions: its original title \"Pushpaka Vimana\" in Karnataka (in the Kannada language), \"Pushpaka Vimanam\" in Andhra Pradesh (Telugu), \"Pushpak\" (transl. Flower) in Hindi-speaking regions, \"Pesum Padam\" (transl. Talking Picture) in Tamil Nadu (Tamil), and \"Pushpakvimanam\" in Kerala (Malayalam). It received critical acclaim and became a commercial success, with a 35-week theatrical run in Bangalore. The film won the National Film Award for Best Popular Film Providing Wholesome Entertainment as a Kannada entry and in three categories at the 35th Filmfare Awards South in the Kannada branch: Best Film, Best Director (Rao) and Best Actor (Haasan). Plot. An unemployed graduate living in a ramshackle lodge called Anand Bhavan dreams of riches. He tries to show off his meagre wealth in front of a roadside beggar but is then humbled to discover the beggar has accumulated more money than him. He meets a young woman trying on earrings in a fancy shop and then sees her again while waiting in line to apply for job vacancies. She mistakes the expensive car he is leaning against to be his, and he happily pretends she is right. One night, the graduate finds a drunk rich man unconscious by the roadside.", "Seeing what the hotel owner achieved by fair means, the graduate begins to question his actions. He sees the roadside beggar has died, and municipality workers arrive to take away the body. However, discovering the beggar's stash, they abandon his body and squabble over the money. The graduate decides to stop his deceit. He frees the rich man and explains the situation to him in a letter. The rich man and his wife reunite, and he stops drinking. The graduate decides to come clean to the magician's daughter too. He learns the magician's family is about to leave Pushpak. He confesses the truth to the magician's daughter, and to his surprise she forgives him. She writes down something on a paper and drops a rose wrapped in the paper from her car window as they depart Pushpak. The graduate picks up the rose, but the wind blows the paper into a gutter. Later, the graduate is shown standing in line again to apply for job vacancies. Cast. &lt;templatestyles src=\"Div col/styles.css\"/&gt;* Kamal Haasan as the unemployed graduate\nProduction. Development. Singeetam Srinivasa Rao was assisting director K. V. Reddy in a film where there was a scene requiring a character to emote fear without dialogues. Rao wondered if he could make an entire film that way for a long time, but did not have an idea for the story.", "He played the titular lead in the independent film \"Being Charlie\", a semi-autobiographical feature about director Rob Reiner's relationship with his son, which premiered at the 2015 Toronto International Film Festival; the film was released theatrically in 2016. In 2017, he starred in William H. Macy's comedy-drama film \"Krystal\", and as Olly in \"Everything, Everything\", a film adaptation of the novel of the same name. In 2018, Robinson starred as the titular Simon Spier in the gay coming out teen drama film \"Love, Simon\". The film was considered ground-breaking because it was the first major studio film to focus on a gay, teenage romance. Robinson's performance as Simon garnered critical acclaim. After reading the script, Robinson revealed that he broke his own rule to no longer play high schoolers because he saw the cultural importance of the film. That year, Robinson was named in \"Forbes\"' \"30 Under 30\" list in the Hollywood &amp; Entertainment category. In 2019, he co-starred in the third film version of Richard Wright's \"Native Son\". In 2020, Robinson co-starred in the FX miniseries \"A Teacher\", and he narrated his DM responses to the protagonist of \"Love, Victor\", a \"Love, Simon\" spinoff TV series on \"Hulu\", and appeared in two episodes of the show. In 2021, he starred in the Netflix miniseries \"Maid\", opposite Margaret Qualley and Andie MacDowell. References.", "2006 film\nGunahon Ka Sheher is a 2006 Pakistani Urdu language erotic film, directed by Pashto film director Saeed Ali Khan. Synopsis. The story of \"Aik Gunahoon Ka Shehr\" revolves around a young man (Ahmed Butt) fascinated by city life and the thrills it has to offer. Once there, unemployment eventually leads him to join a gang of blackmailers involved in sex crimes, in turn leading to his ruin. Controversy. When the team of Aik Gunahoon Ka Shehr approached the Pakistan Film Censor Board for a clearance certificate, objection was raised over the phrase Gunahoon Ka Shehr. Later the name was modified to Aik Gunahoon Ka Shehr. What exactly they aimed to achieve by this is still a mystery. Secondly, the members of the respected censor board charged that the film contained erotic scenes and dialogue. Consequently, the film appeared before a full board who chopped off several scenes and dialogues which they considered ‘unnecessary’ and ‘irrelevant’, resulting in the producer reshooting them. Annoyed, producer Saeed Iqbal presented his stand before the censor board members, stating that the story of the film depicts the true picture of youth today who indulge in sex and crime. \"The objection was unfair because already a number of Pakistani, Indian and English movies with sexual content are being exhibited at cinemas and cable networks throughout the country,\" he said. He further confessed that it is not a family film. \"Who likes to watch a family film in our dingy cinema houses?", "Treasure Fleet, sometimes billed as The Treasure Fleet, is a Chicago-based band featuring members of The Lawrence Arms, The Arrivals, and Smoking Popes. Originally formed in 2009 by Isaac Thotz and Neil Hennessy, the two added Dave Merriman and Mike Oberlin and played a few shows as a four piece before adding Eli Caterer as a lead guitarist. Their sound has been influenced by bands of the ‘60s and ‘70s. Treasure Fleet played The Fest in 2014 along with Paint It Black, The City on Film, and Iron Chic. The same year they played a four night stint with Alkaline Trio at Metro Chicago. They participated in Recess Records' 25th anniversary tour. Their debut album, \"Cocamotion\", was released in 2012. Their sophomore effort, \"Future Ways\", was released later the same year. In 2015, they released \"The Sun Machine\" on Recess Records. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "The idea for the film that would become \"Pushpaka Vimana\" came to Rao when he was in a shower, after which he wrote the screenplay within two weeks. Kamal Haasan agreed to work on the film after being impressed by the script. According to him, the story was originally a tragedy, but after being inspired by Charlie Chaplin, he and Rao decided to change it to a tragicomedy. \"Pushpaka Vimana\" thus became the first full-length dialogue-less film in India after the \"silent era\" of cinema. The film struggled to find a producer, prompting Rao to take over production himself. When Kannada actor Shringar Nagaraj, a relative of Kannada matinee idol Rajkumar with whom Rao was working at that time, heard that Rao was producing a film on his own, he asked about the subject. Rao narrated \"Pushpaka Vimana\", Nagaraj showed excitement and joined as co-producer, with the film being produced under Mandakani Chitra, a company based in Bangalore, Karnataka. \"Pushpaka Vimana\" was the only film Nagaraj had produced in his entire career. Cinematography was handled by B. C. Gowrishankar, editing by D. Vasu, and art direction by Thota Tharani, who had worked with Rao on \"Raja Paarvai\" (1981). Casting. Since the film had no dialogue, Rao chose to cast actors from different parts of India. Haasan, a native of Tamil Nadu, was cast as the protagonist, an unemployed graduate.", "2003 film directed by Amos Kollek\nHappy End is a 2003 French romantic comedy-drama film. It was written and directed by Amos Kollek; starring Audrey Tautou, Justin Theroux, Jennifer Tilly and Jim Parsons. Plot. The 23-year-old French woman Val Chipzik has many dreams. She travels to New York City to become an actress. There she does temporary jobs and sleeps in the front yard of the screenwriter Jack. With the money she earned, she pays for her continuing education in her dream job. Jack is initially annoyed by Val, then she gives him the idea of a promising script. Jack falls in love with her and demands from the film people who want to shoot according to his script that he can help determine the leading actress to be cast. Cast. &lt;templatestyles src=\"Div col/styles.css\"/&gt;", "1987 film by Singeetam Srinivasa Rao\nPushpaka Vimana (transl. The Flower Chariot) is a 1987 Indian black comedy silent film written and directed by Singeetam Srinivasa Rao, who co-produced it with Shringar Nagaraj. The film, which has no dialogue, stars Kamal Haasan leading an ensemble cast that includes Samir Khakhar, Tinu Anand, K. S. Ramesh, Amala, Farida Jalal, Pratap Potan, Lokanath, P. L. Narayana and Ramya. It revolves around an unemployed graduate who encounters a drunk rich man unconscious and takes over his lifestyle after keeping him prisoner. However, he does not realise the dangers he has brought upon himself because a hired killer believes him to be his target. Rao's desire to make a dialogue-less film came when he was working as an assistant director in a film where a character had to emote fear without dialogue in a scene. Once the idea for \"Pushpaka Vimana\" materialised, Rao wrote the screenplay within two weeks. The film was the only one produced by Nagaraj. Due to the lack of dialogue, Rao was able to cast actors from different parts of India. The cinematography was handled by B. C. Gowrishankar, editing by D. Vasu, art direction by Thota Tharani, and the background score was composed by L. Vaidyanathan. The film was shot in Bangalore, Karnataka.", "Because of the 2007–2008 Writers Guild of America strike, Robinson's family moved back to Washington where he continued to perform on stage in and around Seattle. In 2010, Robinson was cast in the role of Ryder Scanlon, the nephew of Melissa Joan Hart's character, on the ABC Family sitcom \"Melissa &amp; Joey,\" playing the character until its cancellation in 2015. In 2011, while on hiatus from \"Melissa &amp; Joey\", Robinson began filming of the Disney Channel original movie \"Frenemies\"; Robinson played the role of Jake Logan. \"Frenemies\" premiered in January 2012, on the Disney Channel. In 2012, Robinson was cast in the lead role of Joe Toy in director Jordan Vogt-Roberts' \"The Kings of Summer\". He also guest-starred in the episode \"Blue Bell Boy,\" during the third season of HBO's \"Boardwalk Empire\". He also began appearing in a series of television commercials for Cox Communications entitled \"Buffer Time is Bonding Time.\" In 2015, Robinson portrayed Zach Mitchell in \"Jurassic World\", in which he was widely seen. He played Ben Parish in the film adaptation of the novel \"The 5th Wave\", which was released in January 2016. These roles made him unavailable for multiple episodes of the final season of \"Melissa &amp; Joey\", but he returned for the final three episodes."], "distances": [0.05982142857142857, 0.05928509154315606, 0.05643879173290938, 0.049910873440285206, 0.04382284382284382, 0.03225806451612903, 0.03125, 0.030303030303030304, 0.029411764705882353, 0.02857142857142857], "supports": [0, 0, 0, 0, 0, 0, 0, 1, 1, 0], "metadatas": [{"pool_index": 152, "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "support": 0, "doc_name": "Pushpaka Vimana (1987 film)"}, {"pool_index": 151, "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "doc_name": "Pushpaka Vimana (1987 film)", "support": 0}, {"mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "support": 0, "pool_index": 153, "doc_name": "Pushpaka Vimana (1987 film)"}, {"support": 0, "doc_name": "Nick Robinson (American actor)", "pool_index": 204, "mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc"}, {"mapped_id": "0125fabf-83fd-4546-8d9f-e280d29a99cf", "pool_index": 12, "doc_name": "Gunahon Ka Sheher", "support": 0}, {"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "Treasure Fleet", "support": 0, "pool_index": 189}, {"doc_name": "Pushpaka Vimana (1987 film)", "support": 0, "pool_index": 154, "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d"}, {"doc_name": "Happy End (2003 film)", "pool_index": 35, "mapped_id": "00e6518d-0dc2-4893-8877-d1961c2ba127", "support": 1}, {"doc_name": "Pushpaka Vimana (1987 film)", "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "pool_index": 150, "support": 1}, {"mapped_id": "00a8cc56-8d6d-4b72-a1e2-25bd986b8fbc", "doc_name": "Nick Robinson (American actor)", "support": 0, "pool_index": 203}], "recall": 1.0, "precision": 0.2, "ndcg": 0.37800210039683896, "mrr": 0.125}
