{"query_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "documents": ["Fictional character from EastEnders\nBen Mitchell is a fictional character from the BBC soap opera \"EastEnders\", who has been played by six different actors since his on-screen birth on 21 March 1996. Matthew Silver appeared as an infant Ben between 1996 and 1998, and Morgan Whittle played him as a toddler between 1999 and 2001. After a five-year absence from the series, Charlie Jones assumed the role of Ben in 2006. In 2010, the character was recast with Joshua Pascoe in the role, who made his first appearance on 13 December 2010. Pascoe quit the role in 2012 and Ben departed on 24 August 2012. Ben's return was announced in May 2014 with Harry Reid in the role; Ben returned on 22 September 2014. Reid was written out of the series in 2017 and Ben departed on 12 January 2018. Ben was reintroduced in 2019 with the role recast to Max Bowden. Ben returned on 1 April 2019. In December 2023, it was announced Bowden would exit the role. Ben departed the series on 28 March 2024, after being extradited to America for credit card fraud.", "Fictional character from EastEnders\nBen Mitchell is a fictional character from the BBC soap opera \"EastEnders\", who has been played by six different actors since his on-screen birth on 21 March 1996. Matthew Silver appeared as an infant Ben between 1996 and 1998, and Morgan Whittle played him as a toddler between 1999 and 2001. After a five-year absence from the series, Charlie Jones assumed the role of Ben in 2006. In 2010, the character was recast with Joshua Pascoe in the role, who made his first appearance on 13 December 2010. Pascoe quit the role in 2012 and Ben departed on 24 August 2012. Ben's return was announced in May 2014 with Harry Reid in the role; Ben returned on 22 September 2014. Reid was written out of the series in 2017 and Ben departed on 12 January 2018. Ben was reintroduced in 2019 with the role recast to Max Bowden. Ben returned on 1 April 2019. In December 2023, it was announced Bowden would exit the role. Ben departed the series on 28 March 2024, after being extradited to America for credit card fraud.", "However, the storyline where Ben was abused by Stella won \"Best Storyline\" at the 2007 \"Inside Soap\" Awards, and was nominated for the \"Best Soap Storyline\" accolade at the \"TV Quick\" and \"TV Choice\" Awards. In 2012, Pascoe was nominated \"Villain of the Year\", but lost out to Andrew Lancel (\"Coronation Street\"). Lisa O'Connell, also writing for \"The Guardian\", was complimentary of Ben's later, protracted coming out storyline, which she called \"a perfect foundation for years of dramatic conflict\". Storylines. 1996–2012. Ben is born to Phil Mitchell (Steve McFadden) and his then wife Kathy Beale (Gillian Taylforth) in March 1996. Ben becomes ill and is rushed to hospital, where he is diagnosed with meningitis and he is left partially deaf in one ear. As Kathy gives Ben all her affection, Phil turns to alcohol and has an affair with Lorna Cartwright (Janet Dibley), resulting in the breakdown of their marriage. In 1998, Kathy moves to South Africa and takes Ben with her. He accompanies her on two return visits in 1999 before returning with her to South Africa in early 2000. In 2001, Kathy marries a man named Gavin Sullivan (then an unseen character; later played by Paul Nicholas). The same year, Ben briefly returns to stay with Phil who then takes him back to South Africa.", "However, the storyline where Ben was abused by Stella won \"Best Storyline\" at the 2007 \"Inside Soap\" Awards, and was nominated for the \"Best Soap Storyline\" accolade at the \"TV Quick\" and \"TV Choice\" Awards. In 2012, Pascoe was nominated \"Villain of the Year\", but lost out to Andrew Lancel (\"Coronation Street\"). Lisa O'Connell, also writing for \"The Guardian\", was complimentary of Ben's later, protracted coming out storyline, which she called \"a perfect foundation for years of dramatic conflict\". Storylines. 1996–2012. Ben is born to Phil Mitchell (Steve McFadden) and his then wife Kathy Beale (Gillian Taylforth) in March 1996. Ben becomes ill and is rushed to hospital, where he is diagnosed with meningitis and he is left partially deaf in one ear. As Kathy gives Ben all her affection, Phil turns to alcohol and has an affair with Lorna Cartwright (Janet Dibley), resulting in the breakdown of their marriage. In 1998, Kathy moves to South Africa and takes Ben with her. He accompanies her on two return visits in 1999 before returning with her to South Africa in early 2000. In 2001, Kathy marries a man named Gavin Sullivan (then an unseen character; later played by Paul Nicholas). The same year, Ben briefly returns to stay with Phil who then takes him back to South Africa.", "Ben's storylines include: a feud between the show's Mitchell and Beale families for his custody; developing a love of dance and the arts, which is a source of tension between him and his father, Phil Mitchell (Steve McFadden); being physically and mentally abused by Phil's girlfriend Stella Crawford (Sophie Thompson); struggling to come to terms with his homosexuality and then attempting to hide it before coming out; being imprisoned for manslaughter after unintentionally killing Heather Trott (Cheryl Fergison); having a daughter, Lexi Pearce, with Lola Pearce (Danielle Harold), finding out his mother Kathy Beale (Gillian Taylforth) is still alive after faking her own death, relationships with Paul Coker (Jonny Labey) and the closeted Callum Highway (Tony Clay), coming to terms with Paul's death in a homophobic attack, being shot by Hunter Owen (Charlie Winter), blackmailing Martin Fowler (James Bye), losing his hearing after sustaining an injury during a boat crash, going into crime with Danny Hardcastle (Paul Usher), featuring in a male rape storyline, in which Ben is raped by Lewis Butler (Aidan O'Callaghan), and suffering from bulimia. As played by Jones, Ben received generally poor reviews from critics. Grace Dent of \"The Guardian\" wrote several negative opinion pieces on the character, and contacted the BBC with a list of suggestions for humorous storylines in which he could be killed off."], "distances": [0.24108469486236572, 0.24108469486236572, 0.34918302297592163, 0.34918302297592163, 0.35239189863204956], "supports": [0, 0, 0, 0, 1], "metadatas": [{"support": 0, "doc_name": "Ben Mitchell (EastEnders)", "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "pool_index": 160}, {"doc_name": "Ben Mitchell (EastEnders)", "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "pool_index": 1785, "support": 0}, {"doc_name": "Ben Mitchell (EastEnders)", "pool_index": 162, "support": 0, "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f"}, {"doc_name": "Ben Mitchell (EastEnders)", "pool_index": 1787, "support": 0, "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f"}, {"pool_index": 161, "mapped_id": "0003fe44-ab91-4b28-afd7-ae0b4b39043f", "support": 1, "doc_name": "Ben Mitchell (EastEnders)"}], "recall": 1.0, "precision": 0.2, "ndcg": 0.38685280723454163, "mrr": 0.2}
{"query_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "documents": ["&lt;templatestyles src=\"Div col/styles.css\"/&gt;\nOther cast members include Adam Godley as Mr. Teavee and Franziska Troegner as Mrs. Gloop. The other four Golden Ticket winners, Violet Beauregarde, Veruca Salt, Mike Teavee, and Augustus Gloop, are portrayed by AnnaSophia Robb, Julia Winter, Jordan Fry, and Philip Wiegratz, respectively. Blair Dunlop plays young Willy Wonka. Charlie's remaining grandparents, Grandma Georgina, Grandma Josephine, and Grandpa George, are portrayed by Liz Smith, Eileen Essell, and David Morris. Nitin Ganatra and Shelley Conn appear as Prince and Princess Pondicherry. Geoffrey Holder narrates the film. Production. Development. Author Roald Dahl disapproved of the 1971 film adaptation. Warner Bros. Pictures and Brillstein-Grey Entertainment entered into discussions with the Dahl estate in 1991, hoping to purchase the rights to produce another film version of \"Charlie and the Chocolate Factory\". The purchase was finalized in 1998, with Dahl's widow, Felicity (\"Liccy\"), and daughter, Lucy, receiving total artistic control and final privilege on the choices of actors, directors and writers. The Dahl estate's subsequent protection of the source material was the main reason that \"Charlie and the Chocolate Factory\" had languished in development hell since the 1990s.", "&lt;templatestyles src=\"Div col/styles.css\"/&gt;\nOther cast members include Adam Godley as Mr. Teavee and Franziska Troegner as Mrs. Gloop. The other four Golden Ticket winners, Violet Beauregarde, Veruca Salt, Mike Teavee, and Augustus Gloop, are portrayed by AnnaSophia Robb, Julia Winter, Jordan Fry, and Philip Wiegratz, respectively. Blair Dunlop plays young Willy Wonka. Charlie's remaining grandparents, Grandma Georgina, Grandma Josephine, and Grandpa George, are portrayed by Liz Smith, Eileen Essell, and David Morris. Nitin Ganatra and Shelley Conn appear as Prince and Princess Pondicherry. Geoffrey Holder narrates the film. Production. Development. Author Roald Dahl disapproved of the 1971 film adaptation. Warner Bros. Pictures and Brillstein-Grey Entertainment entered into discussions with the Dahl estate in 1991, hoping to purchase the rights to produce another film version of \"Charlie and the Chocolate Factory\". The purchase was finalized in 1998, with Dahl's widow, Felicity (\"Liccy\"), and daughter, Lucy, receiving total artistic control and final privilege on the choices of actors, directors and writers. The Dahl estate's subsequent protection of the source material was the main reason that \"Charlie and the Chocolate Factory\" had languished in development hell since the 1990s.", "Wonka's Chocolate Room was constructed on the 007 Stage at Pinewood, complete with a faux chocolate waterfall and river. Squirrels were trained from birth for Veruca Salt's elimination. Actor Deep Roy performed each Oompa-Loompa individually rather than one performance duplicated digitally. Burton shot the film simultaneously alongside the stop-motion animated film \"Corpse Bride\", which he also directed. Willy Wonka-themed chocolate bars were sold, and a Golden Ticket contest was launched as part of the film's marketing campaign. Early plans to promote the film with a Broadway theatre musical were not realized. \"Charlie and the Chocolate Factory\" premiered on July 10, 2005, and was released in the United States on July 15 to positive critical reviews, who commended it for its visual appeal and dark tone. It was also a box office success, grossing US$475 million and becoming the eighth-highest-grossing film worldwide in 2005. The film received a nomination for Best Costume Design at the 78th Academy Awards, while Depp was nominated for the Golden Globe Award for Best Actor – Musical or Comedy. It remains Tim Burton's second-highest-grossing film to date. &lt;templatestyles src=\"Template:TOC limit/styles.css\" /&gt;\nPlot. Charlie Bucket is a kind and loving boy who lives in poverty with his family near the Wonka Factory.", "Wonka's Chocolate Room was constructed on the 007 Stage at Pinewood, complete with a faux chocolate waterfall and river. Squirrels were trained from birth for Veruca Salt's elimination. Actor Deep Roy performed each Oompa-Loompa individually rather than one performance duplicated digitally. Burton shot the film simultaneously alongside the stop-motion animated film \"Corpse Bride\", which he also directed. Willy Wonka-themed chocolate bars were sold, and a Golden Ticket contest was launched as part of the film's marketing campaign. Early plans to promote the film with a Broadway theatre musical were not realized. \"Charlie and the Chocolate Factory\" premiered on July 10, 2005, and was released in the United States on July 15 to positive critical reviews, who commended it for its visual appeal and dark tone. It was also a box office success, grossing US$475 million and becoming the eighth-highest-grossing film worldwide in 2005. The film received a nomination for Best Costume Design at the 78th Academy Awards, while Depp was nominated for the Golden Globe Award for Best Actor – Musical or Comedy. It remains Tim Burton's second-highest-grossing film to date. &lt;templatestyles src=\"Template:TOC limit/styles.css\" /&gt;\nPlot. Charlie Bucket is a kind and loving boy who lives in poverty with his family near the Wonka Factory.", "2005 film by Tim Burton\nCharlie and the Chocolate Factory is a 2005 musical fantasy film directed by Tim Burton and written by John August, based on the 1964 British novel of the same name by Roald Dahl. The film stars Johnny Depp as Willy Wonka and Freddie Highmore as Charlie Bucket, alongside David Kelly, Helena Bonham Carter, Noah Taylor, Missi Pyle, James Fox, Deep Roy, and Christopher Lee. The storyline follows Charlie as he wins a contest along with four other children and is led by Wonka on a tour of his chocolate factory. Development for a second adaptation of \"Charlie and the Chocolate Factory\" began in 1991, which resulted in Warner Bros. providing the Dahl estate with total artistic control. Prior to Burton's involvement, directors such as Gary Ross, Rob Minkoff, Martin Scorsese, and Tom Shadyac had been involved, while actors Bill Murray, Nicolas Cage, Jim Carrey, Michael Keaton, Brad Pitt, Will Smith, Adam Sandler, and many others, were either in discussion with or considered by the studio to play Wonka. Burton immediately brought regular collaborators Depp and Danny Elfman aboard. \"Charlie and the Chocolate Factory\" represents the first musical film directed by Burton and the first time since \"The Nightmare Before Christmas\" that Elfman contributed to a film score using written songs and his vocals. Filming took place from June to December 2004 at Pinewood Studios in the United Kingdom. Rather than using computer-generated environments, Burton primarily used built sets and practical effects, which he claimed was inspired by the book's emphasis on texture."], "distances": [0.2747228145599365, 0.2747228145599365, 0.3209965229034424, 0.3209965229034424, 0.35749661922454834], "supports": [1, 1, 0, 0, 0], "metadatas": [{"doc_name": "Charlie and the Chocolate Factory (film)", "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "pool_index": 124, "support": 1}, {"doc_name": "Charlie and the Chocolate Factory (film)", "support": 1, "pool_index": 1439, "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59"}, {"mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "support": 0, "pool_index": 121, "doc_name": "Charlie and the Chocolate Factory (film)"}, {"pool_index": 1436, "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "doc_name": "Charlie and the Chocolate Factory (film)", "support": 0}, {"support": 0, "doc_name": "Charlie and the Chocolate Factory (film)", "mapped_id": "000c77ba-2399-41ae-b0c6-c31dc9b6fa59", "pool_index": 120}], "recall": 1.0, "precision": 0.4, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "00367852-4217-48b1-9313-2c21ea592610", "documents": ["Spanish treasure fleet\nThe 1715 Treasure Fleet was actually a combination of two Spanish treasure fleets returning from the New World to Spain, the \"Nueva España Fleet\", under Capt.-General Don Juan Esteban de Ubilla, and the \"Tierra Firme Fleet\", under Don Antonio de Echeverz y Zubiza. At two in the morning on Wednesday, July 31, 1715, seven days after departing from Havana, Cuba, all eleven ships of the fleet were lost in a hurricane along the east coast of Florida. A 12th ship, the French frigate \"Le Grifon\", had sailed with the fleet. Its captain was unfamiliar with the Florida coastline and elected to stay further out to sea. The \"Grifon\" safely returned to Europe. Because the fleet was carrying silver, it is also known as the 1715 Plate Fleet (\"plata\" being the Spanish word for silver). Some artifacts and even coins still wash up on Florida beaches from time to time. According to Cuban records, around 1,500 sailors perished while a small number survived in lifeboats. Many ships, including pirates, took part in the initial salvage. Initially a privateer, Henry Jennings was first accused of piracy for attacking such salvage ships and claiming their salvages. Exhibits and preserves. Treasure hunter Kip Wagner's team built an exhibit held at National Geographic \"Explorers Hall\" in Washington, D.C. that was featured in the January 1965 issue of \"National Geographic\". This was the beginning of a fine collection of 1715 plate fleet treasure that brought hundreds of visitors from around the world.", "Spanish treasure fleet\nThe 1715 Treasure Fleet was actually a combination of two Spanish treasure fleets returning from the New World to Spain, the \"Nueva España Fleet\", under Capt.-General Don Juan Esteban de Ubilla, and the \"Tierra Firme Fleet\", under Don Antonio de Echeverz y Zubiza. At two in the morning on Wednesday, July 31, 1715, seven days after departing from Havana, Cuba, all eleven ships of the fleet were lost in a hurricane along the east coast of Florida. A 12th ship, the French frigate \"Le Grifon\", had sailed with the fleet. Its captain was unfamiliar with the Florida coastline and elected to stay further out to sea. The \"Grifon\" safely returned to Europe. Because the fleet was carrying silver, it is also known as the 1715 Plate Fleet (\"plata\" being the Spanish word for silver). Some artifacts and even coins still wash up on Florida beaches from time to time. According to Cuban records, around 1,500 sailors perished while a small number survived in lifeboats. Many ships, including pirates, took part in the initial salvage. Initially a privateer, Henry Jennings was first accused of piracy for attacking such salvage ships and claiming their salvages. Exhibits and preserves. Treasure hunter Kip Wagner's team built an exhibit held at National Geographic \"Explorers Hall\" in Washington, D.C. that was featured in the January 1965 issue of \"National Geographic\". This was the beginning of a fine collection of 1715 plate fleet treasure that brought hundreds of visitors from around the world.", "Wagner published his book \"Pieces of Eight\" (Recovering The Riches Of A Lost Spanish Fleet) in 1966. This is a detailed account of the finding and exploration of many of these shipwrecks along the Florida \"Treasure Coast.\" An exhibit was set up with a grand opening on May 1, 1967, at the First National Bank of Satellite Beach, Florida. In 1987, another ship in the fleet, the \"Urca de Lima\", became the first shipwreck in the Florida Underwater Archaeological Preserves. Mel Fisher's company, Mel Fisher's Treasures, sold the rights to the 1715 Fleet shipwreck to Queens Jewels, LLC. In 2015, 1715 Fleet - Queens Jewels, LLC and their founder Brent Brisben discovered $4.5 million in gold coins off the coast of Vero Beach, Florida; the coins come from the 1715 Fleet shipwreck site known as the Corrigans wreck. List of identified ships. New evidence (see Jorge Proctor, 2021) shows that the Douglass Beach Wreck, long believed to be the \"Nuestra Señora de las Nieves\", is in fact the \"Santa Rita y Las Animas\", bought by Ubilla in Cuba and renamed \"Nuestra Señora de Regla\", like his flagship. In popular culture. In the 2008 movie \"Fool's Gold\", the protagonists are searching for the location of one of the sunken ships of the treasure fleet (along with its treasure). The treasure fleet was used as the backdrop for a scene in the video game \"\".", "Wagner published his book \"Pieces of Eight\" (Recovering The Riches Of A Lost Spanish Fleet) in 1966. This is a detailed account of the finding and exploration of many of these shipwrecks along the Florida \"Treasure Coast.\" An exhibit was set up with a grand opening on May 1, 1967, at the First National Bank of Satellite Beach, Florida. In 1987, another ship in the fleet, the \"Urca de Lima\", became the first shipwreck in the Florida Underwater Archaeological Preserves. Mel Fisher's company, Mel Fisher's Treasures, sold the rights to the 1715 Fleet shipwreck to Queens Jewels, LLC. In 2015, 1715 Fleet - Queens Jewels, LLC and their founder Brent Brisben discovered $4.5 million in gold coins off the coast of Vero Beach, Florida; the coins come from the 1715 Fleet shipwreck site known as the Corrigans wreck. List of identified ships. New evidence (see Jorge Proctor, 2021) shows that the Douglass Beach Wreck, long believed to be the \"Nuestra Señora de las Nieves\", is in fact the \"Santa Rita y Las Animas\", bought by Ubilla in Cuba and renamed \"Nuestra Señora de Regla\", like his flagship. In popular culture. In the 2008 movie \"Fool's Gold\", the protagonists are searching for the location of one of the sunken ships of the treasure fleet (along with its treasure). The treasure fleet was used as the backdrop for a scene in the video game \"\".", "Literary trope\nBuried treasure is a literary trope commonly associated with depictions of pirates, alongside Vikings, criminals, and Old West outlaws. According to popular conception, these people often buried their stolen fortunes in remote places, intending to return to them later (often with the use of a pirate’s treasure map). Pirates burying treasure was a rare occurrence, with the only known instance being William Kidd, who buried some of his wealth on Gardiners Island. The myth of buried pirate treasure was popularized by such 19th-century fiction as \"Wolfert Webber\", \"The Gold-Bug\", and \"Treasure Island\". The idea of treasure maps leading to buried treasure is considered a fictional device. There are cases of buried treasure from different historical periods, such as the Dacian king Decebalus and Visigoth king Alaric I, who both changed the course of rivers to hide their treasures. Legends of buried pirate treasure have existed for centuries, but authenticated discoveries are rare. For example, extensive excavations on Oak Island, Nova Scotia have not yielded any treasure. The only authenticated treasure chest in the United States is kept at the Pirate Soul Museum in St. Augustine, Florida. Buried treasure is a cultural concept and not the same as a hoard, which is typically found by archaeologists and metal detectors. The Fenn treasure, reportedly buried by millionaire Forrest Fenn in 2010, was found in 2020 in Wyoming. Pirates. Pirates burying treasure was rare."], "distances": [0.31616079807281494, 0.31616079807281494, 0.3211309313774109, 0.3211309313774109, 0.45958560705184937], "supports": [1, 1, 1, 1, 0], "metadatas": [{"support": 1, "mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "doc_name": "1715 Treasure Fleet", "pool_index": 185}, {"support": 1, "mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "pool_index": 1985, "doc_name": "1715 Treasure Fleet"}, {"support": 1, "mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "pool_index": 186, "doc_name": "1715 Treasure Fleet"}, {"mapped_id": "00367852-4217-48b1-9313-2c21ea592610", "pool_index": 1986, "support": 1, "doc_name": "1715 Treasure Fleet"}, {"mapped_id": "012665a7-a828-412a-9a4f-403f998eb36c", "support": 0, "pool_index": 57, "doc_name": "Buried treasure"}], "recall": 1.0, "precision": 0.8, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "documents": ["In 2010, Corr appeared in the final few episodes of ' as Michael Kanaan and was a regular character on the popular Australian television show \"Packed to the Rafters\", playing Dave Rafter's nephew Coby Jennings. In 2013, he appeared in the teen thriller film \"6 Plots\", and starred alongside John Jarratt in \"Wolf Creek 2\", the 2013 sequel to the horror film \"Wolf Creek\". In 2015, Corr starred in Neil Armfield's romantic-drama film \"Holding the Man\", adapted from Timothy Conigrave's 1995 memoir of the same name. He portrayed Conigrave opposite Craig Stott who portrayed Conigrave's partner, John Caleo. In 2016, he starred in the television series \"Wanted\". Corr appeared as Joseph in Helen Edmundson's 2018 film \"Mary Magdalene\". In 2022, he had a recurring role in HBO's \"House of the Dragon\" as Ser Harwin Strong. In 2024, Corr was named for feature film \"Kangaroo.\" Legal issues. In May 2014, Corr was charged with heroin possession after being found with a freezer bag holding 0.26g (less than 1/100 of an ounce) of the drug in the Sydney suburb of Bondi. After admitting to the possession, the actor was given a 12-month good behaviour bond with no conviction recorded. The arrest took place a few days after Corr's grandfather went into a coma following a heart attack.", "In 2010, Corr appeared in the final few episodes of ' as Michael Kanaan and was a regular character on the popular Australian television show \"Packed to the Rafters\", playing Dave Rafter's nephew Coby Jennings. In 2013, he appeared in the teen thriller film \"6 Plots\", and starred alongside John Jarratt in \"Wolf Creek 2\", the 2013 sequel to the horror film \"Wolf Creek\". In 2015, Corr starred in Neil Armfield's romantic-drama film \"Holding the Man\", adapted from Timothy Conigrave's 1995 memoir of the same name. He portrayed Conigrave opposite Craig Stott who portrayed Conigrave's partner, John Caleo. In 2016, he starred in the television series \"Wanted\". Corr appeared as Joseph in Helen Edmundson's 2018 film \"Mary Magdalene\". In 2022, he had a recurring role in HBO's \"House of the Dragon\" as Ser Harwin Strong. In 2024, Corr was named for feature film \"Kangaroo.\" Legal issues. In May 2014, Corr was charged with heroin possession after being found with a freezer bag holding 0.26g (less than 1/100 of an ounce) of the drug in the Sydney suburb of Bondi. After admitting to the possession, the actor was given a 12-month good behaviour bond with no conviction recorded. The arrest took place a few days after Corr's grandfather went into a coma following a heart attack.", "Australian actor\nRyan Corr is an Australian actor. He is known for his roles in the Australian drama series \"Packed to the Rafters\", \"Love Child\" and \"Underbelly\", along with film roles in \"Wolf Creek 2\" (2013), \"The Water Diviner\" (2014), \"Holding the Man\" (2015), as well as the \"Game of Thrones\" prequel \"House of the Dragon\". Early life. Corr was born in Melbourne. His father is Peter Corr, the head coach of the Australian women's goalball team. In 2009, he graduated from the National Institute of Dramatic Art (NIDA). Career. He began making appearances in film and television from the age of five, but started his acting career in earnest at age thirteen with the film \"Opraholic\". His first television performance was on \"The Sleepover Club\" with a supporting role as Matthew McDougal. Following this, he landed a lead role as Sheng Zamett on \"Silversun\" (2004). Soon after, Corr had guest appearances on shows such as ', \"Blue Heelers\", and \"Neighbours\". As a voice actor, he voiced a sheep in \"Charlotte's Web\". In 2006, the second series of \"Blue Water High\" aired on Australian TV in which Corr starred as young surfer Eric, one of the six chosen teens to attend Solar Blue.", "Australian actor\nRyan Corr is an Australian actor. He is known for his roles in the Australian drama series \"Packed to the Rafters\", \"Love Child\" and \"Underbelly\", along with film roles in \"Wolf Creek 2\" (2013), \"The Water Diviner\" (2014), \"Holding the Man\" (2015), as well as the \"Game of Thrones\" prequel \"House of the Dragon\". Early life. Corr was born in Melbourne. His father is Peter Corr, the head coach of the Australian women's goalball team. In 2009, he graduated from the National Institute of Dramatic Art (NIDA). Career. He began making appearances in film and television from the age of five, but started his acting career in earnest at age thirteen with the film \"Opraholic\". His first television performance was on \"The Sleepover Club\" with a supporting role as Matthew McDougal. Following this, he landed a lead role as Sheng Zamett on \"Silversun\" (2004). Soon after, Corr had guest appearances on shows such as ', \"Blue Heelers\", and \"Neighbours\". As a voice actor, he voiced a sheep in \"Charlotte's Web\". In 2006, the second series of \"Blue Water High\" aired on Australian TV in which Corr starred as young surfer Eric, one of the six chosen teens to attend Solar Blue.", "At the end of the film, Beatrice marries her sweetheart, Johnny Fletcher. Trix Ulner decides to give up his unsavory ways. Reviews. \"The reason that this was the final production that the star [Compson] made in the role of producer is easily apparent to those that view it. It is without doubt one of the most incoherent stories that has been screened in a long, long time. Miss Compson has a corking company supporting her, which includes Lon Chaney and others of equal note, but even they cannot pull the picture through...The direction was draggy and wearisome from beginning to end and it did not move the story forward at all. This is a good one to pass up.\" ---\"Variety\"\n\"Among other good characterizations is that of Lon Chaney as the gambler, who would have an easy chance to over-act, but who cleverly avoids this. The picture should make money for the exhibitor.\" ---\"Moving Picture World\"\n\"There is just enough variety of situation and climax to this melodrama to carry it away from conventional channels. (Chaney's) gift for pathos is keenly emphasized. When he rescues the girl from various dangers, he inspires the greatest sympathy.\" ---\"Motion Picture News\"\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;"], "distances": [0.4717884659767151, 0.4717884659767151, 0.5072416067123413, 0.5072416067123413, 0.640377402305603], "supports": [1, 1, 1, 1, 0], "metadatas": [{"doc_name": "Ryan Corr", "pool_index": 171, "mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "support": 1}, {"support": 1, "mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "doc_name": "Ryan Corr", "pool_index": 1841}, {"pool_index": 170, "mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968", "support": 1, "doc_name": "Ryan Corr"}, {"pool_index": 1840, "doc_name": "Ryan Corr", "support": 1, "mapped_id": "003fd9ea-073f-4cd6-a742-4d32d4c6b968"}, {"support": 0, "mapped_id": "09795e55-ed52-4fad-8a4f-51f237619dff", "pool_index": 652, "doc_name": "For Those We Love"}], "recall": 1.0, "precision": 0.8, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "documents": ["Following Miller's death on September 7, 2018, \"Best Day Ever\" debuted at number 26 on the US \"Billboard\" 200 with 17,000 album-equivalent units. Track listing. Credits adapted from DatPiff and Spotify. Notes\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Following Miller's death on September 7, 2018, \"Best Day Ever\" debuted at number 26 on the US \"Billboard\" 200 with 17,000 album-equivalent units. Track listing. Credits adapted from DatPiff and Spotify. Notes\nReferences. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "Best Day Ever is the fifth mixtape by American rapper Mac Miller. It was released by Rostrum Records on March 11, 2011, as the follow-up to Miller's acclaimed mixtape \"K.I.D.S.\" (2010). The mixtape consists of sixteen songs produced by nine producers (predominantly ID Labs), and includes features from rappers Wiz Khalifa and Phonte. Four songs from \"Best Day Ever\" have music videos: \"Donald Trump\", \"Get Up\", \"Wear My Hat\" and \"Best Day Ever\". Release and promotion. Over 20,000 viewers joined Miller for a live video stream prior to the mixtape's release. As of March 2019, the mixtape has received over 1.2 million downloads and 1.5 million streams on its official host, DatPiff. The song \"Donald Trump\" was released as a single on May 17, 2011. It became his first singles entry on the US \"Billboard\" Hot 100, peaking at number 75, and was certified platinum by the Recording Industry Association of America (RIAA). Its music video has received over 180 million views on YouTube, and is Miller's most-viewed video. When the video surpassed 16 million views, Donald Trump acknowledged the song on the social networking site Twitter, stating \"Who wouldn't be flattered?\". In June 2016, \"Best Day Ever\" was remastered and commercially released by Rostrum Records for its fifth anniversary. Critical reception. The mixtape received favorable reviews, including an \"XL\" (second highest) from \"XXL\" magazine. Commercial performance.", "Best Day Ever is the fifth mixtape by American rapper Mac Miller. It was released by Rostrum Records on March 11, 2011, as the follow-up to Miller's acclaimed mixtape \"K.I.D.S.\" (2010). The mixtape consists of sixteen songs produced by nine producers (predominantly ID Labs), and includes features from rappers Wiz Khalifa and Phonte. Four songs from \"Best Day Ever\" have music videos: \"Donald Trump\", \"Get Up\", \"Wear My Hat\" and \"Best Day Ever\". Release and promotion. Over 20,000 viewers joined Miller for a live video stream prior to the mixtape's release. As of March 2019, the mixtape has received over 1.2 million downloads and 1.5 million streams on its official host, DatPiff. The song \"Donald Trump\" was released as a single on May 17, 2011. It became his first singles entry on the US \"Billboard\" Hot 100, peaking at number 75, and was certified platinum by the Recording Industry Association of America (RIAA). Its music video has received over 180 million views on YouTube, and is Miller's most-viewed video. When the video surpassed 16 million views, Donald Trump acknowledged the song on the social networking site Twitter, stating \"Who wouldn't be flattered?\". In June 2016, \"Best Day Ever\" was remastered and commercially released by Rostrum Records for its fifth anniversary. Critical reception. The mixtape received favorable reviews, including an \"XL\" (second highest) from \"XXL\" magazine. Commercial performance.", "\"Best Day Ever\" is the first segment of the 20th episode of the fourth season of the American animated television series \"SpongeBob SquarePants\", and the 80th episode overall. The episode was written by Nate Cash, Tuck Tucker, and Steven Banks, and the animation was directed by Larry Leichliter; Cash and Tucker also functioned as storyboard directors. It originally aired on Nickelodeon in the United States on November 10, 2006. In the episode, SpongeBob is determined to have a perfect day, which, to his disappointment, does not go as he planned. Each of his friends has a different problem of their own, so he sets out to help them while spoiling his own agendas. The episode features a song titled \"The Best Day Ever\" written by Tom Kenny and Andy Paley. A soundtrack album, \"SpongeBob SquarePants: The Best Day Ever\", was released on September 12, 2006. \"Best Day Ever\" pulled an average of 6.7 million viewers upon release. The song was actually used two years earlier in the credits of \"The SpongeBob SquarePants Movie\". Plot. SpongeBob's \"Best Day Ever\" fails to turn out as he planned when he is forced to postpone his activities to help his friends with various problems. He wanted to work at the Krusty Krab, but it is condemned because of a nematode infestation. SpongeBob tries to get the nematodes to go away but they refused to and they eat his pants."], "distances": [0.3132634162902832, 0.3132634162902832, 0.3754465579986572, 0.3754465579986572, 0.5466492176055908], "supports": [0, 0, 1, 1, 0], "metadatas": [{"support": 0, "mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "doc_name": "Best Day Ever (mixtape)", "pool_index": 111}, {"pool_index": 1416, "doc_name": "Best Day Ever (mixtape)", "mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "support": 0}, {"mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "pool_index": 110, "support": 1, "doc_name": "Best Day Ever (mixtape)"}, {"support": 1, "mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1", "pool_index": 1415, "doc_name": "Best Day Ever (mixtape)"}, {"pool_index": 112, "doc_name": "Best Day Ever", "support": 0, "mapped_id": "004c15be-5a80-4261-a93e-5e92d5e96ac1"}], "recall": 1.0, "precision": 0.4, "ndcg": 0.5706417189553201, "mrr": 0.3333333333333333}
{"query_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "documents": ["The rinks of Hollie Duncan (Ontario), Émilia Gagné (Quebec), and Casey Scheidegger (Alberta) made their Scotties debut; although members of Team Ontario had previous experience at the national women's championship, mostly as alternates. Scotties veteran skip Sherry Anderson (Saskatchewan) led a team of Tournament of Hearts rookies. The teams are listed as follows:\nWildcard game. A wildcard play-in game was played on January 26; it was contested between the top two teams on the CTRS standings who did not win their respective provincial championships, and was played between The Glencoe Club's Chelsea Carey rink from Calgary and the East St. Paul Curling Club's Kerri Einarson rink from the Winnipeg exurb of East St. Paul. With Einarson's victory, Manitoba was represented by three different teams in the tournament. \"Friday, January 26, 18:30\"\nRound Robin standings. \"Final Round Robin Standings\"\nRound Robin results. All draw times are listed in Pacific Standard Time (). Draw 1. \"Saturday, January 27, 14:00\"\nDraw 2. \"Saturday, January 27, 19:00\"\nDraw 3. \"Sunday, January 28, 09:00\"\nDraw 4. \"Sunday, January 28, 14:00\"\nDraw 5. \"Sunday, January 28, 19:00\"\nDraw 6. \"Monday, January 29, 09:00\"\nDraw 7. \"Monday, January 29, 14:00\"\nDraw 8. \"Monday, January 29, 19:00\"\nDraw 9.", "The rinks of Hollie Duncan (Ontario), Émilia Gagné (Quebec), and Casey Scheidegger (Alberta) made their Scotties debut; although members of Team Ontario had previous experience at the national women's championship, mostly as alternates. Scotties veteran skip Sherry Anderson (Saskatchewan) led a team of Tournament of Hearts rookies. The teams are listed as follows:\nWildcard game. A wildcard play-in game was played on January 26; it was contested between the top two teams on the CTRS standings who did not win their respective provincial championships, and was played between The Glencoe Club's Chelsea Carey rink from Calgary and the East St. Paul Curling Club's Kerri Einarson rink from the Winnipeg exurb of East St. Paul. With Einarson's victory, Manitoba was represented by three different teams in the tournament. \"Friday, January 26, 18:30\"\nRound Robin standings. \"Final Round Robin Standings\"\nRound Robin results. All draw times are listed in Pacific Standard Time (). Draw 1. \"Saturday, January 27, 14:00\"\nDraw 2. \"Saturday, January 27, 19:00\"\nDraw 3. \"Sunday, January 28, 09:00\"\nDraw 4. \"Sunday, January 28, 14:00\"\nDraw 5. \"Sunday, January 28, 19:00\"\nDraw 6. \"Monday, January 29, 09:00\"\nDraw 7. \"Monday, January 29, 14:00\"\nDraw 8. \"Monday, January 29, 19:00\"\nDraw 9.", "Canadian women's curling championship\nThe Scotties Tournament of Hearts ('; commonly referred to as the Scotties) is the annual Canadian women's curling championship, sanctioned by Curling Canada, formerly called the Canadian Curling Association. The winner goes on to represent Canada at the women's world curling championships. Since 1985, the winner also gets to return to the following year's tournament as \"Team Canada\". It is formally known as the \"Canadian Women's Curling Championship\". Since 1982, the tournament has been sponsored by Kruger Products, which was formerly known as Scott Paper Limited when it was a Canadian subsidiary of Scott Paper Company. As such, the tournament was formerly known as the Scott Tournament of Hearts; when Kimberly-Clark merged with Scott, the Canadian arm was sold to the Quebec-based Kruger Inc. – while Kruger was granted a license to use several Scott brands in Canada until June 2007, it was given a long-term license to the Scotties brand because Kimberly-Clark already owned Kleenex. As such, the tournament was officially renamed the Scotties Tournament of Hearts in 2007. Until 2018, the format was a round robin of 12 teams. Starting with the 2015 Scotties Tournament of Hearts there have been more than twelve eligible teams; therefore a pre-qualification tournament was held to trim the field to twelve. In 2021, a new 18-team format was introduced, in which all 14 member associations of Curling Canada field a team in a main draw of two pools, alongside the defending champions, and the three highest-ranked teams on the Canadian Team Ranking System standings that did not win their provincial championships.", "Canadian women's curling championship\nThe Scotties Tournament of Hearts ('; commonly referred to as the Scotties) is the annual Canadian women's curling championship, sanctioned by Curling Canada, formerly called the Canadian Curling Association. The winner goes on to represent Canada at the women's world curling championships. Since 1985, the winner also gets to return to the following year's tournament as \"Team Canada\". It is formally known as the \"Canadian Women's Curling Championship\". Since 1982, the tournament has been sponsored by Kruger Products, which was formerly known as Scott Paper Limited when it was a Canadian subsidiary of Scott Paper Company. As such, the tournament was formerly known as the Scott Tournament of Hearts; when Kimberly-Clark merged with Scott, the Canadian arm was sold to the Quebec-based Kruger Inc. – while Kruger was granted a license to use several Scott brands in Canada until June 2007, it was given a long-term license to the Scotties brand because Kimberly-Clark already owned Kleenex. As such, the tournament was officially renamed the Scotties Tournament of Hearts in 2007. Until 2018, the format was a round robin of 12 teams. Starting with the 2015 Scotties Tournament of Hearts there have been more than twelve eligible teams; therefore a pre-qualification tournament was held to trim the field to twelve. In 2021, a new 18-team format was introduced, in which all 14 member associations of Curling Canada field a team in a main draw of two pools, alongside the defending champions, and the three highest-ranked teams on the Canadian Team Ranking System standings that did not win their provincial championships.", "The 2018 Scotties Tournament of Hearts, Canada's national women's curling championship, was held from January 27–February 4, 2018 at the South Okanagan Events Centre in Penticton, British Columbia. The winning team represented Canada at the 2018 Ford World Women's Curling Championship held from March 17–25 at the Memorial Gardens in North Bay, Ontario. The 2018 tournament was the first to use a new 16-team format, featuring representation by all fourteen member associations of Curling Canada, the second-place team from the 2017 tournament (as champion Rachel Homan declined to participate due to her qualification for the 2018 Winter Olympics), and a new wildcard team. As part of this new format, the Bronze medal game was removed from the schedule. Teams. Curling Canada introduced a new 16-team format for both the Tournament of Hearts and Brier for 2018, under which all 14 member associations of Curling Canada were represented in the main field, rather than being limited by a pre-qualifying tournament. The teams were divided into two pools for round robin play, after which the top four teams from each advanced to the Championship Pool. Defending champion Rachel Homan declined to participate as Team Canada in order to prepare for the 2018 Winter Olympics; Michelle Englot's team, who finished as runner-up in the 2017 tournament, participated in her place. The final spot in the tournament was filled by a wildcard play-in game held on the Friday before the tournament."], "distances": [0.3460084795951843, 0.3460084795951843, 0.5487393140792847, 0.5487393140792847, 0.6005738973617554], "supports": [1, 1, 0, 0, 0], "metadatas": [{"pool_index": 106, "doc_name": "2018 Scotties Tournament of Hearts", "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "support": 1}, {"pool_index": 1386, "support": 1, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "doc_name": "2018 Scotties Tournament of Hearts"}, {"doc_name": "Scotties Tournament of Hearts", "support": 0, "pool_index": 109, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882"}, {"doc_name": "Scotties Tournament of Hearts", "pool_index": 1389, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882", "support": 0}, {"doc_name": "2018 Scotties Tournament of Hearts", "support": 0, "pool_index": 105, "mapped_id": "00524f4e-d3ab-49db-9a50-d0ba72c77882"}], "recall": 1.0, "precision": 0.4, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "documents": ["1967 film by Robert Day\nTarzan and the Great River is a 1967 adventure film starring Mike Henry in his second of three film appearances as Tarzan. The twenty-seventh and penultimate film of the \"Tarzan\" film series that began with 1932's \"Tarzan the Ape Man\", the film was produced by Sy Weintraub and Steve Shagan, written by Bob Barbash (from a story by Barbash and Lewis Reed), and directed by Robert Day. Released on September 1, 1967, it was followed by \"Tarzan and the Jungle Boy\" in 1968. Plot. Tarzan is called to Brazil by an old friend, The Professor (Paulo Gracindo) to help stop the Jaguar Cult, led by Barcuma (Rafer Johnson), from destroying native villages and enslaving the survivors in his search for diamonds. Tarzan is assisted by Captain Sam Bishop (Jan Murray), a riverboat pilot, and Bishop's young ward, Pepe (Manuel Padilla Jr.), as well as Baron (a lion) and Cheeta (a chimpanzee). On their way they encounter Dr. Ann Philips (Diana Millay), who has witnessed the destruction of a village, and wants to continue fighting a plague by giving much-needed inoculations to natives who live along the Amazon River. Production notes. The movie was filmed entirely on location in Rio de Janeiro, Brazil (Rio de Janeiro Zoo, Parque Lage and Tijuca Forest). Dinky, the chimp portraying Cheeta, bit Mike Henry on the jaw during filming, requiring twenty stitches.", "1967 film by Robert Day\nTarzan and the Great River is a 1967 adventure film starring Mike Henry in his second of three film appearances as Tarzan. The twenty-seventh and penultimate film of the \"Tarzan\" film series that began with 1932's \"Tarzan the Ape Man\", the film was produced by Sy Weintraub and Steve Shagan, written by Bob Barbash (from a story by Barbash and Lewis Reed), and directed by Robert Day. Released on September 1, 1967, it was followed by \"Tarzan and the Jungle Boy\" in 1968. Plot. Tarzan is called to Brazil by an old friend, The Professor (Paulo Gracindo) to help stop the Jaguar Cult, led by Barcuma (Rafer Johnson), from destroying native villages and enslaving the survivors in his search for diamonds. Tarzan is assisted by Captain Sam Bishop (Jan Murray), a riverboat pilot, and Bishop's young ward, Pepe (Manuel Padilla Jr.), as well as Baron (a lion) and Cheeta (a chimpanzee). On their way they encounter Dr. Ann Philips (Diana Millay), who has witnessed the destruction of a village, and wants to continue fighting a plague by giving much-needed inoculations to natives who live along the Amazon River. Production notes. The movie was filmed entirely on location in Rio de Janeiro, Brazil (Rio de Janeiro Zoo, Parque Lage and Tijuca Forest). Dinky, the chimp portraying Cheeta, bit Mike Henry on the jaw during filming, requiring twenty stitches.", "The Tarzan River is a river in the United States territory of Guam. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "The Tarzan River is a river in the United States territory of Guam. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "The chimpanzee was destroyed, and Henry later sued the producers for this accident and other unsafe working conditions on all three of his Tarzan films. The parties settled out of court. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;"], "distances": [0.3705071806907654, 0.3705071806907654, 0.44406741857528687, 0.44406741857528687, 0.46406376361846924], "supports": [1, 1, 0, 0, 0], "metadatas": [{"pool_index": 5, "doc_name": "Tarzan and the Great River", "support": 1, "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f"}, {"support": 1, "doc_name": "Tarzan and the Great River", "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "pool_index": 340}, {"support": 0, "doc_name": "Tarzan River", "pool_index": 7, "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f"}, {"support": 0, "doc_name": "Tarzan River", "pool_index": 342, "mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f"}, {"mapped_id": "0055e39a-cde5-4c17-85c4-4538a4bfb01f", "doc_name": "Tarzan and the Great River", "support": 0, "pool_index": 6}], "recall": 1.0, "precision": 0.4, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "documents": ["Software management\nSoftware asset management (SAM) is a business practice that involves managing and optimizing the purchase, deployment, maintenance, utilization, and disposal of software applications within an organization. According to ITIL, SAM is defined as “…all of the infrastructure and processes necessary for the effective management, control, and protection of the software assets…throughout all stages of their lifecycle.” \nFundamentally intended to be part of an organization's information technology business strategy, the goals of SAM are to reduce information technology (IT) costs and limit business and legal risk related to the ownership and use of software, while maximizing IT responsiveness and end-user productivity. SAM is particularly important for large corporations regarding redistribution of licenses and managing legal risks associated with software ownership and expiration. SAM technologies track license expiration, thus allowing the company to function ethically and within software compliance regulations. This can be important for both eliminating legal costs associated with license agreement violations and as part of a company's reputation management strategy. Both are important forms of risk management and are critical for large corporations' long-term business strategies. SAM is one facet of a broader business discipline known as IT asset management, which includes overseeing both software and hardware that comprise an organization's computers and network. Role within organizations. SAM can serve many different functions within organizations, depending on their software portfolios, IT infrastructures, resource availability, and business goals. For many organizations, the goal of implementing a SAM program is very tactical, explicitly focused on balancing the number of software licenses purchased with the number of actual licenses consumed or used.", "Software management\nSoftware asset management (SAM) is a business practice that involves managing and optimizing the purchase, deployment, maintenance, utilization, and disposal of software applications within an organization. According to ITIL, SAM is defined as “…all of the infrastructure and processes necessary for the effective management, control, and protection of the software assets…throughout all stages of their lifecycle.” \nFundamentally intended to be part of an organization's information technology business strategy, the goals of SAM are to reduce information technology (IT) costs and limit business and legal risk related to the ownership and use of software, while maximizing IT responsiveness and end-user productivity. SAM is particularly important for large corporations regarding redistribution of licenses and managing legal risks associated with software ownership and expiration. SAM technologies track license expiration, thus allowing the company to function ethically and within software compliance regulations. This can be important for both eliminating legal costs associated with license agreement violations and as part of a company's reputation management strategy. Both are important forms of risk management and are critical for large corporations' long-term business strategies. SAM is one facet of a broader business discipline known as IT asset management, which includes overseeing both software and hardware that comprise an organization's computers and network. Role within organizations. SAM can serve many different functions within organizations, depending on their software portfolios, IT infrastructures, resource availability, and business goals. For many organizations, the goal of implementing a SAM program is very tactical, explicitly focused on balancing the number of software licenses purchased with the number of actual licenses consumed or used.", "In addition to balancing the number of licenses purchased with the amount of consumption, an effective SAM program must also ensure that the usage of all installed software is in keeping with the terms and conditions of the specific vendor license agreement. In doing so, organizations can minimize liabilities associated with software piracy in the event of an audit by a software vendor or a third party such as the Business Software Alliance (BSA). SAM, according to this interpretation, involves conducting detailed software inventories on an ongoing basis to determine the exact number of software licenses consumed, comparing this information with the number of licenses purchased, and reviewing how the software is being used in respect to the terms and conditions and establishing controls to ensure that proper licensing practices are maintained on an ongoing basis. This can be accomplished through IT processes, purchasing policies and procedures, and technology solutions such as software inventory tools. Counting installations are the most common means of measuring license consumption but some software is licensed by the number of users, capital, processors, or CPU Cores. More broadly defined, the strategic goals of SAM often include (but are not limited to) the following: \nSAM Technology. Several technologies are available to support key SAM processes:\nInternational Organization for Standardization (ISO). The ISO/IEC 19770 family of standards are designed to help organizations manage IT assets including software assets (SAM). The published standards are outlined below:\nISO/IEC 19770-1:2017: IT Asset Management Systems Requirements is a process framework to enable an organization to incorporate ITAM (including SAM) processes and policies sufficient to satisfy corporate governance requirements and ensure effective support for IT service management overall.", "In addition to balancing the number of licenses purchased with the amount of consumption, an effective SAM program must also ensure that the usage of all installed software is in keeping with the terms and conditions of the specific vendor license agreement. In doing so, organizations can minimize liabilities associated with software piracy in the event of an audit by a software vendor or a third party such as the Business Software Alliance (BSA). SAM, according to this interpretation, involves conducting detailed software inventories on an ongoing basis to determine the exact number of software licenses consumed, comparing this information with the number of licenses purchased, and reviewing how the software is being used in respect to the terms and conditions and establishing controls to ensure that proper licensing practices are maintained on an ongoing basis. This can be accomplished through IT processes, purchasing policies and procedures, and technology solutions such as software inventory tools. Counting installations are the most common means of measuring license consumption but some software is licensed by the number of users, capital, processors, or CPU Cores. More broadly defined, the strategic goals of SAM often include (but are not limited to) the following: \nSAM Technology. Several technologies are available to support key SAM processes:\nInternational Organization for Standardization (ISO). The ISO/IEC 19770 family of standards are designed to help organizations manage IT assets including software assets (SAM). The published standards are outlined below:\nISO/IEC 19770-1:2017: IT Asset Management Systems Requirements is a process framework to enable an organization to incorporate ITAM (including SAM) processes and policies sufficient to satisfy corporate governance requirements and ensure effective support for IT service management overall.", "The implementation of SAM processes to be \"accomplished in multiple staged increments or tiers.\" Part 1 of the standard details SAM processes including control environment, planning and implementation, inventory, verification and compliance, operations management and life cycle. ISO/IEC 19770-2:2015: Software identification tag; establishes specifications for tagging software to optimize its identification and management. The current version was published in 2015 and is a revision to the 2009 original Software ID Tag standard. Using software identification tags or SWID tags makes discovery a simpler and more accurate process that can be verified by software vendors if they audit an organisations entire estate. SWID tags are implemented and supported by many vendors including IBM, Microsoft and Adobe. ISO/IEC 19770-3:2016: Entitlement Management Schema outlines a technical schema which can be used to encapsulate license details including contract information, entitlements, rights, limitations and details about invoice, PO numbers, etc. ISO/IEC 19770-4:2017: Resource Utilization Measurement provides an ITAM data standard for Resource Utilization Measurement (\"RUM\"). ISO/IEC 19770-5:2015: Overview and Vocabulary provides an overview of the 19770 standards as well as defines vocabulary used throughout the standards. Issues with scalability. An example of issues faced when scaling up discovery tools is with Microsoft's System Centre Configuration Manager (SCCM)."], "distances": [0.2242445945739746, 0.2242445945739746, 0.37818658351898193, 0.37818658351898193, 0.46654248237609863], "supports": [1, 1, 0, 0, 0], "metadatas": [{"pool_index": 100, "doc_name": "Software asset management", "support": 1, "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed"}, {"pool_index": 1360, "doc_name": "Software asset management", "support": 1, "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed"}, {"mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "support": 0, "doc_name": "Software asset management", "pool_index": 101}, {"pool_index": 1361, "support": 0, "doc_name": "Software asset management", "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed"}, {"doc_name": "Software asset management", "pool_index": 102, "mapped_id": "00577db7-7b43-4364-b29e-ff4cb606c8ed", "support": 0}], "recall": 1.0, "precision": 0.4, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "documents": ["Self-dosing with poison to gain immunity\nMithridatism is the practice of protecting oneself against a poison by gradually self-administering non-lethal amounts. The word is derived from Mithridates VI, the king of Pontus, who so feared being poisoned that he regularly ingested small doses, aiming to develop immunity. Background. Mithridates VI's father, Mithridates V, was assassinated by poisoning by a conspiracy among his attendants. After this, Mithridates VI's mother held regency over Pontus (a Hellenistic kingdom, 281 BC–62 AD) until a male heir came of age. Mithridates was in competition with his brother for the throne and his mother began to favor his brother. Supposedly, during his youth, he began to suspect plots against him at his own mother's orders and was aware of her possible connection with his father's death. He then began to notice pains in his stomach during his meals and suspected his mother had ordered small amounts of poison to be added to his food to slowly kill him off. With other assassination attempts, he fled into the wild. While in the wild, it is said that he began ingesting non-lethal amounts of poisons and mixing many into a universal remedy to make him immune to all known poisons. After Mithridates' death, many Roman physicians claimed to possess and improve the formula. In keeping with most medical practices of his era, Mithridates' anti-poison routines included a religious component, supervised by the \"Agari\", a group of Scythian shamans who never left him.", "Self-dosing with poison to gain immunity\nMithridatism is the practice of protecting oneself against a poison by gradually self-administering non-lethal amounts. The word is derived from Mithridates VI, the king of Pontus, who so feared being poisoned that he regularly ingested small doses, aiming to develop immunity. Background. Mithridates VI's father, Mithridates V, was assassinated by poisoning by a conspiracy among his attendants. After this, Mithridates VI's mother held regency over Pontus (a Hellenistic kingdom, 281 BC–62 AD) until a male heir came of age. Mithridates was in competition with his brother for the throne and his mother began to favor his brother. Supposedly, during his youth, he began to suspect plots against him at his own mother's orders and was aware of her possible connection with his father's death. He then began to notice pains in his stomach during his meals and suspected his mother had ordered small amounts of poison to be added to his food to slowly kill him off. With other assassination attempts, he fled into the wild. While in the wild, it is said that he began ingesting non-lethal amounts of poisons and mixing many into a universal remedy to make him immune to all known poisons. After Mithridates' death, many Roman physicians claimed to possess and improve the formula. In keeping with most medical practices of his era, Mithridates' anti-poison routines included a religious component, supervised by the \"Agari\", a group of Scythian shamans who never left him.", "A. E. Housman's \"Terence, this is stupid stuff\" (originally published in \"A Shropshire Lad\") invokes mithridatism as a metaphor for the benefit that serious poetry brings to the reader. The final section is a poetic rendition of the Mithridates legend. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "A. E. Housman's \"Terence, this is stupid stuff\" (originally published in \"A Shropshire Lad\") invokes mithridatism as a metaphor for the benefit that serious poetry brings to the reader. The final section is a poetic rendition of the Mithridates legend. References. &lt;templatestyles src=\"Reflist/styles.css\" /&gt;", "It has been suggested that Russian mystic Rasputin's survival of a poisoning attempt was due to mithridatism, but this has not been proven. Indian epics talk about this practice as well. It has been said that, during the rule of the king Chandragupta Maurya (320–298 BC), there was a practice of selecting beautiful girls and administering poison in small amounts until they grew up, thus making them insensitive to poison. These maidens were called \"vishakanyas\" (visha 'poison' + kanya 'maiden'). It was believed that making love with vishakanyas could result in the death of their partners, hence they were employed to kill enemies. The emperor Bindusara was the son of the first Mauryan emperor Chandragupta Maurya and his queen Durdhara. According to the \"Rajavalikatha\", a Jain work, the original name of this emperor was Simhasena. A legend mentioned in the Jain texts tells the story of how Chandragupta's Guru and advisor Chanakya used to feed the emperor with small doses of poison to build his immunity against possible poisoning attempts by his enemies. One day, Chandragupta, unaware that his food contained poison, shared his food with his pregnant wife, Queen Durdhara, who was seven days away from delivery. The queen, who was not immune to the poison, collapsed and died within a few minutes."], "distances": [0.4224933385848999, 0.4224933385848999, 0.5220540761947632, 0.5220540761947632, 0.5711822509765625], "supports": [1, 1, 0, 0, 0], "metadatas": [{"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "support": 1, "pool_index": 95, "doc_name": "Mithridatism"}, {"mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "pool_index": 1250, "support": 1, "doc_name": "Mithridatism"}, {"doc_name": "Mithridatism", "support": 0, "pool_index": 99, "mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2"}, {"support": 0, "doc_name": "Mithridatism", "mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2", "pool_index": 1254}, {"pool_index": 96, "doc_name": "Mithridatism", "support": 0, "mapped_id": "0066d36e-f0e8-4cbb-a302-4c4d0b0498f2"}], "recall": 1.0, "precision": 0.4, "ndcg": 1.0, "mrr": 1.0}
{"query_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "documents": ["The film was released on 27 November 1987 with different titles for different linguistic regions: its original title \"Pushpaka Vimana\" in Karnataka (in the Kannada language), \"Pushpaka Vimanam\" in Andhra Pradesh (Telugu), \"Pushpak\" (transl. Flower) in Hindi-speaking regions, \"Pesum Padam\" (transl. Talking Picture) in Tamil Nadu (Tamil), and \"Pushpakvimanam\" in Kerala (Malayalam). It received critical acclaim and became a commercial success, with a 35-week theatrical run in Bangalore. The film won the National Film Award for Best Popular Film Providing Wholesome Entertainment as a Kannada entry and in three categories at the 35th Filmfare Awards South in the Kannada branch: Best Film, Best Director (Rao) and Best Actor (Haasan). Plot. An unemployed graduate living in a ramshackle lodge called Anand Bhavan dreams of riches. He tries to show off his meagre wealth in front of a roadside beggar but is then humbled to discover the beggar has accumulated more money than him. He meets a young woman trying on earrings in a fancy shop and then sees her again while waiting in line to apply for job vacancies. She mistakes the expensive car he is leaning against to be his, and he happily pretends she is right. One night, the graduate finds a drunk rich man unconscious by the roadside.", "The film was released on 27 November 1987 with different titles for different linguistic regions: its original title \"Pushpaka Vimana\" in Karnataka (in the Kannada language), \"Pushpaka Vimanam\" in Andhra Pradesh (Telugu), \"Pushpak\" (transl. Flower) in Hindi-speaking regions, \"Pesum Padam\" (transl. Talking Picture) in Tamil Nadu (Tamil), and \"Pushpakvimanam\" in Kerala (Malayalam). It received critical acclaim and became a commercial success, with a 35-week theatrical run in Bangalore. The film won the National Film Award for Best Popular Film Providing Wholesome Entertainment as a Kannada entry and in three categories at the 35th Filmfare Awards South in the Kannada branch: Best Film, Best Director (Rao) and Best Actor (Haasan). Plot. An unemployed graduate living in a ramshackle lodge called Anand Bhavan dreams of riches. He tries to show off his meagre wealth in front of a roadside beggar but is then humbled to discover the beggar has accumulated more money than him. He meets a young woman trying on earrings in a fancy shop and then sees her again while waiting in line to apply for job vacancies. She mistakes the expensive car he is leaning against to be his, and he happily pretends she is right. One night, the graduate finds a drunk rich man unconscious by the roadside.", "The idea for the film that would become \"Pushpaka Vimana\" came to Rao when he was in a shower, after which he wrote the screenplay within two weeks. Kamal Haasan agreed to work on the film after being impressed by the script. According to him, the story was originally a tragedy, but after being inspired by Charlie Chaplin, he and Rao decided to change it to a tragicomedy. \"Pushpaka Vimana\" thus became the first full-length dialogue-less film in India after the \"silent era\" of cinema. The film struggled to find a producer, prompting Rao to take over production himself. When Kannada actor Shringar Nagaraj, a relative of Kannada matinee idol Rajkumar with whom Rao was working at that time, heard that Rao was producing a film on his own, he asked about the subject. Rao narrated \"Pushpaka Vimana\", Nagaraj showed excitement and joined as co-producer, with the film being produced under Mandakani Chitra, a company based in Bangalore, Karnataka. \"Pushpaka Vimana\" was the only film Nagaraj had produced in his entire career. Cinematography was handled by B. C. Gowrishankar, editing by D. Vasu, and art direction by Thota Tharani, who had worked with Rao on \"Raja Paarvai\" (1981). Casting. Since the film had no dialogue, Rao chose to cast actors from different parts of India. Haasan, a native of Tamil Nadu, was cast as the protagonist, an unemployed graduate.", "The idea for the film that would become \"Pushpaka Vimana\" came to Rao when he was in a shower, after which he wrote the screenplay within two weeks. Kamal Haasan agreed to work on the film after being impressed by the script. According to him, the story was originally a tragedy, but after being inspired by Charlie Chaplin, he and Rao decided to change it to a tragicomedy. \"Pushpaka Vimana\" thus became the first full-length dialogue-less film in India after the \"silent era\" of cinema. The film struggled to find a producer, prompting Rao to take over production himself. When Kannada actor Shringar Nagaraj, a relative of Kannada matinee idol Rajkumar with whom Rao was working at that time, heard that Rao was producing a film on his own, he asked about the subject. Rao narrated \"Pushpaka Vimana\", Nagaraj showed excitement and joined as co-producer, with the film being produced under Mandakani Chitra, a company based in Bangalore, Karnataka. \"Pushpaka Vimana\" was the only film Nagaraj had produced in his entire career. Cinematography was handled by B. C. Gowrishankar, editing by D. Vasu, and art direction by Thota Tharani, who had worked with Rao on \"Raja Paarvai\" (1981). Casting. Since the film had no dialogue, Rao chose to cast actors from different parts of India. Haasan, a native of Tamil Nadu, was cast as the protagonist, an unemployed graduate.", "2003 film directed by Amos Kollek\nHappy End is a 2003 French romantic comedy-drama film. It was written and directed by Amos Kollek; starring Audrey Tautou, Justin Theroux, Jennifer Tilly and Jim Parsons. Plot. The 23-year-old French woman Val Chipzik has many dreams. She travels to New York City to become an actress. There she does temporary jobs and sleeps in the front yard of the screenwriter Jack. With the money she earned, she pays for her continuing education in her dream job. Jack is initially annoyed by Val, then she gives him the idea of a promising script. Jack falls in love with her and demands from the film people who want to shoot according to his script that he can help determine the leading actress to be cast. Cast. &lt;templatestyles src=\"Div col/styles.css\"/&gt;"], "distances": [0.3627207279205322, 0.3627207279205322, 0.5311427712440491, 0.5311427712440491, 0.5895237922668457], "supports": [0, 0, 0, 0, 1], "metadatas": [{"pool_index": 151, "doc_name": "Pushpaka Vimana (1987 film)", "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "support": 0}, {"doc_name": "Pushpaka Vimana (1987 film)", "support": 0, "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "pool_index": 1656}, {"doc_name": "Pushpaka Vimana (1987 film)", "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "support": 0, "pool_index": 154}, {"doc_name": "Pushpaka Vimana (1987 film)", "support": 0, "mapped_id": "0066e289-2ead-48be-a6bc-f75f0d1ce85d", "pool_index": 1659}, {"mapped_id": "00e6518d-0dc2-4893-8877-d1961c2ba127", "pool_index": 35, "doc_name": "Happy End (2003 film)", "support": 1}], "recall": 1.0, "precision": 0.2, "ndcg": 0.38685280723454163, "mrr": 0.2}
